
#Область ПрограммныйИнтерфейс

Процедура ПриОтправкеЗаявленияНаПодключение(ДокументЗаявление) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьНастройкиПервогоЗапуска(ОбновитьВсе = Ложь) Экспорт
	
КонецФункции

Функция СоздатьПодразделениеКакОрганизациюПоДанным1СКонтрагент(Форма) Экспорт
	
КонецФункции

Функция СоздатьОрганизациюПоДанным1СКонтрагент(Форма, ТихийРежим = Ложь) Экспорт
	
КонецФункции

Функция ФИОРуководителяИз1СКонтрагента(Рук) Экспорт
	
КонецФункции

Функция СоздатьРуководителя(Форма, ОрганизацияОбъект, РеквизитыОрганизации) Экспорт
	
КонецФункции

Функция НайтиИлиСоздатьДолжностьПоНаименованию(Наименование) Экспорт
	
КонецФункции

Функция НайтиИлиСоздатьФизЛицоПоИНН(ИНН, ФИО) Экспорт
	
КонецФункции

Функция ФизЛицоПоИНН(ИНН) Экспорт
	
КонецФункции

Функция СоздатьФизЛицоПоФИОиИНН(ФИО, ИНН = "") Экспорт
	
КонецФункции

Функция ОрганизацияПоИННииКПП(ИНН, КПП = "") Экспорт

КонецФункции

Функция НайтиИлиСоздатьОрганизациюИВладельцаПоФорме(Форма) Экспорт
		
КонецФункции

Процедура ЗаполнитьПриНеобходимости(Приемник, Источник) Экспорт
	
КонецПроцедуры

Функция СоздатьПустышкуОрганизацииИлиИП(ИНН) Экспорт
	
КонецФункции

Процедура ОбновитьПаспортныеДанныеФизЛицаИзЗаявления(ДокументЗаявление) Экспорт

КонецПроцедуры

Процедура ОбновитьДанныеФизЛицаИзЗаявления(ДокументЗаявление) Экспорт
	
КонецПроцедуры

Процедура ОбновитьДанныеОрганизацииИзЗаявления(ДокументЗаявление) Экспорт
	
КонецПроцедуры

Функция НаправленияСдачиОтчетностиПоОрганизации(Организация) Экспорт
	
КонецФункции

Процедура ОбновитьГосОрганыИзЗаявления(ДокументЗаявление) Экспорт

КонецПроцедуры

Процедура ОбработатьИсключение(ИнформацияОбОшибке, ВыполняемоеДействие = "") Экспорт

КонецПроцедуры

Процедура СохранитьПерсональныеНастройки(ПерсональныеНастройки) Экспорт
	
КонецПроцедуры

// Используется для определения необходимости показать интро при первом входе пользователя. Вызывается в облачной отчетности.
//
Функция ПоказатьИнтро() Экспорт
	
КонецФункции

// Служебный метод для метода ПоказатьИнтро(). Вызывается в облачной отчетности.
//
Функция ПолучитьПараметрыЗапускаИнтро() Экспорт
	
КонецФункции

Процедура ОбновитьПараметрыИнтро(ПоказатьИнтро = Ложь) Экспорт
	
КонецПроцедуры

#КонецОбласти