
#Область СлужебныйПрограммныйИнтерфейс

// Запуск длительной операции отправки данных об абоненте в сервис настроек.
//
// Параметры:
// ИдентификаторУчетнойЗаписи - Строка
// ИдентификаторФормы - УникальныйИдентификатор
//
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
//
Функция НачатьОтправкуДанныхАбонентаВСервисНастроек(ИдентификаторУчетнойЗаписи, ИдентификаторФормы = Неопределено) Экспорт
	
	ИмяФункции = "СервисНастроекЭДО.ОтправитьДанныеАбонентаВСервисНастроек";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка данных абонента в сервис настроек 1С-ЭДО'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции, ИдентификаторУчетнойЗаписи);
	
КонецФункции

// Параметры:
//  ИдентификаторОператора - Строка
//
// Возвращаемое значение:
//  Булево
Функция ОператорКонтролируетНедействительныеСертификаты(ИдентификаторОператора) Экспорт
	
	Возврат СервисНастроекЭДО.ОператорКонтролируетНедействительныеСертификаты(ИдентификаторОператора);
	
КонецФункции

#КонецОбласти