
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ПрайсЛист", ПрайсЛист);

	ВнешняяСсылка = ТорговыеПредложенияСлужебный.СсылкаФидаПрайсЛиста(ПрайсЛист);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСсылку(Команда)
	
	ВопросОбновленияСсылки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросОбновленияСсылки()
	
	Оповещение = Новый ОписаниеОповещения("ВопросОбновленияСсылкиЗавершение", ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru = 'Внешняя ссылка будет безвозвратно переформирована. Продолжить?'");
	
	ЗаголовокВопроса = НСтр("ru = 'Обновить внешнюю ссылку прайс-листа 1С:Бизнес-сеть'");
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, ЗаголовокВопроса);

КонецПроцедуры 

&НаКлиенте
Процедура ВопросОбновленияСсылкиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	ВнешняяСсылка = ТорговыеПредложенияВызовСервера.СсылкаФидаПрайсЛиста(ПрайсЛист, Истина);
	
КонецПроцедуры

#КонецОбласти



