#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ХешСуммаПараметровНастройкиОбмена(ВидНастройкиОбмена, ПараметрыНастройкиОбмена) Экспорт
	
	Результат = "";
	
	Если ВидНастройкиОбмена = Перечисления.ВидыНастроекОбменаЗЕРНО.ЗагрузкаСДИЗ Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(XmlСтрока(ПараметрыНастройкиОбмена.ВидПродукции));
		Если ПараметрыНастройкиОбмена.ВидПродукции = Перечисления.ВидыПродукцииИС.Зерно Тогда
			МассивСтрок.Добавить(Формат(ПараметрыНастройкиОбмена.ТипОрганизации, "ЧДЦ=0; ЧРГ=;"));
		КонецЕсли;
		Результат = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(МассивСтрок));
	ИначеЕсли ВидНастройкиОбмена = Перечисления.ВидыНастроекОбменаЗЕРНО.ЗагрузкаПартий Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(XmlСтрока(ПараметрыНастройкиОбмена.ВидПродукции));
		Если ПараметрыНастройкиОбмена.ВидПродукции = Перечисления.ВидыПродукцииИС.Зерно Тогда
			МассивСтрок.Добавить(XmlСтрока(ПараметрыНастройкиОбмена.Операция));
		КонецЕсли;
		Результат = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(МассивСтрок));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли