#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОчиститьАТКПоДокументу(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ВложенныеШтрихкодыАТКИСМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Документ);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура СохранитьАТКПоДокументу(ДанныеЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ВложенныеШтрихкодыАТКИСМП.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли