
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаИнтеграции = Параметры.НастройкаИнтеграции;
	
	Элементы.ДекорацияНадпись.Заголовок = СтрШаблон(Элементы.ДекорацияНадпись.Заголовок, НастройкаИнтеграции);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьИнтеграцию(Команда)
	УдалитьИнтеграциюНаСервере();
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьИнтеграциюНаСервере()
	ТекОбъект = НастройкаИнтеграции.ПолучитьОбъект();
	ТекОбъект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

#КонецОбласти
