
#Область СлужебныйПрограммныйИнтерфейс

Процедура СтрокаРасчетаПриНачалеРедактирования(Форма, ИмяТаблицы, ДанныеСтроки, НоваяСтрока, Копирование) Экспорт
	
	РезервыПоОплатеТрудаКлиентВнутренний.СтрокаРасчетаПриНачалеРедактирования(Форма, ИмяТаблицы, ДанныеСтроки, НоваяСтрока, Копирование);
	
КонецПроцедуры

Процедура СтрокаРасчетаПриОкончанииРедактирования(Форма, ОписаниеТаблицы, ПересчитыватьСотрудникаБезусловно = Неопределено, ПроводитьПерерасчет = Истина, ОписаниеДокумента = Неопределено) Экспорт
	
	РезервыПоОплатеТрудаКлиентВнутренний.СтрокаРасчетаПриОкончанииРедактирования(Форма, ОписаниеТаблицы, ПересчитыватьСотрудникаБезусловно, ПроводитьПерерасчет, ОписаниеДокумента);
	
КонецПроцедуры

Процедура ДобавитьИзмененныеДанные(ИзмененныеДанные, ИмяТаблицы, ФизическоеЛицо = Неопределено, Сотрудник = Неопределено, ВидРасчета = Неопределено, ВидРасчетаРезерва = Неопределено) Экспорт
	
	НоваяСтрока = ИзмененныеДанные.Добавить();
	НоваяСтрока.ИмяТаблицы = ИмяТаблицы;
	
	Если ФизическоеЛицо <> Неопределено Тогда
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	КонецЕсли;
	
	Если Сотрудник <> Неопределено Тогда
		НоваяСтрока.Сотрудник = Сотрудник;
	КонецЕсли;
	
	Если ВидРасчета <> Неопределено Тогда
		НоваяСтрока.ВидРасчета = ВидРасчета;
	КонецЕсли;
	
	Если ВидРасчетаРезерва <> Неопределено Тогда
		НоваяСтрока.ВидРасчетаРезерва = ВидРасчетаРезерва;
	КонецЕсли;
	
КонецПроцедуры

// Отмена исправления в документе.
// Использование процедуры в форме документа-начисления предполагает наличие в форме 
// процедуры ЗаполнитьНачисленияСотрудника.
Процедура ОтменитьИсправление(Форма, ОписаниеТаблицы) Экспорт 
	
	РезервыПоОплатеТрудаКлиентВнутренний.ОтменитьИсправление(Форма, ОписаниеТаблицы)
	
КонецПроцедуры

// Отмена исправления в документе.
// Использование процедуры в форме документа-начисления предполагает наличие в форме 
// процедуры ЗаполнитьНачисленияСотрудника.
Процедура ОтменитьВсеИсправления(Форма, ОписаниеТаблицы) Экспорт
	
	РезервыПоОплатеТрудаКлиентВнутренний.ОтменитьВсеИсправления(Форма, ОписаниеТаблицы)
	
КонецПроцедуры

#КонецОбласти
