
#Область ПрограммныйИнтерфейс

// См. СборСтатистикиУНФ.ОтправитьСобытиеСДопДаннымиВФоне
//
Процедура ОтправитьСобытиеСДопДаннымиВФоне(ИмяСобытия, ДопДанные) Экспорт
	
	СборСтатистикиУНФ.ОтправитьСобытиеСДопДаннымиВФоне(ИмяСобытия, ДопДанные);
	
КонецПроцедуры

// См. СборСтатистикиУНФ.ОтправитьСобытиеСДопДанными
//
Процедура ОтправитьСобытиеСДопДанными(ИмяСобытия, ДопДанные, СообщениеОбОшибке = Неопределено) Экспорт
	
	СборСтатистикиУНФ.ОтправитьСобытиеСДопДанными(ИмяСобытия, ДопДанные, СообщениеОбОшибке);
	
КонецПроцедуры

// Отправляет информацию о запуске приложения.
//
Процедура ОтправитьИнформациюОЗапускеПриложения() Экспорт
	
	Если СтатистикаЗапускаПриложенияОтправлена() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
	
	ЭтоПрочийКлиент = НЕ ЭтоМобильныйКлиент И НЕ ЭтоВебКлиент;
	
	ДопДанные = "<data><ЭтоМобильныйКлиент>{ЭтоМобильныйКлиент}</ЭтоМобильныйКлиент><ЭтоВебКлиент>{ЭтоВебКлиент}</ЭтоВебКлиент><ЭтоПрочийКлиент>{ЭтоПрочийКлиент}</ЭтоПрочийКлиент></data>";
	ДопДанные = СтрЗаменить(ДопДанные, "{ЭтоМобильныйКлиент}", ЭтоМобильныйКлиент);
	ДопДанные = СтрЗаменить(ДопДанные, "{ЭтоВебКлиент}", ЭтоВебКлиент);
	ДопДанные = СтрЗаменить(ДопДанные, "{ЭтоПрочийКлиент}", ЭтоПрочийКлиент);
	
	ПараметрЗапускаКлиента = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ПараметрЗапуска");
	Если ПараметрЗапускаКлиента <> Неопределено И СтрНайти(ПараметрЗапускаКлиента, "ОтключитьЛогикуНачалаРаботыСистемы") > 0 Тогда
		ОтправитьСобытиеСДопДанными("Запуск приложения", ДопДанные);
	Иначе
		ОтправитьСобытиеСДопДаннымиВФоне("Запуск приложения", ДопДанные);
	КонецЕсли;
	
	Если ЭтоМобильныйКлиент Тогда
		ОтправитьИнформациюОЗапускеМобильногоКлиента(ПараметрЗапускаКлиента);
	КонецЕсли;
	
	УстановитьПараметрСтатистикаЗапускаПриложенияОтправлена();
	
КонецПроцедуры // ОтправитьИнформациюОЗапускеПриложения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьИнформациюОЗапускеМобильногоКлиента(ПараметрЗапускаКлиента)
	
	СистемнаяИнформацияКлиента = ОбщегоНазначения.СистемнаяИнформацияКлиента();
	
	ИдентификаторКлиента = "";
	Если ТипЗнч(СистемнаяИнформацияКлиента) = Тип("ФиксированнаяСтруктура") И СистемнаяИнформацияКлиента.Свойство("ИдентификаторКлиента") Тогда
		ИдентификаторКлиента = Строка(СистемнаяИнформацияКлиента.ИдентификаторКлиента);
	КонецЕсли;
	
	Если ПараметрЗапускаКлиента <> Неопределено И СтрНайти(ПараметрЗапускаКлиента, "ОтключитьЛогикуНачалаРаботыСистемы") > 0 Тогда
		СборСтатистикиМК.ОтправитьСобытиеСДопДанными("Запуск приложения", ИдентификаторКлиента);
	Иначе
		СборСтатистикиМК.ОтправитьСобытиеСДопДаннымиВФоне("Запуск приложения", ИдентификаторКлиента);
	КонецЕсли;
	
КонецПроцедуры

Функция СтатистикаЗапускаПриложенияОтправлена()
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПараметрыСеанса.СтатистикаЗапускаПриложенияОтправлена;
	
КонецФункции

Процедура УстановитьПараметрСтатистикаЗапускаПриложенияОтправлена()
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.СтатистикаЗапускаПриложенияОтправлена = Истина;
	
КонецПроцедуры

#КонецОбласти
