#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РежимРаботы = Новый ФиксированнаяСтруктура(УправлениеНебольшойФирмойПовтИсп.РежимРаботыПрограммы());
	Если Не РежимРаботы.МодельСервиса Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнятьОбменССерверомШтрихМ = Значение;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", "ОбменТоваромССерверомШтрихМ");
	Отбор.Вставить("ОбластьДанных", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	
	ТаблицаЗаданий = ОчередьЗаданий.ПолучитьЗадания(Отбор);
	
	Для Каждого ЗаданиеОчереди Из ТаблицаЗаданий Цикл
		Если ЗаданиеОчереди.Использование <> ВыполнятьОбменССерверомШтрихМ Тогда
			ОчередьЗаданий.ИзменитьЗадание(ЗаданиеОчереди.Идентификатор,
			Новый Структура("Использование", ВыполнятьОбменССерверомШтрихМ));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли