
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура НачалоВыбораИзСправочника(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТребованияФНСКлиент.ВыбратьИзСправочникаПоМакету(Элемент, "ДетализацияПричинПоСотрудникам");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВПояснение(Команда)
	
	Результат = Новый Структура();
	
	ДобавитьЗначениеПараметраИзТаблицы(Результат, "ДетализацияПричинПоСотрудникам", НСтр("ru = '- %ФИО (СНИЛС %СНИЛС, средняя з/п %ЗП руб., ставка %Ставка): %Причина'"));
	ДобавитьЗначениеПараметраИзТаблицы(Результат, "Мероприятия", НСтр("ru = '- %Мероприятие'"));
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДобавитьЗначениеПараметраИзТаблицы(Результат, ИмяТаблицы, Шаблон, Знач Замена = "")
	
	Значение = СформироватьПараметрИзТаблицы(ИмяТаблицы, Шаблон);
	ДобавитьЕдиничноеЗначениеПараметра(Результат, ИмяТаблицы, Значение);
		
КонецФункции

&НаКлиенте
Функция ДобавитьЕдиничноеЗначениеПараметра(Результат, Ключ, Значение)
	
	ТребованияФНСКлиентСервер.ДобавитьЗначениеПараметраШаблона(
		Результат, 
		Ключ, 
		Значение);
		
КонецФункции

&НаСервере
Функция СформироватьПараметрИзТаблицы(ИмяТаблицы, Знач Шаблон)
	
	Таблица = ЭтотОбъект[ИмяТаблицы];
	Возврат Справочники.ШаблоныПоясненийДляФНС.СформироватьПараметрИзТаблицы(Таблица, Шаблон);

КонецФункции

&НаКлиенте
Процедура ДетализацияПричинПоСотрудникамФИОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДетализацияПричинПоСотрудникам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФИО) Тогда
		
		ДанныеИсполнителя = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПолучитьДанныеИсполнителя(
			ТекущиеДанные.ФИО, 
			Организация);
			
		ТекущиеДанные.СНИЛС = ДанныеИсполнителя.СНИЛС;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

