///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b".
// ОбщийМодуль.ПереводыСБПc2bПереопределяемый.
//
// Переопределяемые серверные процедуры работы с Системой быстрых платежей:
//  - определение параметров оплаты и возврата на основании первичного документа;
//  - обработка статусов выполнения оплат и возвратов;
//  - формирование шаблонов сообщений и подготовка платежных ссылок.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПрикладныеОперации

// Определяются данные для формирования запроса на оплату в платежную систему СБП.
// Все поля переменной ЗаказНаОплату обязательны для заполнения.
//
// Параметры:
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//    продажу в информационной базе;
//  ЗаказНаОплату - Структура - содержит описание заказа на оплату Системы быстрых платежей:
//    * СуммаОплаты - Число - сумма оплаты в Системе быстрых платежей. Сумма, которую необходимо
//      списать со счета покупателя;
//    * ДатаОплаты - Дата - дата операции оплаты;
//    * СрокЖизниQRКода - Число - содержит значение срока действия QR-кода в целых минутах.
//      Для динамической ссылки: Минимальное значение - 5 минут, максимальное значение - 129 600 минут
//      (90 дней в минутах).
//      Для кассовой ссылки:: Минимальное значение - 5 минут, максимальное значение - 20 минут.
//      В случае передачи значения не входящего в выше
//      описанный диапазон возвращать ошибку "НеверныйФорматЗапроса".
//      Если значение не предано используется стандартный срок использования СБП;
//    * ОтложенноеПолучениеСтатуса - Булево - признак загрузки статуса оплаты регламентным заданием;
//    * НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//      в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//      делать строку не длинной и включать информацию об организации, которая
//      является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//      Если строка не заполнена, будет передано стандартное представление
//      назначения: Оплата СБП {ЗаказНаОплату.СуммаОплаты} RUB.
//      Длина строки не должна превышать 140 символов, в противном случае будет
//      обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//      к символам и их кодировке. Возможна передача следующих значений:
//        - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//         [065-090] и [097-122] в кодировке UTF-8;
//        - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//         [1040-1103] в кодировке UTF-8;
//        - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//        - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//         [091-096], [123-126] в кодировке UTF-8;
//        - символ "№" под номером 8470 в кодировке UTF-8.
//    * ШаблоныНазначений - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//      ** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//      ** Идентификатор - Строка - идентификатор шаблона.
//      ** Наименование - Строка - наименование шаблона для пользователя.
//      ** Параметры - Структура - параметры заполнения шаблона:
//        *** Наименование - Строка - наименование параметра для пользователя.
//        *** Идентификатор - Строка - идентификатор параметра для заполнения.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//    настройка выполнения операции;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//    заказа на оплату переданные при вызове функции ПереводыСБПc2b.ДинамическаяСсылка
//    или ПереводыСБПc2b.АктивироватьКассовуюСсылку.
//
Процедура ПриФормированииЗаказаНаОплатуСБП(
		ДокументОплаты,
		ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриФормированииЗаказаНаОплатуСБП(
		ДокументОплаты,
		ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецПроцедуры

// Определяются данные для формирования запроса на оплату в платежную систему СБП.
// Все поля переменной ЗаказНаОплату обязательны для заполнения.
//
// Параметры:
//  ОснованиеПлатежа - ОпределяемыйТип.ДокументОперацииСБП - документ, который является
//    основанием частичного платежа;
//  ЗаказНаОплату - Структура - содержит описание заказа на оплату Системы быстрых платежей:
//    * СрокЖизниQRКода - Число - содержит значение срока действия QR-кода в целых минутах.
//      Минимальное значение - 5 минут, максимальное значение - 129 600 минут
//      (90 дней в минутах). В случае передачи значения не входящего в выше
//      описанный диапазон возвращать ошибку "НеверныйФорматЗапроса".
//      Если значение не предано используется стандартный срок использования СБП;
//    * НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//      в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//      делать строку не длинной и включать информацию об организации, которая
//      является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//      Если строка не заполнена, будет передано стандартное представление
//      назначения: Оплата СБП {ЗаказНаОплату.СуммаОплаты} RUB.
//      Длина строки не должна превышать 140 символов, в противном случае будет
//      обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//      к символам и их кодировке. Возможна передача следующих значений:
//        - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//         [065-090] и [097-122] в кодировке UTF-8;
//        - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//         [1040-1103] в кодировке UTF-8;
//        - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//        - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//         [091-096], [123-126] в кодировке UTF-8;
//        - символ "№" под номером 8470 в кодировке UTF-8.
//    * ШаблоныНазначений - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//      ** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//      ** Идентификатор - Строка - идентификатор шаблона.
//      ** Наименование - Строка - наименование шаблона для пользователя.
//      ** Параметры - Структура - параметры заполнения шаблона:
//        *** Наименование - Строка - наименование параметра для пользователя.
//        *** Идентификатор - Строка - идентификатор параметра для заполнения.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//    настройка выполнения операции;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//    заказа на оплату переданные при вызове функции ПереводыСБПc2b.ДинамическаяСсылка
//
Процедура ПриФормированииЗаказаНаЧастичнуюОплатуСБП(
		ОснованиеПлатежа,
		ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриФормированииЗаказаНаОплатуСБП(
		ОснованиеПлатежа,
		ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецПроцедуры

// Определяются данные для формирования запроса на возврат в платежную систему СБП.
// Все поля переменной ЗаказНаВозврат обязательны для заполнения.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//   возврат в информационной базе;
//  ЗаказНаВозврат - Структура - содержит описание заказа на возврат в Системе быстрых платежей:
//    * СуммаВозврата - Число - сумма возврата в Системе быстрых платежей. Сумма, которую необходимо
//      перевести на счета покупателя;
//    * ДатаВозврата - Дата - дата операции возврата;
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//   настройка выполнения операции.;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//   заказа на оплату переданные при вызове функции ПереводыСБПc2b.ВозвратОплаты.
//
Процедура ПриФормированииЗаказаНаВозвратСБП(
		ДокументВозврата,
		ЗаказНаВозврат,
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриФормированииЗаказаНаВозвратСБП(
		ДокументВозврата,
		ЗаказНаВозврат,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецПроцедуры

// Определяет алгоритм обработки операции, статус которых был получен регламентным заданием.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//   операцию в информационной базе;
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//    настройка выполнения операций;
//  РезультатОбработки - Структура - результат загрузки статуса операции:
//    * СтатусОперации - Строка - текущее состояние операции операции. Для проверки статуса
//      операции, необходимо использовать функции программного интерфейса общего модуля
//      НастройкиПлатежныхСистемКлиентСервер. Возможные значения:
//        - "Отменена" - по ранее сформированная операция отменена НСПК;
//        - "Выполнена" - участник СБП подтвердил выполнение операции;
//        - "Ошибка" - не удалось выполнить проверку статуса операции из-за ошибки
//           или участник СБП вернул ошибку;
//    * ПараметрыОперации - Структура - дополнительные данные по оплате:
//        ** ДатаОперации - Дата - фактическая дата оплаты в UTC;
//        ** СуммаОперации - Число - фактическая суммы операции по документу;
//        ** ИдентификаторОперации - Строка - идентификатор сформированной операции;
//        ** ДокументЧастичнойОплаты - ДокументСсылка.ПлатежнаяСсылкаСБП - документ частичной оплаты;
//        ** ИдентификаторОплаты- Строка - идентификатор оплаты;
//    * СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//  Обработан - Булево - признак обработки операции. Необходимо установить Истина,
//   после завершения обработки.
//
Процедура ПриЗагрузкеСтатусаОперации(
		ДокументОперации,
		НастройкаПодключения,
		РезультатОбработки,
		Обработан) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриЗагрузкеСтатусаОперации(
		ДокументОперации,
		НастройкаПодключения,
		РезультатОбработки,
		Обработан);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКассовымиСсылками

#КонецОбласти

#Область ФормаПодключениеКассовойСсылки

// Определяет алгоритм, выполняющийся при создании формы подключения кассовой ссылки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма подключения кассовой ссылки.
//  Отказ - Булево - признак отказа от открытия формы.
//
Процедура ПриСозданииНаСервереФормыПодключенияСсылки(Форма, Отказ) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриСозданииНаСервереФормыПодключенияСсылки(Форма, Отказ);
	
КонецПроцедуры

#КонецОбласти

// Заполняет список кассовых ссылок по параметрам настройки.
//
// Параметры:
//  ПараметрыНастройки - Структура - содержит в себе описание настроек подключения:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//      настройка подключения к Системе быстрых платежей.
//  ДанныеКассовыхСсылок -  Структура - содержит описание настроенных кассовых ссылок по параметрам настройки
//    * Количество - Число - количество кассовых ссылок по преданной настройке подключения.
//
Процедура ПриОпределенииДанныхКассовыхСсылок(
		ПараметрыНастройки,
		ДанныеКассовыхСсылок) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриОпределенииДанныхКассовыхСсылок(ПараметрыНастройки, ДанныеКассовыхСсылок);
	
КонецПроцедуры

#КонецОбласти
