
////////////////////////////////////////////////////////////////////////////////
// Получение, обработка и проверка реквизитов банковских счета с сервера
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс 

// Возвращает структуру реквизитов банка из справочника Классификатор банков РФ.
//
// Параметры:
//  СсылкаНаБанк - СправочникСсылка.КлассификаторБанков - ссылка на банк, для которого требуется получить реквизиты.
// 
// Возвращаемое значение:
//  Структура - см. описание возвращаемого значения в функции БанковскиеСчетаСервер.НоваяСтруктураРеквизитовБанка().
//
Функция ПолучитьРеквизитыБанкаИзКлассификатора(СсылкаНаБанк) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	БанкиИзКлассификатора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаБанк);
	БанкиИзСправочника = БанкиУНФ.ПодобратьБанкИзКлассификатора(БанкиИзКлассификатора);
	
	РеквизитыБанковИзСправочника =
		ОбщегоНазначения.ЗначенияРеквизитовОбъектов(БанкиИзСправочника, "Код,Наименование,ЭтоГруппа,РучноеИзменение");
	
	БИКБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаБанк,"Код");
	
	Для каждого ЭлементБанка Из РеквизитыБанковИзСправочника Цикл
		
		Если ЭлементБанка.Значение.Код = БИКБанка И Не ЭлементБанка.Значение.ЭтоГруппа Тогда
			
			РеквизитыБанка = НоваяСтруктураРеквизитовБанка();
			РеквизитыБанка.Ссылка = ЭлементБанка.Ключ;
			РеквизитыБанка.Код = ЭлементБанка.Значение.Код;
			РеквизитыБанка.Наименование = ЭлементБанка.Значение.Наименование;
			РеквизитыБанка.ДеятельностьПрекращена = БанковскиеСчетаСервер.ДеятельностьБанкаПрекращена(
				ЭлементБанка.Значение.РучноеИзменение);
			РеквизитыБанка.ЯвляетсяБанкомРФ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РеквизитыБанка.Ссылка = Справочники.Банки.ПустаяСсылка() Тогда
		ВызватьИсключение НСтр("ru = 'Выбранный банк был изменен или удален из классификатора.
			|Проверьте его наличие в справочнике Классификатор банков РФ'");
	КонецЕсли;
	
	Возврат РеквизитыБанка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяСтруктураРеквизитовБанка()
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Код", "");
	СтруктураРеквизитов.Вставить("СВИФТБИК", "");
	СтруктураРеквизитов.Вставить("Наименование", "");
	СтруктураРеквизитов.Вставить("Ссылка", Справочники.Банки.ПустаяСсылка());
	СтруктураРеквизитов.Вставить("ДеятельностьПрекращена", Ложь);
	СтруктураРеквизитов.Вставить("ЯвляетсяБанкомРФ", Ложь);

	Возврат СтруктураРеквизитов;
	
КонецФункции

#КонецОбласти