#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновитьПодсказкуВводаАдресаВЧестномЗнаке(ЭтотОбъект, Запись.АдресВ1С);
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресВ1СПриИзменении(Элемент)
	
	Запись.ХешАдресаВ1С = ХешАдреса(Запись.АдресВ1С);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресВ1СОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбновитьПодсказкуВводаАдресаВЧестномЗнаке(ЭтотОбъект, Текст);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуВводаАдресаВЧестномЗнаке(Форма, Адрес1С)
	
	Элементы = Форма.Элементы;
	Элементы.АдресВЧЗ.ПодсказкаВвода = Адрес1С;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХешАдреса(Адрес)
	
	Возврат ИнтеграцияИС.ХешированиеДанныхSHA256(Адрес);
	
КонецФункции

#КонецОбласти