#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Договор", ПараметрКоманды);
	ПараметрыЗаполнения(СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.ДоговорИнтеркампани Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя ввести заказ-наряд по договору передачи товаров между организациями.'");
	КонецЕсли;
	Если СтруктураЗаполнения.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя выбирать группу контрагентов.'");
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПараметрыЗаполнения(СтруктураЗаполнения)
	
	Справочники.ДоговорыКонтрагентов.ПараметрыЗаполнения(СтруктураЗаполнения);
	СтруктураЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	
КонецПроцедуры

#КонецОбласти
