
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСКД = Параметры.АдресСКД;
	ИспользоватьОплатуБонусами = Параметры.ИспользоватьОплатуБонусами;
	
	ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек,
			Элементы.КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбора, АдресСКД, ИспользоватьОплатуБонусами);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПодготовитьДанныеВыбора()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, ЭлементФормыДоступныеПоляВыбора,
	АдресСхемыКомпоновкиДанных, ИспользоватьОплатуБонусами)
	
	Попытка
		
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		
		КомпоновщикНастроек.Инициализировать(
			Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
		
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
		КомпоновщикНастроек.Восстановить();
		
		ОграничениеСистемныхПолей = ЭлементФормыДоступныеПоляВыбора.ОграниченияИспользования.Добавить();
		ОграничениеСистемныхПолей.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля");
		ОграничениеСистемныхПолей.Доступность = Ложь;
		
		ОграничениеПоляИмяТаблицы = ЭлементФормыДоступныеПоляВыбора.ОграниченияИспользования.Добавить();
		ОграничениеПоляИмяТаблицы.Поле = Новый ПолеКомпоновкиДанных("ИмяТаблицы");
		ОграничениеПоляИмяТаблицы.Доступность = Ложь;
		
		Если НЕ ИспользоватьОплатуБонусами Тогда
			ОграничениеБонусы = ЭлементФормыДоступныеПоляВыбора.ОграниченияИспользования.Добавить();
			ОграничениеБонусы.Поле = Новый ПолеКомпоновкиДанных("Бонусы");
			ОграничениеБонусы.Доступность = Ложь;
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		ИмяСобытия = НСтр("ru = 'Не удалось инициализировать компоновщик настроек.'", КодОсновногоЯзыка);
		ЗаписьЖурналаРегистрации(ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка, , ,
		ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДанныеВыбора()
	
	СтруктураСтроки = Неопределено;
	
	ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбора.ТекущаяСтрока;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
	
		ПолеВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.
			ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
		
		Если НЕ ПолеВыбора = Неопределено Тогда
		
			ИмяЭлемента = Строка(ПолеВыбора.Поле);
			
			СтруктураСтроки = ОбщегоНазначенияРМККлиент.ДанныеВыбораПараметраШаблонаЧека(ПолеВыбора,
				ИмяЭлемента);
			Если НЕ СтруктураСтроки = Неопределено Тогда
				
				ПодготовленноеИмяЭлемента = СтрЗаменить(ИмяЭлемента,".","");
				СтруктураСтроки.Вставить("ИмяПоля", ПодготовленноеИмяЭлемента);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураСтроки = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(СтруктураСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
