#Область ПрограммныйИнтерфейс

// Добавляет запись в лог.
//
// Параметры:
//  Комментарий            - Строка - строка для записи в лог.
//  УчетнаяЗапись - Ссылка на справочник "УчетныеЗаписиМаркетплейсов".
//  ЭтоОшибка - Булево - признак ошибки.
//  Параметры - Структура - дополнительные параметры.
// 
// Возвращаемое значение:
//  Булево - Истина означает сообщение записано
//
Функция ЗаписатьВЛог( Комментарий, УчетнаяЗапись = Неопределено, ЭтоОшибка = Ложь, Параметры = Неопределено ) Экспорт
	Возврат ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( Комментарий, УчетнаяЗапись, ЭтоОшибка, Параметры );
КонецФункции

Функция БазаЗнанийСовпаденияНайтиСтрокойПолучить( Текст, ПараметрыКонтекст = Неопределено ) Экспорт
	Возврат ОбменСВнешнимиСистемамиЛогирование.БазаЗнанийСовпаденияНайтиСтрокойПолучить( Текст, ПараметрыКонтекст );
КонецФункции

#КонецОбласти