
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЕдиныйНалоговыйСчетЛичныйКабинет.ОсновнаяОрганизация();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.РабочийРежим Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОткрытьФормуЕдиныйНалоговыйСчетЛичныйКабинет", 0.5, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьФормуЕдиныйНалоговыйСчетЛичныйКабинет()
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Организация", Организация);
	
	ОткрытьФорму("Обработка.ЕдиныйНалоговыйСчетЛичныйКабинет.Форма." + Параметры.ИмяФормы,
		ПараметрыФормы,
		ВладелецФормы,
		?(ВладелецФормы = Неопределено, Ложь, Истина),
		?(ВладелецФормы = Неопределено, Неопределено, ЭтотОбъект.Окно));
	
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

