///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ОнлайнОплаты".
// ОбщийМодуль.ОнлайнОплатыКлиент.
//
// Клиентские процедуры настройки использования интеграции и настройки регламентных заданий онлайн оплат:
//  - алгоритмы настройки формы "Интернет-поддержка и сервисы";
//  - открытие формы платежной ссылки.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму настройки онлайн оплат.
//
// Параметры:
//  Владелец - ФормаКлиентскогоПриложения - форма, которая будет установлена в качестве владельца.
//
Процедура НастройкаОнлайнОплат(Владелец) Экспорт
	
	ОткрытьФорму(
		"Справочник.НастройкиОнлайнОплат.Форма.ФормаСписка",
		,
		Владелец);
	
КонецПроцедуры

// Открывает форму формирования ссылки на оплату.
// Позволяет: 
//   * Сформировать новую ссылку.
//   * Просмотреть сформированную ранее ссылку.
//   * Обновить данные в сервисе, если они изменились.
//
// Параметры:
//  ОснованиеПлатежа - Произвольный - основание платежа, для которого нужно сформировать/открыть/обновить ссылку.
//
Процедура ОткрытьФормуПлатежнойСсылки(Знач ОснованиеПлатежа) Экспорт
	
	ОнлайнОплатыСлужебныйКлиент.ОткрытьФормуПлатежнойСсылки(ОснованиеПлатежа);
	
КонецПроцедуры

// Открывает форму списка шаблонов сообщений онлайн оплат. Если шаблоны отсутствуют в информационной базе, то задает
// вопрос о создании шаблон по умолчанию.
//
// Параметры:
//  УникальныйИдентификатор - УникальныйИдентификатор - идентификатор родительской формы.
//
Процедура ОткрытьШаблоныСообщенийОнлайнОплат(УникальныйИдентификатор) Экспорт
	
	ОнлайнОплатыСлужебныйКлиент.ОткрытьШаблоныСообщенийОнлайнОплат(УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти



