#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	Настройки = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиПодключения1СПерсонал);
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура УстановитьВерсиюAPI(ВерсияAPI) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияAPI <> НаборЗаписей[0].ВерсияAPI Тогда
			НаборЗаписей[0].ВерсияAPI = ВерсияAPI;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияAPI = ВерсияAPI;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВерсиюDTO(ВерсияDTO) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияDTO <> НаборЗаписей[0].ВерсияDTO Тогда
			НаборЗаписей[0].ВерсияDTO = ВерсияDTO;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияDTO = ВерсияDTO;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАдресПриложенияПоИмениДоступен(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].АдресПриложенияПоИмениДоступен Тогда
			НаборЗаписей[0].АдресПриложенияПоИмениДоступен = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.АдресПриложенияПоИмениДоступен = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАдресСервисаАвторизации(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].АдресСервисаАвторизации Тогда
			НаборЗаписей[0].АдресСервисаАвторизации = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.АдресСервисаАвторизации = НовоеЗначение;
		Записывать = Ложь;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАдминистраторНеУстановлен(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].АдминистраторНеУстановлен Тогда
			НаборЗаписей[0].АдминистраторНеУстановлен = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.АдминистраторНеУстановлен = НовоеЗначение;
		Записывать = Ложь;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьДатуНедоступностиПриложения(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].ДатаНедоступностиПриложения Тогда
			НаборЗаписей[0].ДатаНедоступностиПриложения = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ДатаНедоступностиПриложения = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьРегламентныеЗаданияЗаблокированы(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].РегламентныеЗаданияЗаблокированы Тогда
			НаборЗаписей[0].РегламентныеЗаданияЗаблокированы = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.РегламентныеЗаданияЗаблокированы = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли