// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область АсинхроннаяОперация

// Проверяет выполнение асинхронных операций в фоне.
// 
// Параметры:
//  АдресаРесурсовПоУчетнымЗаписям - Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиОблачногоЭДО
//  * Значение - Строка
//  
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
//
Функция ПроверитьВыполнениеАсинхронныхОперацииВФоне(Знач АдресаРесурсовПоУчетнымЗаписям) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	ПараметрыПроверокОпераций = Новый Массив; // Массив из см. ИнтеграцияОблачногоЭДО.НовыеПараметрыПроверкиВыполненияАсинхроннойОперации
	
	Для Каждого АдресРесурсаПоУчетнойЗаписи Из АдресаРесурсовПоУчетнымЗаписям Цикл
		ПараметрыПроверки = ИнтеграцияОблачногоЭДО.НовыеПараметрыПроверкиВыполненияАсинхроннойОперации();
		ПараметрыПроверки.УчетнаяЗаписьОблачногоЭДО = АдресРесурсаПоУчетнойЗаписи.Ключ;
		ПараметрыПроверки.АдресРесурса = АдресРесурсаПоУчетнойЗаписи.Значение;
		ПараметрыПроверки.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
		ПараметрыПроверокОпераций.Добавить(ПараметрыПроверки);
	КонецЦикла;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ИнтеграцияОблачногоЭДО.ПроверитьВыполнениеАсинхронныхОпераций", ПараметрыПроверокОпераций);
	
КонецФункции

#КонецОбласти

#Область УчетныеЗаписиОблачногоЭДО

// Параметры:
//  ПараметрыПользователя - См. ИнтеграцияОблачногоЭДО.ПодключитьОблачныйЭДО.ПараметрыПользователя
//  НовоеПодключение - Булево
// 
// Возвращаемое значение:
//  См. ИнтеграцияОблачногоЭДО.ПодключитьОблачныйЭДО
Функция ПодключитьОблачныйЭДО(Знач ПараметрыПользователя, Знач НовоеПодключение) Экспорт
	
	Возврат ИнтеграцияОблачногоЭДО.ПодключитьОблачныйЭДО(ПараметрыПользователя, НовоеПодключение);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиОблачногоЭДО
//  ПараметрыПользователя - См. ИнтеграцияОблачногоЭДО.ПодключитьОблачныйЭДО.ПараметрыПользователя
// 
// Возвращаемое значение:
//  См. ИнтеграцияОблачногоЭДО.ПодключитьПользователяОблачногоЭДО
Функция ПодключитьПользователяОблачногоЭДО(Знач УчетнаяЗапись, Знач ПараметрыПользователя) Экспорт
	
	Возврат ИнтеграцияОблачногоЭДО.ПодключитьПользователяОблачногоЭДО(УчетнаяЗапись, ПараметрыПользователя);
	
КонецФункции

#КонецОбласти

#КонецОбласти
