////////////////////////////////////////////////////////////////////////////////
// Общий модуль ОбменСКонтрагентамиКЭДОВызовСервера
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. ОбменСКонтрагентамиКЭДО.СоздатьНоменклатуруПоДаннымКонтрагента.
Функция СоздатьНоменклатуруПоДаннымКонтрагента(Знач НаборНоменклатурыКонтрагентов, Знач ЗначенияПоУмолчанию) Экспорт
	
	СозданнаяНоменклатура = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СоздатьНоменклатуруПоДаннымКонтрагента(
		НаборНоменклатурыКонтрагентов, ЗначенияПоУмолчанию);
	
	Возврат СозданнаяНоменклатура;
	
КонецФункции

#КонецОбласти