#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
	НеоблагаемыеНДСОперации.Очистить();
	ПодтверждающиеДокументы.Очистить();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Движения.Записать();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
    ПараметрыПроведения = ПодготовитьПараметрыПроведения(ДополнительныеСвойства.ДляПроведения.Ссылка, Отказ);
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    // ФОРМИРОВАНИЕ ДВИЖЕНИЙ
    СформироватьДвиженияРаздела7ДекларацииНДС(
        ПараметрыПроведения.ТаблицаЗаписиРаздела7, Движения, Отказ);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	МассивНепроверяемыхРеквизитов.Добавить("НеоблагаемыеНДСОперации.Контрагент");
	
	Для Каждого СтрокаТаблицы Из НеоблагаемыеНДСОперации Цикл
		
		Префикс = "НеоблагаемыеНДСОперации[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		ИмяСписка = НСтр("ru = 'Необлагаемые НДС операции'");
	
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Контрагент)
			И ТипЗнч(СтрокаТаблицы.ДокументРеализации) <> Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, 
							НСтр("ru = 'Контрагент'"), 
							СтрокаТаблицы.НомерСтроки, ИмяСписка);
			Поле = Префикс + "Контрагент"; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	//ПроведениеДокументовПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ПроведениеДокументовПереопределяемый.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#Область ПодготовкаПараметровПроведенияФормированияРаздела7

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
    
    ПараметрыПроведения = Новый Структура;
    
    Запрос = Новый Запрос;
    
    Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
    Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
    Результат = Запрос.Выполнить();
    ПараметрыПроведения.Вставить("Реквизиты", Результат.Выгрузить());
    Реквизиты = ПараметрыПроведения.Реквизиты[0];
    
    Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период) Тогда
        Отказ = Истина;
        Возврат ПараметрыПроведения;
    КонецЕсли;
    
    Запрос.УстановитьПараметр("Организация",                Реквизиты.Организация);
    Запрос.УстановитьПараметр("ДатаДокумента",              Реквизиты.Период);
    Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(Реквизиты.Период), ВидГраницы.Включая));
    Запрос.УстановитьПараметр("КодыРеализацийНеНаТерриторииРФ", 
        Справочники.КодыОперацийРаздела7ДекларацииПоНДС.КодыРеализацииНеНаТерриторииРФ());
    Запрос.УстановитьПараметр("ПравилаЗаполненияДекларацииС4кв2020", 
        УчетНДС.ПравилаЗаполненияДекларацииС4кв2020(Реквизиты.Период));
    
    НомераТаблиц = Новый Структура;
    Запрос.Текст = ТекстЗапросаЗаписиРаздела7(НомераТаблиц);
        
    Результат = Запрос.ВыполнитьПакет();
    
    Для каждого НомерТаблицы Из НомераТаблиц Цикл
        ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
    КонецЦикла;
    
    Возврат ПараметрыПроведения;
    
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента()

    ТекстЗапроса =
    "ВЫБРАТЬ
    |   Реквизиты.Дата КАК Период,
    |   Реквизиты.Организация КАК Организация,
    |   Реквизиты.Ссылка КАК Регистратор
    |ИЗ
    |   Документ.ФормированиеЗаписейРаздела7ДекларацииНДС КАК Реквизиты
    |ГДЕ
    |   Реквизиты.Ссылка = &Ссылка";
    
    Возврат ТекстЗапроса;
    
КонецФункции // ТекстЗапросаРеквизитыДокумента()

Функция ТекстЗапросаЗаписиРаздела7(НомераТаблиц)
    
    НомераТаблиц.Вставить("ТаблицаЗаписиРаздела7", НомераТаблиц.Количество());
    
    ТекстЗапроса = 
    "ВЫБРАТЬ
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации КАК КодОперации,
    |   СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации) КАК СуммаРеализации,
    |   СУММА(ВЫБОР
    |           КОГДА &ПравилаЗаполненияДекларацииС4кв2020
    |               ТОГДА ВЫБОР
    |                       КОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации В (&КодыРеализацийНеНаТерриторииРФ)
    |                           ТОГДА 0
    |                       ИНАЧЕ ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаПриобретения
    |                   КОНЕЦ
    |           КОГДА КодыОперацийРаздела7ДекларацииПоНДС.ОперацияНеПодлежитНалогообложению
    |               ТОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаПриобретения
    |           ИНАЧЕ 0
    |       КОНЕЦ) КАК СуммаПриобретения,
    |   СУММА(ВЫБОР
    |           КОГДА &ПравилаЗаполненияДекларацииС4кв2020
    |               ТОГДА ВЫБОР
    |                       КОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации В (&КодыРеализацийНеНаТерриторииРФ)
    |                           ТОГДА 0
    |                       ИНАЧЕ ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСПрямой + ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСРаспределенный
    |                   КОНЕЦ
    |           КОГДА КодыОперацийРаздела7ДекларацииПоНДС.ОперацияНеПодлежитНалогообложению
    |               ТОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСПрямой + ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСРаспределенный
    |           ИНАЧЕ 0
    |       КОНЕЦ) КАК СуммаНДС,
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата КАК Период,
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка КАК Регистратор,
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация КАК Организация
    |ИЗ
    |   Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
    |       ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
    |ГДЕ
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка = &Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации,
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата,
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка,
    |   ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация";
    
    Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
    
КонецФункции

#КонецОбласти

#Область ПроведениеДокументаФормированияРаздела7

// Формирование записей раздела 7 Декларации НДС
Процедура СформироватьДвиженияРаздела7ДекларацииНДС(ТаблицаДвижений, Движения, Отказ) Экспорт
    
    Если Не ЗначениеЗаполнено(ТаблицаДвижений) Тогда
        Возврат;
    КонецЕсли;
    
    Параметры = ПодготовитьПараметрыНДСЗаписиРаздела7Декларации(ТаблицаДвижений);
    
    Для Каждого СтрокаТаблицы Из Параметры.ТаблицаНДСЗаписиРаздела7Декларации Цикл
        Запись = Движения.НДСЗаписиРаздела7Декларации.Добавить();
        ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
    КонецЦикла;
    
    Движения.НДСЗаписиРаздела7Декларации.Записывать = Истина;
    
КонецПроцедуры

Функция ПодготовитьПараметрыНДСЗаписиРаздела7Декларации(ТаблицаДвижений)
    
    Параметры = Новый Структура;
    
    СписокОбязательныхКолонок = ""
    + "Период,"            // <Дата> - период движений - дата документа
    + "Регистратор,"       // <ДокументСсылка.ФормированиеЗаписейРаздела7ДекларацииНДС> - документ-регистратор движений
    + "Организация,"       // <СправочникСсылка.Организации> - организация
    + "КодОперации,"       // <СправочникСсылка.КодыОперацийРаздела7ДекларацииПоНДС> - код операции для раздела 7 Декларации 
    + "СуммаРеализации,"   // <Число> 
    + "СуммаПриобретения," // <Число>
    + "СуммаНДС";          // <Число>
    
    Параметры.Вставить("ТаблицаНДСЗаписиРаздела7Декларации", ПрослеживаемостьПереопределяемый.ПолучитьТаблицуПараметровПроведения(
            ТаблицаДвижений, СписокОбязательныхКолонок));
            
    Возврат Параметры;
    
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли