#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Будет удалена в следующей версии программы.
// @skip-warning ПустойМетод - переопределяемый метод.
//
Процедура ОбработкаЗакрытияФормыНачалаРаботыНаКлиенте(ЗначенияРеквизитов, ПараметрыНачалаРаботы, ОбработкаЗавершена) Экспорт
КонецПроцедуры

// Устарела. Будет удалена в следующей версии программы.
// @skip-warning ПустойМетод - переопределяемый метод.
//
Процедура ДозаполнитьПараметрыОткрытияФормы(ПараметрыОткрытия, ПараметрыНачалаРаботы) Экспорт
КонецПроцедуры

// Устарела. Будет удалена в следующей версии программы.
// @skip-warning ПустойМетод - переопределяемый метод.
//
Процедура ПереопределитьОписанияОповещенияЗакрытияФормы(ОписаниеОповещения, ПараметрыНачалаРаботы) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецОбласти