#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ГруппаДанных") Тогда
		Заголовок = ОбменСГИСЭПДКлиентСервер.ОписаниеГруппыДанных(Параметры.ГруппаДанных, Параметры.ИмяОбъекта).Заголовок;
	КонецЕсли;
	
	Параметры.Свойство("ИдентификаторСтрокиРодителя", ИдентификаторСтрокиРодителя);
	Параметры.Свойство("ИмяОбъекта", ИмяОбъекта);
	Параметры.Свойство("Тип", Тип);
	Параметры.Свойство("ГруппаДанных", ГруппаДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)

	Если ЭтоГруппа = Ложь Тогда
		Отказ = Истина;
		ПараметрыОткрытияХД = Новый Структура;
		
		Если Копирование = Истина Тогда
			ПараметрыОткрытияХД.Вставить("ЗначениеКопирования", Элементы.Список.ТекущаяСтрока);
			ПараметрыОткрытияХД.Вставить("ИмяОбъекта", ИмяОбъекта);		
		Иначе
			ПараметрыВыбора = Новый Структура;
			Для Каждого ЭлементОтбор Из Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
				ПараметрыВыбора.Вставить(Строка(ЭлементОтбор.ЛевоеЗначение), ЭлементОтбор.ПравоеЗначение);	
			КонецЦикла;
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("Тип", Тип);
			ЗначенияЗаполнения.Вставить("ИмяОбъекта", ИмяОбъекта);
			ЗначенияЗаполнения.Вставить("ГруппаДанных", ГруппаДанных);
			
			ПараметрыОткрытияХД.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ПараметрыОткрытияХД.Вставить("ПараметрыВыбора", ПараметрыВыбора);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.ХранимыеДанныеЭПД.ФормаОбъекта", 
			ПараметрыОткрытияХД, 
			ЭтотОбъект, 
			УникальныйИдентификатор, 
			, , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



