#Область ПрограммныйИнтерфейс

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя = "БуферОбмена";
	Вид.ИмяПодменю = "ПодменюБуферОбмена";
	Вид.Заголовок = НСтр("ru = 'Скопировать/Вставить'");
	Вид.Отображение = ОтображениеКнопки.Картинка;
	Вид.Картинка = БиблиотекаКартинок.СкопироватьВБуферОбмена;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Для Каждого Строка Из Источники.Строки Цикл
		
		Если СтрНайти(Строка.Метаданные.Имя, "ПрисоединенныеФайлы") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Команда = Команды.Добавить();
		Команда.Вид = "БуферОбмена";
		Команда.Важность = "Важное";
		Команда.Представление = НСтр("ru = 'Скопировать файлы'");
		Команда.МножественныйВыбор = Ложь;
		Команда.РежимЗаписи = "НеЗаписывать";
		Команда.Назначение = "ДляСписка";
		Команда.Обработчик = "РаботаСБуферомОбменаКлиент.СкопироватьФайлы";
		Команда.ТолькоВоВсехДействиях = Ложь;
		Команда.Картинка = БиблиотекаКартинок.СкопироватьВБуферОбмена;
		Команда.Порядок = 70;
		
		Команда = Команды.Добавить();
		Команда.Вид = "БуферОбмена";
		Команда.Важность = "Важное";
		Команда.Представление = НСтр("ru = 'Вставить файлы'");
		Команда.МножественныйВыбор = Ложь;
		Команда.РежимЗаписи = "НеЗаписывать";
		Команда.Назначение = "ДляСписка";
		Команда.Обработчик = "РаботаСБуферомОбменаКлиент.ВставитьФайлы";
		Команда.ТолькоВоВсехДействиях = Ложь;
		Команда.Картинка = БиблиотекаКартинок.ВставитьИзБуфераОбмена;
		Команда.Порядок = 100;
		
	КонецЦикла;
	
КонецПроцедуры

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов
Процедура ПриСозданииФормыСпискаФайлов(Форма) Экспорт
	
	ЗаголовокПрисоединенныеФайлы = НСтр("ru='Присоединенные файлы'");
	Если СтрНайти(Форма.Заголовок, ЗаголовокПрисоединенныеФайлы) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоманднаяПанельПодчиненныеЭлементы = Форма.ПодчиненныеЭлементы.КоманднаяПанель.ПодчиненныеЭлементы;
	ПодменюБуферОбменаПодчиненныеЭлементы = КоманднаяПанельПодчиненныеЭлементы.ПодменюБуферОбмена.ПодчиненныеЭлементы;
	МестонахождениеКоманд = ПодменюБуферОбменаПодчиненныеЭлементы.ПодменюБуферОбменаВажное.ПодчиненныеЭлементы;
	
	Для Каждого КомандаПодменю Из МестонахождениеКоманд Цикл
		Форма.Элементы.Переместить(
		КомандаПодменю,
		Форма.Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюГруппаКомандОсновные);
	КонецЦикла;
	Для Каждого КомандаПодменю Из МестонахождениеКоманд Цикл
		Форма.Элементы.Переместить(
		КомандаПодменю,
		Форма.Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюГруппаКомандОсновные);
	КонецЦикла;
	
	КоманднаяПанельПодчиненныеЭлементы.ПодменюБуферОбмена.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
