
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокументОснование = ПараметрКоманды;
	
	// Для предотвращения повторного открытия форм ввода чека коррекции по одному Документу расчетов
	// назначается ключ уникальности в виде УникальныйИдентификатора документа расчетов
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда
		
		РеквизитыОснования = ДанныеДокументаОснования(ДокументОснование);
		
		Если РеквизитыОснования.НеприменениеККТ Тогда
			ДокументРасчетов = ДокументОснование;
		Иначе
			ДокументРасчетов = РеквизитыОснования.ДокументРасчетов;
		КонецЕсли;
		
	Иначе
		
		ДокументРасчетов = ДокументОснование;
		
	КонецЕсли;
	
	КлючУникальности = ДокументРасчетов.УникальныйИдентификатор();
	
	ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);
	
	ОткрытьФорму("Обработка.СозданиеЧековКоррекции.Форма",
					ПараметрыФормы,
					,
					КлючУникальности,
					ПараметрыВыполненияКоманды.Окно,
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ДанныеДокументаОснования(Основание)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "НеприменениеККТ, ДокументРасчетов");
КонецФункции
