
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Обработка.СервисДоставки.Команда.ОтражениеДоставки.ОбработкаКоманды");
	
	ОчиститьСообщения();
	
	ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
	ПараметрыФормы.ИмяФормы = "ОтражениеДоставки";
	ПараметрыФормы.ТипГрузоперевозки = ПредопределенноеЗначение("Перечисление.ТипыГрузоперевозки.Курьерика");
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
