
#Область ПрограммныйИнтерфейс

Процедура ВключитьВозможностиПриложения() Экспорт
	
	ВозможностиПодключаемогоПриложения = ФункциональныеВозможностиПриложения();
	
	Отбор = Новый Структура("ЗначениеПоУмолчанию", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(Истина);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьРаспознаваниеДокументов") Тогда
		Константы.ИспользоватьРаспознаваниеДокументов.Установить(Истина);
	КонецЕсли;
	
	Константы.ИспользоватьРаботуСПоискомКонтрагентовВСписке.Установить(Ложь);
	РегистрыСведений.СистемыНалогообложенияОрганизаций.ОбновитьИспользованиеОСНО();
	
КонецПроцедуры

Процедура ОтключитьВозможностиПриложения(ИсключаяВозможностиПриложений) Экспорт
	
	ОтключаемыеВозможности = ФункциональныеВозможностиПриложения();
	
	Для Каждого ОтключаемаяВозможность Из ОтключаемыеВозможности Цикл
		
		Если ИсключаяВозможностиПриложений.Найти(ОтключаемаяВозможность.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ИмяКонстанты = ОтключаемаяВозможность.Имя;
			Если ОтключаемаяВозможность.ЗначениеПоУмолчанию = Истина Тогда
				// Отключить служебные константы включенные по умолчанию
				Константы[ИмяКонстанты].Установить(Ложь);
			Иначе
				// Сброс констант из ЕБВ
				Константы[ИмяКонстанты].Установить(ОтключаемаяВозможность.ЗначениеПоУмолчанию);
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФункциональныеВозможностиПриложения() Экспорт
	
	ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоПродажам", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоЗакупкам", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоЗапасам", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоСкладу", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьБанкИКассу", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКСпискуПокупателей", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКСпискуНоменклатурыВГлавном", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВсеСправочникиОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКПанелиОтчетовОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДокументыПоБанку", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПереходКПанелиОтчетовОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьБыстрыеДействия", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЗаданияНаРаботу", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьАктыВыполненныхРабот", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьУправлениеЗапасами", Истина);
	
	// Главное.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьХарактеристики", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПартии", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСегментыНоменклатуры", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСерииНоменклатуры", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтрольОстатковСерийНоменклатуры", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНеуникальныеШтрихКоды", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПрефиксВнутреннегоШтрихкодаШтучногоТовара", 0);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьНаборы", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВестиУчетСредствИндивидуальнойЗащиты", Ложь);
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияКонтрольДоговоров", 
		Перечисления.ВидыКонтроляДоговоровПриПроведении.НеКонтролировать);
		
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеКодовВПечатныхФормах", Перечисления.КодыНоменклатурыВДокументах.Код);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеСкидкиВПечатнойФорме", Перечисления.СпособОтображенияСкидок.Сумма);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВыводитьСуммуБезСкидки", Перечисления.ВариантыВыводаСуммыБезСкидки.Печатать);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтактнаяИнформацияТоварногоЧека", Перечисления.КонтактнаяИнформацияТоварногоЧека.ОрганизацияИСтруктурнаяЕдиница);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПечатьПользовательскихЕдиницИзмерения", Перечисления.ПечатьПользовательскихЕдиницИзмерения.ПересчитыватьВБазовуюЕдиницуИзмеренияНоменклатуры);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВариантПечатиДоставки", Перечисления.ВариантыПечатиДоставки.ПустаяСсылка());
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШтрихкодированиеПечатныхФормОбъектов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаБезПрефиксаОрганизации", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаБезПрефиксаПользователя", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ПредставлениеНомераДокументаСЛидирующимиНулями", Ложь);
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВидНаименованияОрганизацииДляПечатиДокументов", 
		Перечисления.ВидыНаименованийДляПечатиДокументов.Сокращенное);
	
	// Раздел CRM
	// CRM.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДоговорыКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьАссистентаУправления", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШаблоныСообщений", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПрисоединенныеФайлы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНапоминанияПользователя", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЗадачиСотрудников", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКалендариСотрудников", Истина);
		
	// Раздел CRM.ЕБВ
	
	// Раздел Продажи
	// Продажи.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуПродажи", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьТолькоНовуюОбработкуПечатиЦенников", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьВидыЦен", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьАналогиНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСчетаФактуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСчетаНаОплату", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользуетсяОСНО", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"СрокОплатыПокупателя", 0);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьОтчетыВыполненияЗаказов", Истина);

	// Раздел Продажи.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСборкуЗаказов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьВидыЗаказовПокупателей", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ЗапретКомиссионныхПартийБезВладельца", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьАгентскиеУслуги", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьАгентскиеПлатежиИРазделениеВыручки", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКорректировкиРеализаций", Ложь); 
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьРемонты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПланПродаж", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьТолькоНовуюОбработкуПечатиЦенников", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьДисконтныеКарты", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьБонусныеПрограммы", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПромокоды", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПодарочныеСертификаты", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьЧастичноеПогашениеСертификатов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьМинимальныеЦены", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьКорректировкиДолга", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетЦенПродажи", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьРаспознаваниеДокументов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтролироватьОстаткиПриПроведении", Истина);
	
	// Раздел Закупки
	// Раздел Закупки.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуЗакупки", Истина);
	
	// Раздел Закупки
	// Раздел Закупки.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетНоменклатурыПоставщиков", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКорректировкиПоступлений", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДокументРасходыПредпринимателя", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетЦенКонтрагентов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСервисРасчетПотребностей", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"УчетПотребностиПоСкладам", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетГТД", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"КонтролироватьОстаткиПоНомерамГТД", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ТребоватьЗаполнениеГТДИмпортногоТовара", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"АвтоПодборНомеровГТД", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ВестиУчетПрослеживаемыхТоваров", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИмпортПодакцизныхТоваров", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"СрокОплатыПоставщику", 0);
	
	// Раздел Склад
	// Раздел Склад.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуСклад", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСтруктурныеЕдиницы", Истина);
	
	// Раздел Склад
	// Раздел Склад.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетПоНесколькимСкладам", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияРазрешитьСкладыВТабличныхЧастях", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияРезервированиеЗапасов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСборкуЗаказовНаПеремещение", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников", Ложь);
		
	// Раздел Деньги
	// Раздел Деньги.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуДеньги", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьБанкИКассу", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьАвансовыеОтчеты", Истина);
	
	// Раздел Деньги
	// Раздел Деньги.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяУчетВалютныхОпераций", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьОплатуКартамиВОптовойТорговле", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьОписьСдаваемыхДенег", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьОплатуКредитом", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияПлатежныйКалендарь", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьРезервированиеДенежныхСредств", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьРегулярныеПлатежи", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьВыплатыСамозанятым", Ложь);
	
	// Раздел Работы
	// Раздел Работы.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуУслуги", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПодсистемуРаботы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПодсистемуРаботы", Ложь);

	// Раздел Работы.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьВидыЗаказНарядов", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьРемонты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияРаботы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьБиллинг", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"БиллингВестиУчетРасходовПоДоговорамОбслуживания", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"БиллингГоловноеНаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	
	// Раздел Персонал
	// Раздел Персонал.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьПодсистемуЗарплата", Ложь);
	
	// Раздел Персонал.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияВестиШтатноеРасписание", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияИспользоватьСовместительство", Ложь);
	
	// Раздел Компания
	// Раздел Компания.Служебные опции
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуКомпания", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСправочникСотрудники", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПолныеВозможностиБанковскихСчетов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДополнительныеРеквизитыИСведения", Истина);
	
	// Раздел Компания.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНесколькоОрганизаций", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"УчетПоКомпании", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияСебестоимостьБезНДС", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетПоНесколькимПодразделениям", Ложь);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьПульсБизнеса", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"Компания", Справочники.Организации.ПустаяСсылка());
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияУчетПоПроектам", Ложь);
	
	// Раздел Настройки
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСервисыИнтеграций", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ФункциональнаяОпцияСовместноеИспользованиеСВнешнейУчетнойСистемой", Истина);
	
	// Раздел Настройки.ЕБВ
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПодсистемуНастройки", Истина);
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьГоловнуюОрганизацию", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьДоставкуВЗаказеПокупателя", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьИсториюРеквизитов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКассы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКатегорииНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКомплектации", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьКонтактыКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНастройкуФильтровПравойПанели", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьНастройкуФормы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПроизводственныйКалендарь", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСвязанныеДокументы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСегментыКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСопутствующиеТовары", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСправочникПользователи", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСправочникСотрудники", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьСтруктурныеЕдиницы", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьТегиКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьТипыНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьУстановкуЦен", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЧастичныеОтгрузки", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЧастичныеОплаты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьШтрихкоды", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВводНаОсновании", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВзаиморасчеты", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьВсеСправочникиОсновнойРаздел", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьДополнительныеНаименованияВСправочниках", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьКартинкиНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьОтчетыВФормеНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьРеквизитыЗакупкиПроизводстваВНоменклатуре", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьРеквизитыНалогообложения", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ОтображатьСодержаниеДокументаВСписке", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьПроцессыСостояний", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей,"ИспользоватьЗакрытиеМесяца", Истина);

	Возврат ТаблицаВозможностей;
	
КонецФункции

#КонецОбласти
