	
#Область ПрограммныйИнтерфейс

// Процедура устанавливает условное оформление для режима Остатки и Резервы
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяТЧ - Строка - Имя ТЧ
//  ТипДокумента 	- Строка, Неопределено - Тип документа
//					
Процедура УстановитьУсловноеОформлениеЗапасыИРезервы(Форма, ИмяТЧ = "Запасы", ТипДокумента = Неопределено) Экспорт
	
	ТаблицаОбъекта = "Объект." + ИмяТЧ + ".";
	
	Если ТипДокумента = "ЗаказНаряд" Тогда
		ПолеЗарезервировано = ИмяТЧ + "ЗарезервированоРасход";
		ПолеМожноОтгрузить = ИмяТЧ + "МожноОтгрузитьРасход";
		ТаблицаОбъектаРеквизитРезерв = ТаблицаОбъекта + "РезервОтгрузка";
	Иначе
		ПолеЗарезервировано = ИмяТЧ + "Зарезервировано";
		ПолеМожноОтгрузить = ИмяТЧ + "МожноОтгрузить";
		ТаблицаОбъектаРеквизитРезерв = ТаблицаОбъекта + "Резерв";
	КонецЕсли;
	
	УсловноеОформление = Форма.УсловноеОформление;
	
	// Для Отгрузки
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "МожноОтгрузить", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "МожноОтгрузить", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "МожноОтгрузить", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ГоризонтальноеПоложение",
		ГоризонтальноеПоложение.Право);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "МожноОтгрузить", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
		"ЦветТекста", ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ГоризонтальноеПоложение",
		ГоризонтальноеПоложение.Право);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Зеленый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Зеленый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ВРезервеТекСклад", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъектаРеквизитРезерв,  Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "Количество"),
		ВидСравненияКомпоновкиДанных.Меньше);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеХватает", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеЗарезервировано);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "Количество", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ГоризонтальноеПоложение",
		ГоризонтальноеПоложение.Право);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "МожноОтгрузить", Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "ОстатокВЯчейке"),
		ВидСравненияКомпоновкиДанных.Больше);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ЯчейкаДоступна", Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "ОстатокВЯчейке");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ТипНоменклатурыЗапас", Ложь);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеМожноОтгрузить);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеХватает");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "");
	
	Если Не ТипДокумента = "ЗаказНаряд" Тогда
		Возврат 
	КонецЕсли;
	
	// Для Заказа
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "Обеспечено", 0, ВидСравненияКомпоновкиДанных.Больше);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Обеспечено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "Обеспечено", Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "НеОтгруженоВсего")
	, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Обеспечено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Зеленый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		ТаблицаОбъекта + "Обеспечено", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		ТаблицаОбъекта + "НеОтгружено", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Обеспечено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ГоризонтальноеПоложение",
		ГоризонтальноеПоложение.Право);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ОстатокСвободно", 0, ВидСравненияКомпоновкиДанных.Меньше);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "ОстатокСвободно");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ПредставлениеНеОтгружено", "", ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "НеОтгружено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
		Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "ПредставлениеНеОтгружено"));
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "НеОтгруженоВсего", Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "МожноОтгрузить"),
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "МожноОтгрузить");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Зеленый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "Количество", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "МожноОтгрузить");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Обеспечено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ГоризонтальноеПоложение",
		ГоризонтальноеПоложение.Право);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"ЗаказНарядВСостоянииВыполнения", Истина, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ПредставлениеДублей", "", ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		"РежимОстаткиИРезервы", Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	Если ТипДокумента = "ЗаказНаряд" И ИмяТЧ = "Материалы" Тогда
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗНМатериалыКоличество");
	Иначе
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Количество");
	КонецЕсли;
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
		Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "ПредставлениеДублей"));
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "ИндексЦвета", 1, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "МожноОтгрузить");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		ТаблицаОбъекта + "МожноОтгрузить", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		ТаблицаОбъекта + "НеОтгружено", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "МожноОтгрузить");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ГоризонтальноеПоложение",
		ГоризонтальноеПоложение.Право);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
		ТаблицаОбъекта + "Обеспечено", Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "МожноОтгрузить"),
		ВидСравненияКомпоновкиДанных.Больше);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Обеспечено");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "ВРезерве");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Размещено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", 
		ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
		ТаблицаОбъекта + "Обеспечено", Новый ПолеКомпоновкиДанных(ТаблицаОбъекта + "НеОтгружено"),
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяТЧ + "Обеспечено");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Зеленый);
	
	Если ИмяТЧ = "Запасы" Тогда
		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
			ТаблицаОбъекта + "ТипНоменклатурыЗапас", Ложь);
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыМожноОтгрузить");
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыОбеспечено");
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает массив типов документов для проверки ввода дробного количества
//
// Возвращаемое значение:
//  Массив из Тип - массив типов документов для проверки ввода дробного количества
//
Функция МассивТиповДокументовДляПроверкиДробногоКоличества() Экспорт
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктОРасхождениях"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктОРасхожденияхПолученный"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ДополнительныеРасходы"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПроизводство"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ИнвентаризацияЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КомплектацияЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОприходованиеЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СчетНаОплату"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПеремещениеЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетПереработчика"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПеремещениеПоЯчейкам"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПереоценкаВРозницеСуммовойУчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПереоценкаТоваровНаКомиссии"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПересортицаЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходныйОрдер"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РаспределениеЗатрат"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходныйОрдер"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходыПриИмпорте"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РезервированиеЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СборкаЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СписаниеЗапасов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СчетНаОплатуПоставщика"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЧекККМ"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЧекККМВозврат"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВводНачальныхОстатков"));
	
	Возврат МассивТипов;
	
КонецФункции

#Область РаботаСНоменклатуройПоставщика

// Возвращает данные номенклатуры для передачи в заполняемые документы.
//
// Параметры:
//  НоменклатураПоставщика - СправочникСсылка.НоменклатураПоставщиков - элемент справочника Номенклатура поставщиков
// 
// Возвращаемое значение:
//  Число - значение остатка у поставщика
//
Функция ОстатокНоменклатурыПоставщика(НоменклатураПоставщика) Экспорт
	
	Если Не ЗначениеЗаполнено(НоменклатураПоставщика) Тогда
		Возврат 0
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураПоставщика", НоменклатураПоставщика);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваровПоставщиков.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ОстаткиТоваровПоставщиков.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ОстаткиТоваровПоставщиков КАК ОстаткиТоваровПоставщиков
	|ГДЕ
	|	ОстаткиТоваровПоставщиков.НоменклатураПоставщика = &НоменклатураПоставщика";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не Результат.Количество() Тогда
		Возврат 0
	Иначе
		Пока Результат.Следующий() Цикл
			Возврат Результат.Количество
		КонецЦикла
	КонецЕсли;
	
КонецФункции

// Записывает данные остатка в регистр Остатки товаров поставщиков.
//
// Параметры:
//  НоменклатураПоставщика - СправочникСсылка.НоменклатураПоставщиков - элемент справочника Номенклатура поставщиков, для которого сохраняется остаток
//  Количество - Число - значение остатка
// 
Процедура ЗаписатьЗначениеОстаткаНоменклатурыПоставщика(НоменклатураПоставщика, Количество) Экспорт
	
		НаборЗаписей = РегистрыСведений.ОстаткиТоваровПоставщиков.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НоменклатураПоставщика.Установить(НоменклатураПоставщика);
		
		Если Количество > 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.НоменклатураПоставщика = НоменклатураПоставщика;
			НоваяЗапись.Количество = Количество;
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Возвращает данные номенклатуры поставщика по внутренней номенклатуре.
//
// Параметры:
//  Поставщик - СправочникСсылка.Контрагенты - элемент справочника Контрагенты
//  Номенклатура - СправочникСсылка.Номенклатура - элемент справочника Номенклатура
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - элемент справочника Характеристики номенклатуры
// 
// Возвращаемое значение:
//  СправочникСсылка.НоменклатураПоставщиков - СправочникСсылка.НоменклатураПоставщика
//
Функция НоменклатураПоставщикаПоНоменклатуре(Поставщик , Номенклатура, Характеристика) Экспорт
	
	Если Не ЗначениеЗаполнено(Поставщик) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.Номенклатура = &Номенклатура
	|	И НоменклатураПоставщиков.Характеристика = &Характеристика
	|	И НЕ НоменклатураПоставщиков.ПометкаУдаления
	|	И НоменклатураПоставщиков.Владелец = &Поставщик";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() = 1 Тогда
		Пока Результат.Следующий() Цикл
			Возврат Результат.Ссылка
		КонецЦикла
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает номенклатуру и характеристику по номенклатуре поставщика.
//
// Параметры:
//  НоменклатураПоставщика - СправочникСсылка.НоменклатураПоставщиков - элемент справочника Номенклатура поставщиков
// 
// Возвращаемое значение:
//  Структура - Номенклатура и Характеристика номенклатуры:
//  * Номенклатура 	- СправочникСсылка.Номенклатура, Неопределено - Номенклатура
//  * Характеристика 	- СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - Характеристика
//
Функция НоменклатураИХарактеристикаПоНоменклатуреПоставщика(НоменклатураПоставщика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", НоменклатураПоставщика);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура,
	|	НоменклатураПоставщиков.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НЕ НоменклатураПоставщиков.ПометкаУдаления
	|	И НоменклатураПоставщиков.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура("Номенклатура, Характеристика", Неопределено, Неопределено);
	
	Если Результат.Количество() = 1 Тогда
		Пока Результат.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Результат);
			Возврат СтруктураВозврата;
		КонецЦикла
	Иначе
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

// Заполняет строки табличной части документа соответствием номенклатуры поставщиков для номенклатуры.
//
// Параметры:
//  Объект - ДокументОбъект - документ содержащий табличную часть для заполнения
//  ИмяТабличнойЧасти - Строка - имя табличной части документа для заполнения
//  ДополнительныеПараметры - Структура - дополнительные параметры для заполнения
// 
Процедура ЗаполнитьТабличнуюЧастьНоменклатуройПоставщикаПоНоменклатуре(Объект, ИмяТабличнойЧасти = "Запасы", ДополнительныеПараметры = Неопределено) Экспорт
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти]; 
	
	НоменклатураИХарактеристика = ТабличнаяЧасть.Выгрузить(,"Номенклатура, Характеристика");
	НоменклатураИХарактеристика.Свернуть("Номенклатура, Характеристика");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураИХарактеристика", НоменклатураИХарактеристика);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураИХарактеристика.Номенклатура КАК Номенклатура,
	|	НоменклатураИХарактеристика.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТНоменклатураИХарактеристика
	|ИЗ
	|	&НоменклатураИХарактеристика КАК НоменклатураИХарактеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТНоменклатураИХарактеристика.Номенклатура КАК Номенклатура,
	|	ВТНоменклатураИХарактеристика.Характеристика КАК Характеристика,
	|	НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщика
	|ИЗ
	|	ВТНоменклатураИХарактеристика КАК ВТНоменклатураИХарактеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|		ПО ВТНоменклатураИХарактеристика.Номенклатура = НоменклатураПоставщиков.Номенклатура
	|			И ВТНоменклатураИХарактеристика.Характеристика = НоменклатураПоставщиков.Характеристика
	|ГДЕ
	|	НЕ НоменклатураПоставщиков.Ссылка ЕСТЬ NULL";
	
	ТаблицаСоответствия = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПоиска = Новый Структура("Номенклатура, Характеристика");
	
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ВыделенныеСтроки") Тогда
		СтрокиДляОбработки = ДополнительныеПараметры.ВыделенныеСтроки;
	Иначе
		СтрокиДляОбработки = ТабличнаяЧасть;
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиДляОбработки Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТабличнойЧасти);
		
		НайденныеСтроки = ТаблицаСоответствия.НайтиСтроки(ПараметрыПоиска);
		
		Если Не НайденныеСтроки.Количество() = 1 Тогда
			Продолжить
		КонецЕсли;
		
		СтрокаТабличнойЧасти.НоменклатураПоставщика = НайденныеСтроки[0].НоменклатураПоставщика;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТабличнойЧастьюНоменклатуры

// Заполняет строку табличной части документа, выбранной из списка номенклатуры в новый документ
// Параметры:
//  Объект - ДанныеФормыСтруктура - заполняемый документ
//  ИмяТабличнойЧасти - Строка - Имя табличной части документа, куда добавляется строка
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - заполняемая строка
//  СтруктураДопПараметровЗаполнения - Структура - Дополнительные параметры для заполнения строки
//  ИзКорзины - Булево
Процедура ЗаполнитьДанныеВСтрокеТабличнойЧасти(Объект, ИмяТабличнойЧасти, СтрокаТабличнойЧасти, ИзКорзины = Ложь) Экспорт
	
	СтруктураДанные = Новый Структура;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Организация", Объект) Тогда
		СтруктураДанные.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Номенклатура", СтрокаТабличнойЧасти) Тогда
		СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	Иначе
		СтруктураДанные.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;

	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Характеристика", СтрокаТабличнойЧасти) Тогда
		СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	КонецЕсли;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Дата", Объект) Тогда
		СтруктураДанные.Вставить("ДатаОбработки", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата,
			ТекущаяДатаСеанса()));
	Иначе
		СтруктураДанные.Вставить("ДатаОбработки", ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Коэффициент", СтрокаТабличнойЧасти) 
		И НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Кратность", СтрокаТабличнойЧасти) 
		Тогда
		СтруктураДанные.Вставить("НормаВремени", 1);
	КонецЕсли;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("НалогообложениеНДС", Объект) Тогда
		СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	КонецЕсли;
	Если СтруктураДанные.Свойство("Организация")
		И (НалогиУНФ.ОпределятьНалогиПоОрганизации(Объект) ИЛИ НалогиУНФ.ОпределятьНалогиПоОрганизацииСкладу(Объект)) Тогда
		НастройкиНДС = НалогиУНФ.НастройкиНДСОрганизации(СтруктураДанные.Организация, , СтруктураДанные.ДатаОбработки);
		Если ЗначениеЗаполнено(НастройкиНДС.ВидСтавкиНДС) Тогда
			СтруктураДанные.Вставить("ВидСтавкиНДСПоУмолчанию", НастройкиНДС.ВидСтавкиНДС);
		КонецЕсли;
	КонецЕсли;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ВалютаДокумента", Объект) Тогда
		СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	КонецЕсли;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СуммаВключаетНДС", Объект) Тогда
		СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	КонецЕсли;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ВидЦен", Объект) И ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	КонецЕсли; 
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ВидЦенКонтрагента", Объект)
		И ЗначениеЗаполнено(Объект.ВидЦенКонтрагента) Тогда
		СтруктураДанные.Вставить("ВидЦенКонтрагента", Объект.ВидЦенКонтрагента);
	КонецЕсли;

	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ЕдиницаИзмерения", СтрокаТабличнойЧасти)
		И ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		СтруктураДанные.Вставить("Коэффициент", СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", 1);
	КонецЕсли;
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ВидРабот", Объект)
		И ЗначениеЗаполнено(Объект.ВидРабот) Тогда
		СтруктураДанные.Вставить("ВидРабот", Объект.ВидРабот);
	КонецЕсли; 
	
	ИспользоватьСкидки = НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ВидСкидкиНаценки", Объект);
	Если ИспользоватьСкидки И ЗначениеЗаполнено(Объект.ВидСкидкиНаценки) Тогда
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	КонецЕсли; 
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ДисконтнаяКарта", Объект)
		И ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
		СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);		
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("КодТНВЭД", СтрокаТабличнойЧасти) Тогда
		СтруктураДанные.Вставить("КодТНВЭД", СтрокаТабличнойЧасти.КодТНВЭД);
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ХарактеристикиИспользуются", СтрокаТабличнойЧасти) Тогда
		СтруктураДанные.Вставить("ХарактеристикиИспользуются", СтрокаТабличнойЧасти.ХарактеристикиИспользуются);
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СтатусУказанияСерий", СтрокаТабличнойЧасти) Тогда
		СтруктураДанные.Вставить("СтатусУказанияСерий", СтрокаТабличнойЧасти.СтатусУказанияСерий);
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СтруктурнаяЕдиница", СтрокаТабличнойЧасти) Тогда
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтрокаТабличнойЧасти.СтруктурнаяЕдиница);
	Иначе
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", Неопределено);
	КонецЕсли;
	
	ЦенаКорзины = 0;
	Если ИзКорзины Тогда 
		ЦенаКорзины = СтрокаТабличнойЧасти.Цена;
	КонецЕсли;  
	
	ЦенообразованиеКлиентСервер.ДополнитьСтруктуруДанныхНоменклатурыПолямиЦенообразования(Объект,
		СтрокаТабличнойЧасти, СтруктураДанные);	
	
	ДанныеЗаполненияСтроки = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеЗаполненияСтроки);
	
	Если ИзКорзины Тогда
		
		Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СтруктурнаяЕдиница", СтрокаТабличнойЧасти)
			И НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СтруктурнаяЕдиница", Объект)
			И Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) Тогда
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
		ИначеЕсли НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СтруктурнаяЕдиницаРезерв", СтрокаТабличнойЧасти)
			И НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("СтруктурнаяЕдиницаРезерв", Объект)
			И Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв) Тогда
			СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = Объект.СтруктурнаяЕдиницаРезерв;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Цена = ЦенаКорзины;
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("МРЦ", СтрокаТабличнойЧасти)
		И НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Цена", СтрокаТабличнойЧасти)
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.МРЦ) Тогда
		
		Если СтрокаТабличнойЧасти.Цена < СтрокаТабличнойЧасти.МРЦ * 0.75
			Или СтрокаТабличнойЧасти.Цена > СтрокаТабличнойЧасти.МРЦ Тогда
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.МРЦ;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Количество", СтрокаТабличнойЧасти) Тогда
		
		Если ИмяТабличнойЧасти = "Работы" Тогда
			
			СтрокаТабличнойЧасти.Количество = СтруктураДанные.НормаВремени;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Кратность) Тогда
				СтрокаТабличнойЧасти.Кратность = 1;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Коэффициент) Тогда
				СтрокаТабличнойЧасти.Коэффициент = 1;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.ТипНоменклатурыУслуга = СтруктураДанные.ЭтоУслуга;
			
		ИначеЕсли ИмяТабличнойЧасти = "Запасы" Тогда
			
			Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ТипНоменклатурыЗапас", Объект) Тогда
				СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = СтруктураДанные.ЭтоЗапас;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.БазоваяЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ИмяТабличнойЧасти = "МатериалыЗаказчика" Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.БазоваяЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ИмяТабличнойЧасти = "Продукция" Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.БазоваяЕдиницаИзмерения;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("Сумма", СтрокаТабличнойЧасти) Тогда
			НоменклатураВДокументахКлиентСервер.РассчитатьСуммуВСтрокеТабличнойЧасти(Объект, СтрокаТабличнойЧасти,
				ИмяТабличнойЧасти = "Запасы");
		КонецЕсли;
		
	КонецЕсли;
	
	Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта("ТипНоменклатурыЗапас", СтрокаТабличнойЧасти) Тогда
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполненияСтроки.Номенклатура,
			"ТипНоменклатуры");
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Сформировать гарантийные талоны документа.
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - Табличный документ
//  ТекущийДокумент  - ДокументСсылка - Текущий документ
//  Ошибки	- Неопределено, Массив из Структура - Ошибки
// 
// Возвращаемое значение:
//  Неопределено, ТабличныйДокумент - Сформировать гарантийные талоны документа
Функция СформироватьГарантийныеТалоныДокумента(ТабличныйДокумент, ТекущийДокумент, Ошибки) Экспорт
	
	ИмяДокумента = ТекущийДокумент.Метаданные().Имя;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокПечати.Дата КАК ДатаДокумента,
	|	ДокПечати.Номер КАК Номер,
	|	ДокПечати.Организация.Префикс КАК Префикс,
	|	ДокПечати.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	ДокПечати.Ответственный.Физлицо КАК Ответственный,
	|	ДокПечати.УсловияГарантийногоТалона,
	|	ДокПечати.ТекстУсловийГарантийногоТалона,
	|	ДокПечати.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.ГарантийныйСрок КАК ГарантийныйСрок,
	|		Номенклатура.ВыписыватьГарантийныйТалон КАК ВыписыватьГарантийныйТалон,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ДокПечати.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|				ТОГДА ДокПечати.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ ДокПечати.Запасы.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Запас,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.Штрихкод КАК Штрихкод,
	|		Номенклатура.Код КАК Код,
	|		ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Характеристика,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		КлючСвязи
	|	),
	|	ДокПечати.Контрагент,
	|	ДокПечати.Организация,
	|	ДокПечати.СерииНоменклатуры.(
	|		Серия,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК ДокПечати
	|ГДЕ
	|	ДокПечати.Ссылка = &ТекущийДокумент
	|	И ДокПечати.Запасы.Номенклатура.ВыписыватьГарантийныйТалон
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если Шапка.Количество()=0 Тогда
		ТекстСообщения = НСтр("ru = '__________________
		|Документ %1.
		|В документе нет товаров с опцией <Выписывать гарантийный талон>'");
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекущийДокумент);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстСообщения, Неопределено);
		Возврат Неопределено;
	КонецЕсли;
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
	ВыборкаСтрокСерииНоменклатуры = Шапка.СерииНоменклатуры.Выбрать();
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГарантийныйТалон";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ГарантийныйТалон");
	
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина);
	
	Если ЗначениеЗаполнено(Шапка.ФайлЛоготип) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСЛоготипом");
		
		ДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(Шапка.ФайлЛоготип);
		Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
			
			КартинкаЛоготипа = Новый Картинка(ДанныеКартинки);
			ПечатьДокументовУНФ.УстановитьКартинкуБезопасно(ОбластьМакета.Рисунки, "Логотип", КартинкаЛоготипа);
			
		КонецЕсли;
		
	Иначе // Если картинки не выбраны печатаем обычный заголовок
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Гарантийный талон № %1 от %2'"), НомерДокумента,
		Формат(Шапка.ДатаДокумента, "ДЛФ=DD"));
	
	СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ОбластьМакета.Параметры.Организация = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбОрганизации,
		"НаименованиеДляПечати,ФактическийАдрес,Телефоны");
	ОбластьМакета.Параметры.Контрагент = Шапка.Контрагент;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	НомерСтроки = 1;
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		
		Если НЕ ВыборкаСтрокЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		
		СтрокаСерииНоменклатуры = СерииНоменклатурыУНФ.СтрокаСерииНоменклатурыИзВыборки(
			ВыборкаСтрокСерииНоменклатуры, ВыборкаСтрокЗапасы.КлючСвязи);
		ОбластьМакета.Параметры.Запас = ПечатьДокументовУНФ.ПредставлениеНоменклатурыДляПечати(
			ВыборкаСтрокЗапасы.Запас, ВыборкаСтрокЗапасы.Характеристика,
			ВыборкаСтрокЗапасы.Артикул, СтрокаСерииНоменклатуры);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		НомерСтроки = НомерСтроки+1;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ДополнительныеУсловия");
	// Дополнительные условия
	Если ЗначениеЗаполнено(Шапка.УсловияГарантийногоТалона) И
		ЗначениеЗаполнено(Макет.Области.Найти("ДополнительныеУсловия")) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДополнительныеУсловия");
		
		// Добавим отступ перед текстом
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если НЕ ПустаяСтрока(Шапка.ТекстУсловийГарантийногоТалона) Тогда
			ТекстДополнительныхУсловий = Шапка.ТекстУсловийГарантийногоТалона;
		Иначе
			ИмяРеквизита = "ТекстУсловий";
			ТекстДополнительныхУсловий = 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.УсловияГарантийногоТалона, ИмяРеквизита);
		КонецЕсли;
		
		// Выводим построчно многострочный текст
		// для того, чтобы корректно печатались длинные тексты
		ЧислоСтрокТекста = СтрЧислоСтрок(ТекстДополнительныхУсловий);
		Для СчетчикСтрок = 1 По ЧислоСтрокТекста Цикл
			СтруктураПараметров = Новый Структура("ТекстДополнительныхУсловий", 
			СтрПолучитьСтроку(ТекстДополнительныхУсловий, СчетчикСтрок));
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли;			
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

// Сформировать гарантийные талоны производство.
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
//  ТекущийДокумент - ДокументСсылка.СборкаЗапасов - Текущий документ
//  Ошибки	- Неопределено, Массив из Структура - Ошибки
//  ИмяТЧПродукция - Строка - Имя табличной части
// 
// Возвращаемое значение:
//  ТабличныйДокумент, Неопределено - Сформировать гарантийные талоны производство
Функция СформироватьГарантийныеТалоныПроизводство(ТабличныйДокумент, ТекущийДокумент, Ошибки,
	ИмяТЧПродукция = "Продукция") Экспорт
	
	ИмяТЧСерииНоменклатуры = "СерииНоменклатуры"+?(ИмяТЧПродукция="Продукция", "Продукция","");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокПечати.Дата КАК ДатаДокумента,
	|	ДокПечати.Номер КАК Номер,
	|	ДокПечати.Организация.Префикс КАК Префикс,
	|	ДокПечати.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	ДокПечати.Автор.ФизическоеЛицо КАК Ответственный,
	|	ДокПечати.УсловияГарантийногоТалона,
	|	ДокПечати.ТекстУсловийГарантийногоТалона,
	|	ДокПечати." + ИмяТЧПродукция + ".(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.ГарантийныйСрок КАК ГарантийныйСрок,
	|		Номенклатура.ВыписыватьГарантийныйТалон КАК ВыписыватьГарантийныйТалон,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ДокПечати." + ИмяТЧПродукция + ".Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|				ТОГДА ДокПечати." + ИмяТЧПродукция + ".Номенклатура.Наименование
	|			ИНАЧЕ ДокПечати." + ИмяТЧПродукция + ".Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Запас,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.Штрихкод КАК Штрихкод,
	|		Номенклатура.Код КАК Код,
	|		ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Характеристика,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		КлючСвязи
	|	),
	|	ДокПечати.ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ДокПечати.Организация,
	|	ДокПечати." + ИмяТЧСерииНоменклатуры + ".(
	|		Серия,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.СборкаЗапасов КАК ДокПечати
	|ГДЕ
	|	ДокПечати.Ссылка = &ТекущийДокумент
	|	И ДокПечати." + ИмяТЧПродукция + ".Номенклатура.ВыписыватьГарантийныйТалон
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если Шапка.Количество()=0 Тогда
		ТекстСообщения = НСтр("ru = '__________________
		|Документ %1.
		|В документе нет товаров с опцией <Выписывать гарантийный талон>'");
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекущийДокумент);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстСообщения, Неопределено);
		Возврат Неопределено;
	КонецЕсли;
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка[ИмяТЧПродукция].Выбрать();
	ВыборкаСтрокСерииНоменклатуры = Шапка[ИмяТЧСерииНоменклатуры].Выбрать();
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГарантийныйТалон";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ГарантийныйТалон");
	
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина);
	
	Если ЗначениеЗаполнено(Шапка.ФайлЛоготип) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСЛоготипом");
		
		ДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(Шапка.ФайлЛоготип);
		Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
			
			КартинкаЛоготипа = Новый Картинка(ДанныеКартинки);
			ПечатьДокументовУНФ.УстановитьКартинкуБезопасно(ОбластьМакета.Рисунки, "Логотип", КартинкаЛоготипа);
			
		КонецЕсли;
		
	Иначе // Если картинки не выбраны печатаем обычный заголовок
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.ТекстЗаголовка = СтрШаблон(
		НСтр("ru='Гарантийный талон № %1 от ___________________'"), НомерДокумента);
	
	// Дату продажи не указываем
	
	СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ОбластьМакета.Параметры.Организация = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбОрганизации,
		"ПолноеНаименование,ФактическийАдрес,Телефоны");
	ОбластьМакета.Параметры.Контрагент = Шапка.Контрагент;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	НомерСтроки = 1;
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		
		Если НЕ ВыборкаСтрокЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		
		СтрокаСерииНоменклатуры = СерииНоменклатурыУНФ.СтрокаСерииНоменклатурыИзВыборки(
			ВыборкаСтрокСерииНоменклатуры, ВыборкаСтрокЗапасы.КлючСвязи);
		ОбластьМакета.Параметры.Запас = ПечатьДокументовУНФ.ПредставлениеНоменклатурыДляПечати(
			ВыборкаСтрокЗапасы.Запас, ВыборкаСтрокЗапасы.Характеристика,
			ВыборкаСтрокЗапасы.Артикул, СтрокаСерииНоменклатуры);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		НомерСтроки = НомерСтроки+1;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ДополнительныеУсловия");
	// Дополнительные условия
	Если ЗначениеЗаполнено(Шапка.УсловияГарантийногоТалона) И
		ЗначениеЗаполнено(Макет.Области.Найти("ДополнительныеУсловия")) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДополнительныеУсловия");
		
		// Добавим отступ перед текстом
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим построчно многострочный текст
		// для того, чтобы корректно печатались длинные тексты
		
		Если НЕ ПустаяСтрока(Шапка.ТекстУсловийГарантийногоТалона) Тогда
			ТекстДополнительныхУсловий = Шапка.ТекстУсловийГарантийногоТалона;
		Иначе
			ИмяРеквизита = "ТекстУсловий";
			ТекстДополнительныхУсловий = 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.УсловияГарантийногоТалона, ИмяРеквизита);
		КонецЕсли;

		ЧислоСтрокТекста = СтрЧислоСтрок(ТекстДополнительныхУсловий);
		Для СчетчикСтрок = 1 По ЧислоСтрокТекста Цикл
			СтруктураПараметров = Новый Структура("ТекстДополнительныхУсловий", 
			СтрПолучитьСтроку(ТекстДополнительныхУсловий, СчетчикСтрок));
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли;			
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

// Печать гарантийный талон.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка - Массив объектов
//  ОбъектыПечати - СписокЗначений из ЭлементСпискаЗначений
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Печать гарантийный талон
Функция ПечатьГарантийныйТалон(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//@skip-check query-in-loop
		СформироватьГарантийныеТалоныДокумента(ТабличныйДокумент, ТекущийДокумент, Ошибки);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ТекущийДокумент);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет поля табличной части Запасы признаками использования характеристик и партий
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура -Объект
//  ОткрытиеФормы - Булево - Устанавливается в значение "Истина", если заполнение происходит при открытии формы.
//  ИменаТЧДляИсключения 	- Строка, Неопределено - Имя ТЧ
//							
Процедура ЗаполнитьПризнакиИспользованияХарактеристик(Объект, ОткрытиеФормы = Ложь, ИменаТЧДляИсключения = Неопределено) Экспорт
	
	СерииНоменклатурыУНФ.ЗаполнитьПризнакиИспользованияСерий(Объект);
	ЗаполнитьПрочиеДополнительныеРеквизитыТабличныхЧастей(Объект);
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьПартии = ПолучитьФункциональнуюОпцию("ИспользоватьПартии");
	
	Если НЕ ИспользоватьПартии И НЕ ИспользоватьХарактеристики Тогда Возврат КонецЕсли;
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	МассивИменТабличныхЧастей = Новый Массив;
	МассивИменТабличныхЧастейИсключений = Новый Массив;
	Если ТипЗнч(ИменаТЧДляИсключения) = Тип("Строка") Тогда
		ИменаТЧ = СтрРазделить(ИменаТЧДляИсключения,",");
		Для каждого ИмяТЧ Из ИменаТЧ Цикл
			МассивИменТабличныхЧастейИсключений.Добавить(СокрЛП(ИмяТЧ));
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти	Цикл
		
		Если НЕ ТабличнаяЧасть.Реквизиты.Найти("Характеристика") = Неопределено
			И МассивИменТабличныхЧастейИсключений.Найти(ТабличнаяЧасть.Имя) = Неопределено
			Тогда
			
			МассивИменТабличныхЧастей.Добавить(ТабличнаяЧасть.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтоДокументКорректировкаПоступления = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления"),
		Истина, Ложь);
	ЭтоДокументКорректировкаРеализации = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации"),
		Истина, Ложь);
	ЭтоДокументЗаказПоставщику = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику"), Истина, Ложь);
	ЭтоДокументСчетНаОплатуПолученный = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика"),
		Истина, Ложь);
	
	НеПроверятьУслуги = ?(ЭтоДокументЗаказПоставщику Или ЭтоДокументСчетНаОплатуПолученный, Истина, Ложь);
	
	Запрос = Новый Запрос;
	
	Если ЭтоДокументКорректировкаПоступления Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаНоменклатурыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Ссылка,
		|	ТаблицаНоменклатурыДокумента.НомерСтроки КАК НомерСтрокиНоменклатуры,
		|	ТаблицаНоменклатурыДокумента.Характеристика КАК Характеристика,
		|	ТаблицаНоменклатурыДокумента.ЕстьВДокументеПоступления КАК ЕстьВДокументеПоступления
		|ПОМЕСТИТЬ ВыборкаИзТабличнойЧастиЗапасы
		|ИЗ
		|	&ИмяТЧ КАК ТаблицаНоменклатурыДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыборкаИзТабличнойЧастиЗапасы.НомерСтрокиНоменклатуры КАК НомерСтрокиНоменклатуры,
		|	ВЫБОР
		|		КОГДА НЕ ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ИспользоватьХарактеристики
		|				И НЕ ВыборкаИзТабличнойЧастиЗапасы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ИспользоватьХарактеристики
		|	КОНЕЦ КАК ИспользоватьХарактеристики,
		|	ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ПроверятьЗаполнениеХарактеристики КАК ПроверятьЗаполнениеХарактеристики,
		|	ВыборкаИзТабличнойЧастиЗапасы.ЕстьВДокументеПоступления КАК ЕстьВДокументеПоступления,
		|	ИСТИНА КАК ЗаполнениеХарактеристикиПроверено,
		|	ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ИспользоватьПартии КАК ИспользоватьПартии,
		|	ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ПроверятьЗаполнениеПартий КАК ПроверятьЗаполнениеПартий
		|ИЗ
		|	ВыборкаИзТабличнойЧастиЗапасы КАК ВыборкаИзТабличнойЧастиЗапасы
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиНоменклатуры";
		
	ИначеЕсли ЭтоДокументКорректировкаРеализации Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаНоменклатурыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Ссылка,
		|	ТаблицаНоменклатурыДокумента.НомерСтроки КАК НомерСтрокиНоменклатуры,
		|	ТаблицаНоменклатурыДокумента.Характеристика КАК Характеристика,
		|	ТаблицаНоменклатурыДокумента.ЕстьВДокументеРеализации КАК ЕстьВДокументеРеализации
		|ПОМЕСТИТЬ ВыборкаИзТабличнойЧастиЗапасы
		|ИЗ
		|	&ИмяТЧ КАК ТаблицаНоменклатурыДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыборкаИзТабличнойЧастиЗапасы.НомерСтрокиНоменклатуры КАК НомерСтрокиНоменклатуры,
		|	ВЫБОР
		|		КОГДА НЕ ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ИспользоватьХарактеристики
		|				И НЕ ВыборкаИзТабличнойЧастиЗапасы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ИспользоватьХарактеристики
		|	КОНЕЦ КАК ИспользоватьХарактеристики,
		|	ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ПроверятьЗаполнениеХарактеристики КАК ПроверятьЗаполнениеХарактеристики,
		|	ВыборкаИзТабличнойЧастиЗапасы.ЕстьВДокументеРеализации КАК ЕстьВДокументеРеализации,
		|	ИСТИНА КАК ЗаполнениеХарактеристикиПроверено,
		|	ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ИспользоватьПартии КАК ИспользоватьПартии,
		|	ВыборкаИзТабличнойЧастиЗапасы.Ссылка.ПроверятьЗаполнениеПартий КАК ПроверятьЗаполнениеПартий
		|ИЗ
		|	ВыборкаИзТабличнойЧастиЗапасы КАК ВыборкаИзТабличнойЧастиЗапасы
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиНоменклатуры";
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ИспользоватьПартии КАК ИспользоватьПартии,
		|	Номенклатура.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
		|	Номенклатура.ПроверятьЗаполнениеХарактеристики КАК ПроверятьЗаполнениеХарактеристики,
		|	Номенклатура.ПроверятьЗаполнениеПартий КАК ПроверятьЗаполнениеПартий,
		|	ВЫБОР
		|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ИСТИНА КАК ЗаполнениеХарактеристикиПроверено
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивПроверяемойНоменклатуры)
		|	И НЕ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)";
		
	КонецЕсли;
	
	МассивПроверяемойНоменклатуры = Новый Массив;
	
	КоличествоПакетовЗапроса = 1;
	ИменаКолонкиНоменклатура = Новый Структура();
	
	СоответствиеТабличныхЧастейИндексамПакета = Новый Соответствие();
	
	Для Каждого ИмяТабличнойЧасти Из МассивИменТабличныхЧастей Цикл
		
		ОтборНеПроверенныхСтрок = Новый Структура("ЗаполнениеХарактеристикиПроверено", Ложь);
		МассивНеПроверенныхСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(ОтборНеПроверенныхСтрок);
		
		Если Не Объект[ИмяТабличнойЧасти].Количество() Тогда Продолжить КонецЕсли;
		
		ИмяКолонкиНоменклатура = "Номенклатура";
		Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект[ИмяТабличнойЧасти][0],"Номенклатура") 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект[ИмяТабличнойЧасти][0], "ЗначениеУточнения") Тогда
			ИмяКолонкиНоменклатура = "ЗначениеУточнения";
		КонецЕсли;
		ИменаКолонкиНоменклатура.Вставить(ИмяТабличнойЧасти, ИмяКолонкиНоменклатура);
		
		Если ЭтоДокументКорректировкаПоступления Тогда
			ТаблицаНоменклатурыДокумента = Объект[ИмяТабличнойЧасти].Выгрузить(МассивНеПроверенныхСтрок,
				"Номенклатура, НомерСтроки, Характеристика, ЕстьВДокументеПоступления");
		ИначеЕсли ЭтоДокументКорректировкаРеализации Тогда
			ТаблицаНоменклатурыДокумента = Объект[ИмяТабличнойЧасти].Выгрузить(МассивНеПроверенныхСтрок,
				"Номенклатура, НомерСтроки, Характеристика, ЕстьВДокументеРеализации");
		Иначе
			Для Каждого СтрокаТаблицы Из Объект[ИмяТабличнойЧасти] Цикл
				
				Если СтрокаТаблицы.ЗаполнениеХарактеристикиПроверено Тогда Продолжить КонецЕсли;
				
				МассивПроверяемойНоменклатуры.Добавить(СтрокаТаблицы[ИмяКолонкиНоменклатура]);
				
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		ТекстПакета = ТекстЗапроса;
		
		ТекстПакета = СтрЗаменить(ТекстПакета, "&ИмяТЧ", "&" + ИмяТабличнойЧасти);
		ТекстПакета = СтрЗаменить(ТекстПакета, "ВыборкаИзТабличнойЧастиЗапасы", "ВыборкаИзТабличнойЧастиЗапасы"
			+ ИмяТабличнойЧасти);
		
		Запрос.Текст = Запрос.Текст + ТекстПакета + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Запрос.УстановитьПараметр(ИмяТабличнойЧасти, ТаблицаНоменклатурыДокумента);
		
		СоответствиеТабличныхЧастейИндексамПакета.Вставить(КоличествоПакетовЗапроса, ИмяТабличнойЧасти);
		КоличествоПакетовЗапроса = КоличествоПакетовЗапроса + 2;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Запрос.Текст) И Не МассивПроверяемойНоменклатуры.Количество() Тогда
		Возврат
	КонецЕсли;
	
	ИндексПакета = 1;
	
	Если ЭтоДокументКорректировкаПоступления Тогда
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		Пока ИндексПакета <= ПакетЗапросов.Количество() - 1 Цикл
			
			ВыборкаПоХарактеристикам = ПакетЗапросов[ИндексПакета].Выбрать();
			
			ИмяТабличнойЧасти = СоответствиеТабличныхЧастейИндексамПакета.Получить(ИндексПакета);
			
			Пока ВыборкаПоХарактеристикам.Следующий() Цикл
				
				Если ВыборкаПоХарактеристикам.ЕстьВДокументеПоступления Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТабЧасти = Объект[ИмяТабличнойЧасти][ВыборкаПоХарактеристикам.НомерСтрокиНоменклатуры - 1];
				ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, ВыборкаПоХарактеристикам);
				
				Если СтрокаТабЧасти.Свойство("Партия") И ЗначениеЗаполнено(СтрокаТабЧасти.Партия) Тогда
					СтрокаТабЧасти.ИспользоватьПартии = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			ИндексПакета = ИндексПакета + 2;
			
		КонецЦикла;
		
	ИначеЕсли ЭтоДокументКорректировкаРеализации Тогда
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		Пока ИндексПакета <= ПакетЗапросов.Количество() - 1 Цикл
			
			ВыборкаПоХарактеристикам = ПакетЗапросов[ИндексПакета].Выбрать();
			
			ИмяТабличнойЧасти = СоответствиеТабличныхЧастейИндексамПакета.Получить(ИндексПакета);
			
			Пока ВыборкаПоХарактеристикам.Следующий() Цикл
				
				Если ВыборкаПоХарактеристикам.ЕстьВДокументеРеализации Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТабЧасти = Объект[ИмяТабличнойЧасти][ВыборкаПоХарактеристикам.НомерСтрокиНоменклатуры - 1];
				ЗаполнитьЗначенияСвойств(СтрокаТабЧасти,ВыборкаПоХарактеристикам);
				
				Если СтрокаТабЧасти.Свойство("Партия") И ЗначениеЗаполнено(СтрокаТабЧасти.Партия) Тогда
					СтрокаТабЧасти.ИспользоватьПартии = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			ИндексПакета = ИндексПакета + 2;
			
		КонецЦикла;
		
	Иначе
		
		Если НеПроверятьУслуги = Ложь Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
				"И НЕ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)", "");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("МассивПроверяемойНоменклатуры", МассивПроверяемойНоменклатуры);
		ВыборкаПоХарактеристикам = Запрос.Выполнить().Выбрать();
		
		Для Каждого ИмяТабличнойЧасти Из МассивИменТабличныхЧастей Цикл
			ИмяКолонкиНоменклатура = Неопределено;
			Если НЕ ИменаКолонкиНоменклатура.Свойство(ИмяТабличнойЧасти, ИмяКолонкиНоменклатура) Тогда
				ИмяКолонкиНоменклатура = "Номенклатура";
			КонецЕсли;
			Для Каждого СтрокаТабЧасти Из Объект[ИмяТабличнойЧасти] Цикл
				
				ПараметрыОтбора = Новый Структура("Номенклатура", СтрокаТабЧасти[ИмяКолонкиНоменклатура]);
				
				НайденаСтрока = ВыборкаПоХарактеристикам.НайтиСледующий(ПараметрыОтбора);
				
				Если НайденаСтрока Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, ВыборкаПоХарактеристикам);
					
					Если СтрокаТабЧасти.Свойство("Партия") И ЗначениеЗаполнено(СтрокаТабЧасти.Партия) Тогда
						СтрокаТабЧасти.ИспользоватьПартии = Истина
					КонецЕсли;
					
					Если СтрокаТабЧасти.Свойство("Характеристика") И ЗначениеЗаполнено(СтрокаТабЧасти.Характеристика) Тогда
						СтрокаТабЧасти.ИспользоватьХарактеристики = Истина
					КонецЕсли;
				КонецЕсли;
				
				ВыборкаПоХарактеристикам.Сбросить();
				
			КонецЦикла;
		КонецЦикла
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет поля табличных частей необходимыми признаками для доп. обработки данных в табличной части. 
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
Процедура ЗаполнитьПрочиеДополнительныеРеквизитыТабличныхЧастей(Объект) Экспорт
	
	ИмяОсновнойТабличнойЧасти = "Запасы";
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		ИмяОсновнойТабличнойЧасти = "РаботыИУслуги";
	КонецЕсли;
	
	ИмяТаблицыВозвраты = "Возвраты";
	
	ЭтоЧекККМ = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ");
	ЭтоВводНачальныхОстатков = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВводНачальныхОстатков");
	ЭтоЗаказНаряд = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
								И РаботаСЗаявкамиКлиентСервер.ЭтоТипЗаказНаряда(Объект.ВидОперации);
	ЭтоЗаказПокупателя = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
								И РаботаСЗаявкамиКлиентСервер.ЭтоТипЗаказаНаПродажуИлиПереработку(Объект.ВидОперации);
	
	ПриемТоваровНаКомиссию = ПолучитьФункциональнуюОпцию("ПриемТоваровНаКомиссию");
	ИспользоватьОрдерныйСклад = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад");
	
	ПоддерживаемыеТипыДокументовКомиссия = МассивТиповДокументовДляПроверкиКомиссииСНДС();
	ПоддерживаемыеТипыДокументовСкладскойУчет = МассивТиповОбрабатываемыхДокументовСкладскойУчет();
	ПоддерживаемыеТипыДокументовДляПроверкиДробногоКоличества = МассивТиповДокументовДляПроверкиДробногоКоличества();
	
	ОбработкаТабличныхЧастейПоКомиссии = ПриемТоваровНаКомиссию
		И Не ПоддерживаемыеТипыДокументовКомиссия.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено;
	ОбработкаТабличныхЧастейСкладскойУчет = ИспользоватьОрдерныйСклад
		И Не ПоддерживаемыеТипыДокументовСкладскойУчет.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено;
	ОбработкаТабличныхЧастейДробноеКоличество =
		Не ПоддерживаемыеТипыДокументовДляПроверкиДробногоКоличества.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено;
	
	ОбрабатыватьТабличнуюЧастьРасходы = Ложь;
	ОбрабатыватьТабличнуюЧастьВозвраты = Ложь;
	ОбрабатыватьТабличнуюЧастьПродукция = Ложь;
	ОбрабатыватьТабличнуюЧастьМатериалы = Ложь;
	ОбрабатыватьТабличнуюЧастьОтходы = Ложь;
	ОбрабатыватьТабличнуюЧастьСпецоснастка = Ложь;
	ОбрабатыватьТабличнуюЧастьИнвентарьИХозяйственныеПринадлежности = Ложь;
	ОбрабатыватьТабличнуюЧастьРаспределениеЗапасов = Ложь;
	
	//Признак запрета ввода дробного количества
	МассивНоменклатурыДляПроверкиДробногоКоличества = Новый Массив;
	Если ОбработкаТабличныхЧастейДробноеКоличество Тогда
		
			ТаблицаНоменклатуры = Объект[ИмяОсновнойТабличнойЧасти].Выгрузить(, "Номенклатура");
			
			Если Не МассивТиповДокументовПоИмениТабличнойЧасти("Расходы").Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
				ОбрабатыватьТабличнуюЧастьРасходы = Истина;
				ИмяТабличнойЧастиОбъекта = "Расходы";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
			КонецЕсли;
			
			Если Не МассивТиповДокументовПоИмениТабличнойЧасти("Продукция").Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
				ОбрабатыватьТабличнуюЧастьПродукция = Истина;
				ИмяТабличнойЧастиОбъекта = "Продукция";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
			КонецЕсли;
			
			Если Не МассивТиповДокументовПоИмениТабличнойЧасти("Отходы").Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
				ОбрабатыватьТабличнуюЧастьОтходы = Истина;
				ИмяТабличнойЧастиОбъекта = "Отходы";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
			КонецЕсли;
			
			Если Не МассивТиповДокументовПоИмениТабличнойЧасти("РаспределениеЗапасов").Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
				ОбрабатыватьТабличнуюЧастьРаспределениеЗапасов = Истина;
				ИмяТабличнойЧастиОбъекта = "РаспределениеЗапасов";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
			КонецЕсли;
			
			Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
				ОбрабатыватьТабличнуюЧастьВозвраты = Истина;
				ИмяТаблицыВозвраты = "ЗапасыВозвраты";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Объект[ИмяТаблицыВозвраты].Выгрузить(,
					"Номенклатура"), ТаблицаНоменклатуры);
			КонецЕсли;
			
			Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
				
				ОбрабатыватьТабличнуюЧастьСпецоснастка = Истина;
				ОбрабатыватьТабличнуюЧастьИнвентарьИХозяйственныеПринадлежности = Истина;
				
				ИмяТабличнойЧастиОбъекта = "Спецоснастка";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
					
				ИмяТабличнойЧастиОбъекта = "ИнвентарьИХозяйственныеПринадлежности";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
					
			КонецЕсли;
			
			Если ЭтоЗаказНаряд 
				Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				ОбрабатыватьТабличнуюЧастьМатериалы = Истина;
				ИмяТабличнойЧастиОбъекта = "Материалы";
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
					Объект[ИмяТабличнойЧастиОбъекта].Выгрузить(, "Номенклатура"), ТаблицаНоменклатуры);
			КонецЕсли;
			
			Если ЭтоВводНачальныхОстатков Тогда
				
				МассивИменТаблицВводаНачальныхОстатков = Новый Массив;
				
				МассивИменТаблицВводаНачальныхОстатков.Добавить("ЗапасыПереданные");
				МассивИменТаблицВводаНачальныхОстатков.Добавить("ЗапасыПринятые");
				МассивИменТаблицВводаНачальныхОстатков.Добавить("ЗапасыВРазрезеГТД");
				МассивИменТаблицВводаНачальныхОстатков.Добавить("ЗапасыПереданныеВРазрезеГТД");
				МассивИменТаблицВводаНачальныхОстатков.Добавить("ЗапасыПринятыеВРазрезеГТД");
				
				Для Каждого ИмяТаблицыДокумента Из МассивИменТаблицВводаНачальныхОстатков Цикл
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Объект[ИмяТаблицыДокумента].Выгрузить(,"Номенклатура"), ТаблицаНоменклатуры);
				КонецЦикла;
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В(&ТаблицаНоменклатуры)
			|	И Номенклатура.ЗапретитьВводДробногоКоличества";
			
			МассивНоменклатурыДляПроверкиДробногоКоличества = Запрос.Выполнить().Выгрузить();
			
	КонецЕсли;
	
	ОбработкаТабличныхЧастейДробноеКоличество = ОбработкаТабличныхЧастейДробноеКоличество
		И МассивНоменклатурыДляПроверкиДробногоКоличества.Количество();
	
	//Признак НДС в комиссионных партиях
	МассивКомиссионныхПартийСНДС = Новый Массив;
	Если ОбработкаТабличныхЧастейПоКомиссии Тогда
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			КопияТабличнойЧастиДляПроверки = Объект[ИмяОсновнойТабличнойЧасти].Выгрузить(Новый Структура());
			КолонкаКомиссияСНДС = КопияТабличнойЧастиДляПроверки.Колонки.Найти("КомиссияСНДС");
			
			Если КолонкаКомиссияСНДС = Неопределено Тогда
				ОбработкаТабличныхЧастейПоКомиссии = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОбработкаТабличныхЧастейПоКомиссии Тогда
			
			МассивПартий = Объект[ИмяОсновнойТабличнойЧасти].Выгрузить(, "Партия");
			МассивПартий.Свернуть("Партия");
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("МассивПартий", МассивПартий);
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ПартииНоменклатуры.Ссылка КАК Партия
			|ИЗ
			|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
			|ГДЕ
			|	ПартииНоменклатуры.Ссылка В(&МассивПартий)
			|	И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
			|			И ПартииНоменклатуры.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС)";
			
			МассивКомиссионныхПартийСНДС = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбработкаТабличныхЧастейПоКомиссии = ОбработкаТабличныхЧастейПоКомиссии
		И МассивКомиссионныхПартийСНДС.Количество();
	
	//Признак указания складского ордера в табличной части документа
	ИмяРеквизитаСтруктурнаяЕдиница = "СтруктурнаяЕдиница";
	МассивСтруктурныхЕдиницСОстаткамиПоОрдерам = Новый Массив;
	Если ОбработкаТабличныхЧастейСкладскойУчет Тогда
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") 
			Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			Если Объект.ПоложениеДокументаПоступления = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
				ОбработкаТабличныхЧастейСкладскойУчет = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбработкаТабличныхЧастейСкладскойУчет Тогда
			
			Если ЭтоЗаказНаряд Тогда
				ОбрабатыватьТабличнуюЧастьМатериалы = Истина;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	СтруктурныеЕдиницы.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)";
			
			МассивСтруктурныхЕдиницСОстаткамиПоОрдерам = Запрос.Выполнить().Выгрузить();
			
			ИмяРеквизитаСтруктурнаяЕдиница = ?(ЭтоЗаказНаряд,"СтруктурнаяЕдиницаРезерв", "СтруктурнаяЕдиница");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбработкаТабличныхЧастейСкладскойУчет = ОбработкаТабличныхЧастейСкладскойУчет
		И МассивСтруктурныхЕдиницСОстаткамиПоОрдерам.Количество() И Не ЭтоЗаказПокупателя;
	
	Если Не ОбработкаТабличныхЧастейПоКомиссии И Не ОбработкаТабличныхЧастейСкладскойУчет
		И Не ОбработкаТабличныхЧастейДробноеКоличество Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаЗапасы Из Объект[ИмяОсновнойТабличнойЧасти] Цикл

		Если ОбработкаТабличныхЧастейСкладскойУчет Тогда
			Если Не ЗначениеЗаполнено(СтрокаЗапасы[ИмяРеквизитаСтруктурнаяЕдиница]) Тогда
				СтрокаЗапасы.УказыватьДокументПоступления = Ложь;
			КонецЕсли;
			СтрокаЗапасы.УказыватьДокументПоступления =
				Не МассивСтруктурныхЕдиницСОстаткамиПоОрдерам.Найти(СтрокаЗапасы[ИмяРеквизитаСтруктурнаяЕдиница]) = Неопределено;
		КонецЕсли;
		
		Если ОбработкаТабличныхЧастейПоКомиссии Тогда
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.Партия) Тогда
				СтрокаЗапасы.КомиссияСНДС = Ложь;
			КонецЕсли;
			СтрокаЗапасы.КомиссияСНДС = Не МассивКомиссионныхПартийСНДС.Найти(СтрокаЗапасы.Партия) = Неопределено;
		КонецЕсли;
		
		Если ОбработкаТабличныхЧастейДробноеКоличество Тогда
			
			Если ЭтоЧекККМ И Не СтрокаЗапасы.Свойство("ЗапретитьВводДробногоКоличества") Тогда
				Продолжить
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.Номенклатура) Тогда
				СтрокаЗапасы.ЗапретитьВводДробногоКоличества = Ложь;
			КонецЕсли;
			СтрокаЗапасы.ЗапретитьВводДробногоКоличества =
				Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаЗапасы.Номенклатура) = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбрабатыватьТабличнуюЧастьМатериалы Тогда
		
		Для Каждого СтрокаМатериалы Из Объект.Материалы Цикл
			
			Если ОбработкаТабличныхЧастейСкладскойУчет Тогда
				
				Если Не ЗначениеЗаполнено(СтрокаМатериалы[ИмяРеквизитаСтруктурнаяЕдиница]) Тогда
					СтрокаМатериалы.УказыватьДокументПоступления = Ложь;
				КонецЕсли;
				СтрокаМатериалы.УказыватьДокументПоступления =
					Не МассивСтруктурныхЕдиницСОстаткамиПоОрдерам.Найти(СтрокаМатериалы[ИмяРеквизитаСтруктурнаяЕдиница]) = Неопределено;
				
			КонецЕсли;
			
			Если ОбработкаТабличныхЧастейДробноеКоличество Тогда
				Если Не ЗначениеЗаполнено(СтрокаМатериалы.Номенклатура) Тогда
					СтрокаМатериалы.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаМатериалы.ЗапретитьВводДробногоКоличества =
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаМатериалы.Номенклатура) = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если ОбработкаТабличныхЧастейДробноеКоличество Тогда
		
		Если ОбрабатыватьТабличнуюЧастьРасходы Тогда 
			
			Для Каждого СтрокаРасходы Из Объект.Расходы Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаРасходы.Номенклатура) Тогда
					СтрокаРасходы.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаРасходы.ЗапретитьВводДробногоКоличества =
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаРасходы.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбрабатыватьТабличнуюЧастьВозвраты Тогда 
			
			Для Каждого СтрокаВозвраты Из Объект[ИмяТаблицыВозвраты] Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаВозвраты.Номенклатура) Тогда
					СтрокаВозвраты.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаВозвраты.ЗапретитьВводДробногоКоличества =
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаВозвраты.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбрабатыватьТабличнуюЧастьПродукция Тогда 
			
			Для Каждого СтрокаПродукция Из Объект.Продукция Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаПродукция.Номенклатура) Тогда
					СтрокаПродукция.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаПродукция.ЗапретитьВводДробногоКоличества =
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаПродукция.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбрабатыватьТабличнуюЧастьОтходы Тогда 
			
			Для Каждого СтрокаОтходы Из Объект.Отходы Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаОтходы.Номенклатура) Тогда
					СтрокаОтходы.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаОтходы.ЗапретитьВводДробногоКоличества = 
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаОтходы.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбрабатыватьТабличнуюЧастьСпецоснастка Тогда 
			
			Для Каждого СтрокаСпецоснастка Из Объект.Спецоснастка Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаСпецоснастка.Номенклатура) Тогда
					СтрокаСпецоснастка.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаСпецоснастка.ЗапретитьВводДробногоКоличества = 
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаСпецоснастка.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбрабатыватьТабличнуюЧастьИнвентарьИХозяйственныеПринадлежности Тогда 
			
			Для Каждого СтрокаИнвентарьИХозяйственныеПринадлежности Из Объект.ИнвентарьИХозяйственныеПринадлежности Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаИнвентарьИХозяйственныеПринадлежности.Номенклатура) Тогда
					СтрокаИнвентарьИХозяйственныеПринадлежности.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаИнвентарьИХозяйственныеПринадлежности.ЗапретитьВводДробногоКоличества =
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаИнвентарьИХозяйственныеПринадлежности.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбрабатыватьТабличнуюЧастьРаспределениеЗапасов Тогда 
			
			Для Каждого СтрокаРаспределениеЗапасов Из Объект.РаспределениеЗапасов Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаРаспределениеЗапасов.Номенклатура) Тогда
					СтрокаРаспределениеЗапасов.ЗапретитьВводДробногоКоличества = Ложь;
				КонецЕсли;
				СтрокаРаспределениеЗапасов.ЗапретитьВводДробногоКоличества =
					Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаРаспределениеЗапасов.Номенклатура) = Неопределено;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЭтоВводНачальныхОстатков Тогда
			
			Для Каждого ИмяТаблицыДокумента Из МассивИменТаблицВводаНачальныхОстатков Цикл
				
				Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицыДокумента] Цикл
					
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						СтрокаТаблицы.ЗапретитьВводДробногоКоличества = Ложь;
					КонецЕсли;
					
					СтрокаТаблицы.ЗапретитьВводДробногоКоличества =
						Не МассивНоменклатурыДляПроверкиДробногоКоличества.Найти(СтрокаТаблицы.Номенклатура) = Неопределено;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Получает значение характеристики номенклатуры по умолчанию.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - элемент, для которого получить характеристику по умолчанию.
//
// Возвращаемое значение:
//  СправочникСсылка.ХарактеристикиНоменклатуры - характеристика номенклатуры по умолчанию.
//  Неопределено - если не удалось определить характеристику по умолчанию.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - Значения номенклатуры по умолчанию
Функция ЗначенияНоменклатурыПоУмолчанию(Номенклатура) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ЭтоНабор, КатегорияНоменклатуры");
	
	Если РеквизитыНоменклатуры.ЭтоНабор Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Категория", РеквизитыНоменклатуры.КатегорияНоменклатуры);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Характеристика
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Характеристика.Владелец = ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Номенклатура
	|					ТОГДА ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Характеристика
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Номенклатура.КатегорияНоменклатуры = ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Характеристика.Владелец
	|							ТОГДА ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Характеристика
	|						ИНАЧЕ НЕОПРЕДЕЛЕНО
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Характеристика
	|ИЗ
	|	РегистрСведений.ЗначенияНоменклатурыПоУмолчанию КАК ЗначенияНоменклатурыПоУмолчаниюНоменклатура
	|ГДЕ
	|	(ВЫРАЗИТЬ(ЗначенияНоменклатурыПоУмолчаниюНоменклатура.Номенклатура КАК Справочник.Номенклатура)) = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияНоменклатурыПоУмолчаниюКатегории.Характеристика КАК ХарактеристикаКатегории
	|ИЗ
	|	РегистрСведений.ЗначенияНоменклатурыПоУмолчанию КАК ЗначенияНоменклатурыПоУмолчаниюКатегории
	|ГДЕ
	|	(ВЫРАЗИТЬ(ЗначенияНоменклатурыПоУмолчаниюКатегории.Номенклатура КАК Справочник.КатегорииНоменклатуры)) = &Категория";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	РезультатПоНоменклатуре = РезультатыЗапроса[0].Выбрать();
	
	Если РезультатПоНоменклатуре.Следующий() Тогда
		Возврат РезультатПоНоменклатуре.Характеристика
	КонецЕсли;
	
	РезультатПоКатегории = РезультатыЗапроса[1].Выбрать();
	
	Если РезультатПоКатегории.Следующий() И ЗначениеЗаполнено(РезультатПоКатегории.ХарактеристикаКатегории) Тогда
		Возврат РезультатПоКатегории.ХарактеристикаКатегории
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Ставка номенклатуры.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.СтавкиНДС - Ставка НДС номенклатуры
// Возвращает ставку НДС для указанной номенклатуры.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура, для которой необходимо получить ставку НДС.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС - Ставка НДС для указанной номенклатуры.
//
Функция СтавкаНоменклатуры(Знач Номенклатура) Экспорт
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
	КонецЕсли;
	НоменклатураВидСтавкиНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидСтавкиНДС");
	Возврат Справочники.СтавкиНДС.СтавкаНДС(НоменклатураВидСтавкиНДС);
КонецФункции

// Функция - Параметры определения ставки НДС
//
// Параметры:
//  СтруктураДанные	 - Структура - структура с данными документа, используется для заполнения значений
// 
// Возвращаемое значение:
//   - Структура:
//		* Организация 	- СправочникСсылка.Организации, Неопределено - Организация
//		* ДатаОбработки - Дата, Неопределено - дата документа, текущая дата если не заполнено
//		* НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС, Неопределено - тип налогообложения НДС объекта
//		* ЕстьПартииСНДС - Булево - наличие в объекте партий номенклатуры с НДС. Если отсутствует - Ложь
//		* Номенклатура 	- СправочникСсылка.Номенклатура, Неопределено - Номенклатура
//		* НоменклатураВидСтавкиНДС - ПеречислениеСсылка.ВидыСтавокНДС, Неопределено - вид ставки НДС номенклатуры
//		* Партия - СправочникСсылка.ПартииНоменклатуры, Неопределено - Партия
//		* ВидСтавкиНДСПоУмолчанию - ПеречислениеСсылка.ВидыСтавокНДС, Неопределено - Вид Ставки НДС
//
Функция ПараметрыОпределенияСтавкиНДС(СтруктураДанные = Неопределено) Экспорт
	
	ПараметрыНДС = Новый Структура;
	ПараметрыНДС.Вставить("Организация",              Неопределено);
	ПараметрыНДС.Вставить("ДатаОбработки",            Неопределено);
	ПараметрыНДС.Вставить("НалогообложениеНДС",       Неопределено);
	ПараметрыНДС.Вставить("ЕстьПартииСНДС",           Ложь);
	ПараметрыНДС.Вставить("Номенклатура",             Неопределено);
	ПараметрыНДС.Вставить("НоменклатураВидСтавкиНДС", Неопределено);
	ПараметрыНДС.Вставить("Партия",                   Неопределено);
	ПараметрыНДС.Вставить("ВидСтавкиНДСПоУмолчанию",  Неопределено);
	
	Если СтруктураДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыНДС, СтруктураДанные);
	КонецЕсли;
	
	Возврат ПараметрыНДС;
	
КонецФункции

// Определяет ставку НДС номенклатуры и другие связанные с ней параметры.
// Ставка НДС определяется по следующим правилам по убыванию приоритета:
//	- выбрано налогообложение "Экспорт" 					0%
//  - указана Партия и это товар на комиссии				ставка из партии.
//		Если ставка партии не заполнена, то используется налогообложение партии и ставка номенклатуры
//	- налогообложение = Не облагается 						Без НДС
//	- ставка НДС по умолчанию = Без НДС, есть партии с НДС	Без НДС
//	- ставка НДС по умолчанию = ставка УСН (5 или 7%) 		5 или 7%
//	- заполнена ставка номенклатуры							ставка номенклатуры
//	- заполнена ставка по умолчанию							ставка по умолчанию
//  - не выполнено ни одно из вышеперечисленных условий		Общая ставка (20%)
//
// Параметры:
//  СтруктураДанныеСтроки	 - см. ПараметрыОпределенияСтавкиНДС
// 
// Возвращаемое значение:
//   - Структура:
//		* СтавкаНДС - СправочникСсылка.СтавкиНДС
//		* ЗначениеСтавкиНДС - Число
//		* КомиссияСНДС - Булево
//		* ТребуетсяИзменениеНалогообложениеНаСНДС - Булево
//
Функция ДанныеНДССтрокиНоменклатуры(СтруктураДанныеСтроки) Экспорт
	
	ДанныеНДС = Новый Структура;
	ДанныеНДС.Вставить("СтавкаНДС", Справочники.СтавкиНДС.ПустаяСсылка());
	ДанныеНДС.Вставить("ЗначениеСтавкиНДС", 0);
	ДанныеНДС.Вставить("КомиссияСНДС", Ложь);
	ДанныеНДС.Вставить("ТребуетсяИзменениеНалогообложениеНаСНДС", Ложь);

	СтруктураДанные = ПараметрыОпределенияСтавкиНДС(СтруктураДанныеСтроки);
	
	Если СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НаЭкспорт") Тогда
		ДанныеНДС.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		Возврат ДанныеНДС;
	КонецЕсли;
	
	НоменклатураВидСтавки = СтруктураДанные.НоменклатураВидСтавкиНДС;
	Если НЕ ЗначениеЗаполнено(НоменклатураВидСтавки) И ЗначениеЗаполнено(СтруктураДанные.Номенклатура) Тогда
		ИмяРеквизитаВидСтавки = "ВидСтавкиНДС";
		НоменклатураВидСтавки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура,
			ИмяРеквизитаВидСтавки);
	КонецЕсли;
	
	ВидСтавкиПоУмолчанию = СтруктураДанные.ВидСтавкиНДСПоУмолчанию;
	Если НЕ ЗначениеЗаполнено(ВидСтавкиПоУмолчанию) Тогда
		ИмяРеквизитаВидСтавки = "ВидСтавкиНДСПоУмолчанию";
		ВидСтавкиПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Организация,
			ИмяРеквизитаВидСтавки);
	КонецЕсли;
	
	ТипНеОблагаетсяНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС");
	ВидСтавкиБезНДС = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.БезНДС");
	ВидСтавкиНулевая = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Нулевая");
	СтавкаБезНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();

	Если ЗначениеЗаполнено(СтруктураДанные.Партия) И ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
		
		ДанныеПартии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Партия, "Статус, НалогообложениеНДС, СтавкаНДС");
		Если ДанныеПартии.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии") Тогда
			
			Если ДанныеПартии.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
				Если ЗначениеЗаполнено(ДанныеПартии.СтавкаНДС) Тогда
					ДанныеНДС.СтавкаНДС = ДанныеПартии.СтавкаНДС;
				Иначе
					ВидСтавкиНДС = ?(ЗначениеЗаполнено(НоменклатураВидСтавки),
						НоменклатураВидСтавки, ВидСтавкиПоУмолчанию);
					ДанныеНДС.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС);
				КонецЕсли;
				
				ДанныеНДС.КомиссияСНДС = Истина;
				Если СтруктураДанные.НалогообложениеНДС = ТипНеОблагаетсяНДС Тогда
					ДанныеНДС.ТребуетсяИзменениеНалогообложениеНаСНДС = Истина;
				КонецЕсли;
			Иначе
				ДанныеНДС.СтавкаНДС = СтавкаБезНДС;
			КонецЕсли;
			
			ДанныеНДС.ЗначениеСтавкиНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(
				ДанныеНДС.СтавкаНДС);
			Возврат ДанныеНДС;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДанные.НалогообложениеНДС = ТипНеОблагаетсяНДС
		ИЛИ СтруктураДанные.ЕстьПартииСНДС И ВидСтавкиПоУмолчанию = ВидСтавкиБезНДС Тогда
		
		ДанныеНДС.СтавкаНДС = СтавкаБезНДС;
		Возврат ДанныеНДС;
		
	КонецЕсли;
	
	ИспользуетсяНДСНаУСН = (ВидСтавкиПоУмолчанию = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ОбщаяУСН")
		Или ВидСтавкиПоУмолчанию = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ПониженнаяУСН"));

	НоменклатураБезНДС = НоменклатураВидСтавки = ВидСтавкиБезНДС ИЛИ НоменклатураВидСтавки = ВидСтавкиНулевая;
	
	Если НоменклатураБезНДС
		ИЛИ НЕ ИспользуетсяНДСНаУСН И ЗначениеЗаполнено(НоменклатураВидСтавки) Тогда

		ВидСтавкиНДС = НоменклатураВидСтавки;
	Иначе
		ВидСтавкиНДС = ВидСтавкиПоУмолчанию;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидСтавкиНДС) Тогда
		ВидСтавкиНДС = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Общая");
	КонецЕсли;
	
	ДанныеНДС.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС);
	ДанныеНДС.ЗначениеСтавкиНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(ДанныеНДС.СтавкаНДС);
	
	Возврат ДанныеНДС;
	
КонецФункции

// Заполняет колонку СтавкаНДС, СуммаНДС, Всего в табличной части
//
// Параметры:
//  Объект					 - ДокументОбъект - документ, в котором требуется обновить колонки табличной части
//  ИмяТабличнойЧасти		 - Строка	 - имя табличной части
//  УчитыватьПартии			 - Булево	 - учитывать ставку НДС партии
//  ВидСтавкиНДСПоУмолчанию	 - ПеречислениеСсылка.ВидыСтавокНДС	 - ставка НДС по умолчанию
//
Процедура ОбновитьСтавкуНДСТабличнойЧасти(Объект, ИмяТабличнойЧасти, УчитыватьПартии, ВидСтавкиНДСПоУмолчанию = Неопределено) Экспорт
	
	ДанныеРасчетаНДС = ПараметрыОпределенияСтавкиНДС();
	ДанныеРасчетаНДС.Организация = Объект.Организация;
	ДанныеРасчетаНДС.ДатаОбработки = Объект.Дата;
	ДанныеРасчетаНДС.НалогообложениеНДС = Объект.НалогообложениеНДС;
	Если ЗначениеЗаполнено(ВидСтавкиНДСПоУмолчанию) Тогда
		ДанныеРасчетаНДС.ВидСтавкиНДСПоУмолчанию = ВидСтавкиНДСПоУмолчанию;
	КонецЕсли;
	
	СсылкиНоменклатура = Новый Массив;
	СтрокиЗаполнить = Новый Массив;
	Для Каждого Строка Из Объект[ИмяТабличнойЧасти] Цикл
		НоменклатураСтроки = Строка.Номенклатура;
		Если ЗначениеЗаполнено(НоменклатураСтроки) И ТипЗнч(НоменклатураСтроки) = Тип("СправочникСсылка.Номенклатура") Тогда
			СсылкиНоменклатура.Добавить(НоменклатураСтроки);
			СтрокиЗаполнить.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ВидыСтавокНДС = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СсылкиНоменклатура, "ВидСтавкиНДС");
	
	Если УчитыватьПартии И Объект[ИмяТабличнойЧасти].Количество() > 0
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект[ИмяТабличнойЧасти][0], "КомиссияСНДС") Тогда
		
		ОтборКомиссия = Новый Структура("КомиссияСНДС", Истина);
		ДанныеРасчетаНДС.ЕстьПартииСНДС = Объект[ИмяТабличнойЧасти].НайтиСтроки(ОтборКомиссия).Количество() > 0;
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиЗаполнить Цикл
		
		ДанныеРасчетаНДС = ПараметрыОпределенияСтавкиНДС(ДанныеРасчетаНДС);
		ДанныеРасчетаНДС.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		
		РеквизитыНоменклатуры = ВидыСтавокНДС.Получить(СтрокаТабличнойЧасти.Номенклатура);
		Если РеквизитыНоменклатуры <> Неопределено Тогда
			ДанныеРасчетаНДС.НоменклатураВидСтавкиНДС = РеквизитыНоменклатуры.ВидСтавкиНДС;
		КонецЕсли;
		
		Если УчитыватьПартии Тогда
			ДанныеРасчетаНДС.Партия = СтрокаТабличнойЧасти.Партия;
		КонецЕсли;
		ДанныеНДС = ДанныеНДССтрокиНоменклатуры(ДанныеРасчетаНДС);
		СтрокаТабличнойЧасти.СтавкаНДС = ДанныеНДС.СтавкаНДС;
		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
			СтрокаТабличнойЧасти.Сумма, Объект.СуммаВключаетНДС, ДанныеНДС.ЗначениеСтавкиНДС);
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма
			+ ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	КонецЦикла;

КонецПроцедуры

// Проверяет,в зависимости от использования, заполнение характеристик номенклатуры
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  Отказ - Булево - Отказ
//  ПроверятьЗаполнениеПартий - Булево - Проверять заполнение партий
//  ИменаТЧДляИсключенияПроверкиПартий - Неопределено - Имена ТЧДля исключения проверки партий
Процедура ПроверитьЗаполнениеХарактеристик(Объект, Отказ, ПроверятьЗаполнениеПартий = Ложь, ИменаТЧДляИсключенияПроверкиПартий = Неопределено) Экспорт
	
	СписокИменТЧДляИсключенияПроверкиПартий = Новый СписокЗначений;
	
	Если Не ИменаТЧДляИсключенияПроверкиПартий = Неопределено Тогда
		СписокИменТЧДляИсключенияПроверкиПартий = ИменаТЧДляИсключенияПроверкиПартий;
	КонецЕсли;
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ПроверятьЗаполнениеПартий И Не Объект.Метаданные().Реквизиты.Найти("ВидОперации") = Неопределено
		И (Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку 
		Или Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию 
		Или Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение) Тогда
		
		ПроверятьЗаполнениеПартий = Ложь;
	КонецЕсли;
	
	ЭтоДокументКорректировкаПоступления = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления"),
		Истина, Ложь);
	ЭтоДокументКорректировкаРеализации = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации"),
		Истина, Ложь);
	ЭтоДокументПересортицаЗапасов = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПересортицаЗапасов"),
		Истина, Ложь);
	ЭтоДокументЗаказПоставщику = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику"),
		Истина, Ложь);
	ЭтоДокументСчетНаОплатуПолученный = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика"),
		Истина, Ложь);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	МассивИменТабличныхЧастей = Новый Массив;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		Если НЕ ТабличнаяЧасть.Реквизиты.Найти("Характеристика") = Неопределено Тогда
			
			Если ТабличнаяЧасть.Имя = "Калькуляция" Тогда Продолжить КонецЕсли;
			
			Если ТабличнаяЧасть.Имя = "РаспределениеЗапасов" 
				И Объект.Метаданные().Реквизиты.Найти("РучноеРаспределение") <> Неопределено 
				И НЕ Объект.РучноеРаспределение Тогда
				// При автоматическом распределении контроль табличной части не выполняется, она имеет служебный характер
				Продолжить;
			КонецЕсли; 
			
			МассивИменТабличныхЧастей.Добавить(ТабличнаяЧасть.Имя);
			
		КонецЕсли;
	КонецЦикла;
	
	НеПроверятьУслуги = ?(ЭтоДокументЗаказПоставщику Или ЭтоДокументСчетНаОплатуПолученный, Истина, Ложь);
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьПартии = ПолучитьФункциональнуюОпцию("ИспользоватьПартии");
	
	Для Каждого ИмяТабличнойЧасти Из МассивИменТабличныхЧастей Цикл
		
		ПроверятьПартии = Ложь;
		
		Если ПроверятьЗаполнениеПартий 
			И Не МетаданныеОбъекта.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Найти("Партия") = Неопределено Тогда
			
			ПроверятьПартии =
				?(Не СписокИменТЧДляИсключенияПроверкиПартий.НайтиПоЗначению(ИмяТабличнойЧасти) = Неопределено,
				Ложь, Истина);
			
		КонецЕсли;
		
		//@skip-check query-in-loop		
		Если ЭтоДокументПересортицаЗапасов Тогда
			ТаблицаРеквизитов = ТаблицаЗначенийРеквизитовНоменклатурыТабличнойЧастиПересортица(Объект[ИмяТабличнойЧасти]);
		Иначе
			ТаблицаРеквизитов = ТаблицаЗначенийРеквизитовНоменклатурыТабличнойЧасти(Объект[ИмяТабличнойЧасти]);
		КонецЕсли;
		
		Для Каждого СтрокаЗапасы Из Объект[ИмяТабличнойЧасти] Цикл
			
			Номенклатура = СтрокаЗапасы.Номенклатура;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда Продолжить КонецЕсли;
			
			НомерСтроки = СтрокаЗапасы.НомерСтроки;
			
			ЭтоНоменклатура = ?(ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура"), Истина, Ложь);
			
			Если Не ЭтоНоменклатура Тогда Продолжить КонецЕсли;
			
			ЭтоГруппа = ТаблицаРеквизитов[НомерСтроки-1].ЭтоГруппа;
			Если ЭтоГруппа Тогда Продолжить КонецЕсли;
			
			ПроверятьЗаполнениеХарактеристики = ТаблицаРеквизитов[НомерСтроки-1].ПроверятьЗаполнениеХарактеристики;
			ПроверятьЗаполнениеПартий = ТаблицаРеквизитов[НомерСтроки-1].ПроверятьЗаполнениеПартий;
			
			ПроверятьЗаполнениеХарактеристикВТабЧасти = ПроверятьЗаполнениеХарактеристики И ИспользоватьХарактеристики;
			ПроверятьЗаполнениеПартийВТабЧасти = ПроверятьЗаполнениеПартий И ИспользоватьПартии;
			
			Если (ЭтоДокументКорректировкаПоступления И СтрокаЗапасы.ЕстьВДокументеПоступления) 
				Или (ЭтоДокументКорректировкаРеализации И СтрокаЗапасы.ЕстьВДокументеРеализации) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипНоменклатуры = ТаблицаРеквизитов[НомерСтроки-1].ТипНоменклатуры;
			
			Если НеПроверятьУслуги И ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПроверятьЗаполнениеХарактеристикВТабЧасти
				И Не ЗначениеЗаполнено(СтрокаЗапасы.Характеристика) Тогда
				ТекстСообщения = СтрШаблон(НСтр(
					"ru = 'В таблице ""%1"" для номенклатуры %2 в строке %3 заполнение поля ""Характеристика"" является обязательным.'"),
					ИмяТабличнойЧасти, Номенклатура, НомерСтроки);
				КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НомерСтроки,
					"Характеристика");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле, , Отказ);
			КонецЕсли;
			
			Если ПроверятьПартии
				И ПроверятьЗаполнениеПартийВТабЧасти
				И Не ЗначениеЗаполнено(СтрокаЗапасы.Партия) Тогда
				ТекстСообщения = СтрШаблон(НСтр(
					"ru = 'В таблице ""%1"" для номенклатуры %2 в строке %3 заполнение поля ""Партия"" является обязательным.'"),
					ИмяТабличнойЧасти, Номенклатура, НомерСтроки);
				КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НомерСтроки,
					"Партия");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле, , Отказ);
			КонецЕсли;
			
			Если ЭтоДокументПересортицаЗапасов Тогда
				
				ПроверятьЗаполнениеХарактеристикиОприходование =
					ТаблицаРеквизитов[НомерСтроки-1].ПроверятьЗаполнениеХарактеристикиОприходование;
				ПроверятьЗаполнениеПартийОприходование =
					ТаблицаРеквизитов[НомерСтроки-1].ПроверятьЗаполнениеПартийОприходование;
				
				ПроверятьЗаполнениеХарактеристикВТабЧастиОприходование =
					ПроверятьЗаполнениеХарактеристикиОприходование И ИспользоватьХарактеристики;
				ПроверятьЗаполнениеПартийВТабЧастиОприходование =
					ПроверятьЗаполнениеПартийОприходование И ИспользоватьПартии;
				
				Если ПроверятьЗаполнениеХарактеристикВТабЧастиОприходование
					И Не ЗначениеЗаполнено(СтрокаЗапасы.ХарактеристикаОприходование) Тогда
					ТекстСообщения = СтрШаблон(НСтр(
					"ru = 'В таблице ""%1"" для номенклатуры %2 в строке %3 заполнение поля ""Характеристика"" является обязательным.'"),
					ИмяТабличнойЧасти, СтрокаЗапасы.НоменклатураОприходование, НомерСтроки);
					КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НомерСтроки,
					"ХарактеристикаОприходование");
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле, , Отказ);
				КонецЕсли;
				
				Если ПроверятьПартии
					И ПроверятьЗаполнениеПартийВТабЧастиОприходование
					И Не ЗначениеЗаполнено(СтрокаЗапасы.ПартияОприходование) Тогда
					ТекстСообщения = СтрШаблон(НСтр(
					"ru = 'В таблице ""%1"" для номенклатуры %2 в строке %3 заполнение поля ""Партия"" является обязательным.'"),
					ИмяТабличнойЧасти, СтрокаЗапасы.НоменклатураОприходование, НомерСтроки);
					КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НомерСтроки,
					"ПартияОприходование");
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле, , Отказ);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Обновляет условное оформление колонки "Характеристика" для формы документа
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма объекта для условного оформления
//   СоответствиеИменТабличныхЧастей - Соответствие из КлючИЗначение:
//     * Ключ - Строка -  Имя Табличной части
//     * Значение - Строка - Имя колонки табличной части
Процедура ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристик(Форма, СоответствиеИменТабличныхЧастей = Неопределено) Экспорт  
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьПартии = ПолучитьФункциональнуюОпцию("ИспользоватьПартии");
	
	Если НЕ ИспользоватьПартии И НЕ ИспользоватьХарактеристики Тогда
		Возврат
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЗаказНаПроизводство.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.СборкаЗапасов.Форма.ФормаДокумента" Тогда
		
		НаименованиеПоляХарактеристика = "РаспределениеЗапасовХарактеристика";
		НаименованиеПоляПартия = "РаспределениеЗапасовПартия";
		
		ЗначениеПоиска = Форма.Элементы.Найти(НаименованиеПоляХарактеристика);
		
		ЗначениеПоискаПартия = Форма.Элементы.Найти(НаименованиеПоляПартия);
		
		Если ИспользоватьХарактеристики И НЕ ЗначениеПоиска = Неопределено Тогда
			
			ИмяПоляПроверятьЗаполнениеХарактеристики = "РаспределениеЗапасов.ПроверятьЗаполнениеХарактеристики";
			ИмяПоляИспользоватьХарактеристики = "РаспределениеЗапасов.ИспользоватьХарактеристики";
			ИмяПоляХарактеристики = НаименованиеПоляХарактеристика;
			
			НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
			РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
				ИмяПоляИспользоватьХарактеристики, Ложь, ВидСравненияКомпоновкиДанных.Равно);
			
			РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
				НСтр("ru = '<Не используется>'"));
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
				ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
			
			НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
			РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
				ИмяПоляПроверятьЗаполнениеХарактеристики, Истина, ВидСравненияКомпоновкиДанных.Равно);
			
			РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
				Истина);
			
			НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
			РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
				"РаспределениеЗапасов.Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),
				ВидСравненияКомпоновкиДанных.НеРавно);
			РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
			
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
		КонецЕсли;
		
		Если ИспользоватьПартии И НЕ ЗначениеПоискаПартия = Неопределено Тогда
			ИмяПоляПроверятьЗаполнениеПартии = "РаспределениеЗапасов.ПроверятьЗаполнениеПартий";
			ИмяПоляИспользоватьПартии = "РаспределениеЗапасов.ИспользоватьПартии";
			ИмяПоляПартии = НаименованиеПоляПартия;
			
			НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
			РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
				ИмяПоляИспользоватьПартии, Ложь, ВидСравненияКомпоновкиДанных.Равно);
			
			РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляПартии);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
				НСтр("ru = '<Не используется>'"));
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", 
				ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
			
			НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
			РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
				ИмяПоляПроверятьЗаполнениеПартии, Истина, ВидСравненияКомпоновкиДанных.Равно);
			
			РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляПартии);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
				Истина);
			
			НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
			
			РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
				"РаспределениеЗапасов.Партия", Справочники.ПартииНоменклатуры.ПустаяСсылка(),
				ВидСравненияКомпоновкиДанных.НеРавно);
			РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляПартии);
			РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
				Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если СоответствиеИменТабличныхЧастей = Неопределено Тогда
		
		МетаданныеОбъекта = Форма.Объект.Ссылка.Метаданные();
		
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			Если ИспользоватьХарактеристики И НЕ ТабличнаяЧасть.Реквизиты.Найти("Характеристика") = Неопределено Тогда
				НаименованиеПоля = ТабличнаяЧасть.Имя + "Характеристика";
				ЗначениеПоиска = Форма.Элементы.Найти(НаименованиеПоля);
				
				Если НЕ ЗначениеПоиска = Неопределено И ТипЗнч(ЗначениеПоиска.Родитель) = Тип("ТаблицаФормы") Тогда
					ИмяПоляПроверятьЗаполнениеХарактеристики = ЗначениеПоиска.Родитель.ПутьКДанным
						+ ".ПроверятьЗаполнениеХарактеристики";
					ИмяПоляИспользоватьХарактеристики = ЗначениеПоиска.Родитель.ПутьКДанным
						+ ".ИспользоватьХарактеристики";
					ИмяПоляХарактеристики = НаименованиеПоля; 
					
					НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ИмяПоляИспользоватьХарактеристики, Ложь, ВидСравненияКомпоновкиДанных.Равно);
					
					Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь,
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли; 
					
					Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
						НСтр("ru = '<Не используется>'"));
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр",
						Истина);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
						ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
					
					НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ИмяПоляПроверятьЗаполнениеХарактеристики, Истина, ВидСравненияКомпоновкиДанных.Равно);
					
					Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь,
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь,
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
						"ОтметкаНезаполненного", Истина);
					
					НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным+".Характеристика",
						Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),
							ВидСравненияКомпоновкиДанных.НеРавно);
					РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
						"ОтметкаНезаполненного", Ложь);
				КонецЕсли;
			КонецЕсли;
			
			Если ИспользоватьПартии И НЕ ТабличнаяЧасть.Реквизиты.Найти("Партия") = Неопределено Тогда
				НаименованиеПоля = ТабличнаяЧасть.Имя + "Партия";
				ЗначениеПоиска = Форма.Элементы.Найти(НаименованиеПоля);
				
				Если НЕ ЗначениеПоиска = Неопределено И ТипЗнч(ЗначениеПоиска.Родитель) = Тип("ТаблицаФормы") Тогда
					ИмяПоляИспользоватьПартии = ЗначениеПоиска.Родитель.ПутьКДанным+".ИспользоватьПартии";
					ИмяПоляХарактеристики = НаименованиеПоля; 
					ИмяПоляПроверятьЗаполнениеПартии = ЗначениеПоиска.Родитель.ПутьКДанным + ".ПроверятьЗаполнениеПартий";
					
					ИмяПоляВидОперации = "Объект.ВидОперации";
					СписокИсключенийВидовОпераций = Новый СписокЗначений;
					
					СписокИсключенийВидовОпераций.Добавить(
						Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку);
					СписокИсключенийВидовОпераций.Добавить(
						Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию);
					СписокИсключенийВидовОпераций.Добавить(
						Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение);
					
					СписокИсключенийВидовОпераций.Добавить(
						Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту);
					СписокИсключенийВидовОпераций.Добавить(
						Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки);
					СписокИсключенийВидовОпераций.Добавить(
						Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения);
					
					НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
						ИмяПоляИспользоватьПартии, Ложь, ВидСравненияКомпоновкиДанных.Равно);
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
						ИмяПоляВидОперации, СписокИсключенийВидовОпераций, ВидСравненияКомпоновкиДанных.НеВСписке);
					
					Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь, 
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь, 
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
						НСтр("ru = '<Не используется>'"));
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр",
						Истина);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
						ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
					
					НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ИмяПоляПроверятьЗаполнениеПартии, Истина, ВидСравненияКомпоновкиДанных.Равно);
					
					Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь,
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
						РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
							ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь,
							ВидСравненияКомпоновкиДанных.Равно);
					КонецЕсли;
					
					РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
						"ОтметкаНезаполненного", Истина);
					
					НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным+".Партия",
						Справочники.ПартииНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
					РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
					РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление,
					"ОтметкаНезаполненного", Ложь);
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого ТабличнаяЧасть Из СоответствиеИменТабличныхЧастей Цикл
			
			НаименованиеПоля =?(ЗначениеЗаполнено(ТабличнаяЧасть.Значение),ТабличнаяЧасть.Значение,
				ТабличнаяЧасть.Ключ + "Характеристика");
			ЗначениеПоиска = Форма.Элементы.Найти(НаименованиеПоля);
			
			Если ИспользоватьХарактеристики И НЕ ЗначениеПоиска = Неопределено
				И ТипЗнч(ЗначениеПоиска.Родитель) = Тип("ТаблицаФормы") Тогда
				ИмяПоляПроверятьЗаполнениеХарактеристики = ЗначениеПоиска.Родитель.ПутьКДанным
					+ ".ПроверятьЗаполнениеХарактеристики";
				ИмяПоляИспользоватьХарактеристики = ЗначениеПоиска.Родитель.ПутьКДанным
					+ ".ИспользоватьХарактеристики";
				ИмяПоляХарактеристики = НаименованиеПоля; 
				
				НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
					ИмяПоляИспользоватьХарактеристики, Ложь, ВидСравненияКомпоновкиДанных.Равно);
				
				Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
					ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь, 
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
					ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь, 
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
					НСтр("ru = '<Не используется>'"));
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр",
					Истина);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
					ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
				
				НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
					ИмяПоляПроверятьЗаполнениеХарактеристики, Истина, ВидСравненияКомпоновкиДанных.Равно);
				
				Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
					Истина);
				
				НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
					ЗначениеПоиска.Родитель.ПутьКДанным+".Характеристика",
					Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
					Ложь);
			КонецЕсли;
			
			НаименованиеПоля = ТабличнаяЧасть.Ключ + "Партия";
			ЗначениеПоиска = Форма.Элементы.Найти(НаименованиеПоля);
			
			Если ИспользоватьПартии И НЕ ЗначениеПоиска = Неопределено
				И ТипЗнч(ЗначениеПоиска.Родитель) = Тип("ТаблицаФормы") Тогда
				ИмяПоляИспользоватьПартии = ЗначениеПоиска.Родитель.ПутьКДанным+".ИспользоватьПартии";
				ИмяПолПартии = НаименованиеПоля; 
				ИмяПоляПроверятьЗаполнениеПартии = ЗначениеПоиска.Родитель.ПутьКДанным
					+ ".ПроверятьЗаполнениеПартий";
				
				ИмяПоляВидОперации = "Объект.ВидОперации";
				СписокИсключенийВидовОпераций = Новый СписокЗначений;
				
				СписокИсключенийВидовОпераций.Добавить(
					Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку);
				СписокИсключенийВидовОпераций.Добавить(
					Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию);
				СписокИсключенийВидовОпераций.Добавить(
					Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение);
				
				СписокИсключенийВидовОпераций.Добавить(
					Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту);
				СписокИсключенийВидовОпераций.Добавить(
					Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки);
				СписокИсключенийВидовОпераций.Добавить(
					Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения);
				
				НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
					ИмяПоляИспользоватьПартии, Ложь, ВидСравненияКомпоновкиДанных.Равно);
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
					ИмяПоляВидОперации, СписокИсключенийВидовОпераций, ВидСравненияКомпоновкиДанных.НеВСписке);
				
				Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПолПартии);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст",
					НСтр("ru = '<Не используется>'"));
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр",
					Истина);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
					ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
				
				НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
					ИмяПоляПроверятьЗаполнениеПартии, Истина, ВидСравненияКомпоновкиДанных.Равно);
				
				Если Форма.ИмяФормы = "Документ.КорректировкаПоступления.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеПоступления", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
					РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
						ЗначениеПоиска.Родитель.ПутьКДанным + ".ЕстьВДокументеРеализации", Ложь,
						ВидСравненияКомпоновкиДанных.Равно);
				КонецЕсли;
				
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПолПартии);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
					Истина);
				
				НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор,
					ЗначениеПоиска.Родитель.ПутьКДанным+".Партия", Справочники.ПартииНоменклатуры.ПустаяСсылка(),
					ВидСравненияКомпоновкиДанных.НеРавно);
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПолПартии);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного",
					Ложь);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Получает значение партии номенклатуры по умолчанию
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  СтатусПартии - Неопределено - Статус партии
//    - ПеречислениеСсылка.СтатусыПартий
//    - СписокЗначений из ЭлементСпискаЗначений:
//       * Значение - ПеречислениеСсылка.СтатусыПартий
//  Контрагент - Неопределено - Контрагент
// 
// Возвращаемое значение:
//  Неопределено - Значения партий номенклатуры по умолчанию
Функция ЗначенияПартийНоменклатурыПоУмолчанию(Номенклатура, СтатусПартии = Неопределено, Контрагент = Неопределено) Экспорт 
	
	СписокСтатусов = Новый СписокЗначений;
	
	Если Не СтатусПартии = Неопределено Тогда
		Если Не ТипЗнч(СтатусПартии) = Тип("СписокЗначений")
			Тогда
			СписокСтатусов.Добавить(СтатусПартии);
		Иначе
			СписокСтатусов = СтатусПартии;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииКонтрагентов.Партия КАК Партия
	|ИЗ
	|	РегистрСведений.ПартииКонтрагентов КАК ПартииКонтрагентов
	|ГДЕ
	|	ПартииКонтрагентов.Номенклатура = &Номенклатура
	|	И ПартииКонтрагентов.Статус В (&СписокСтатусов)
	|	И ПартииКонтрагентов.Контрагент = &Контрагент";
	
	Если СписокСтатусов.Количество() Тогда
		Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ПартииКонтрагентов.Статус В (&СписокСтатусов)","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		ВыборкаЗапроса = Запрос.Выполнить();
		Если ВыборкаЗапроса.Пустой() Тогда
			Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Иначе
			РезультатЗапроса = ВыборкаЗапроса.Выбрать();
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПартииКонтрагентов.Контрагент = &Контрагент","");
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	
	Если РезультатЗапроса.Количество()>1 Тогда
		Возврат Неопределено
	Иначе	
		Если РезультатЗапроса.Следующий() Тогда
			Возврат РезультатЗапроса.Партия;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает статус партии, соответствующий операции документа
//
// Параметры:
//  Объект		 - ЛюбаяСсылка							  - Ссылка или ключ объекта, для которого определяются статусы партии
//  ВидОперации	 - ПеречислениеСсылка					  - Текущая операция объекта
//  ХозОперация	 - СправочникСсылка.ХозяйственныеОперации - Хозяйственная операция
// 
// Возвращаемое значение:
//  СписокЗначений из ЭлементСпискаЗначений - Список доступных статусов партий
//
Функция СоответствиеВидаОперацииИлиХозОперацииСтатусуПартии(Объект = Неопределено, ВидОперации = Неопределено, 
	ХозОперация = Неопределено) Экспорт
	
	ОперацияДокумента = ?(Не ВидОперации = Неопределено, ВидОперации, ХозОперация);
	
	ОтборСтатус = Новый СписокЗначений;
	
	Если ОперацияДокумента = Неопределено Тогда
		ОтборСтатус.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
		ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ДавальческоеСырье);
		ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ОтветственноеХранение);
		ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
		Возврат ОтборСтатус;
	КонецЕсли;
	
	Если Не ОперацияДокумента = Неопределено 
		И ТипЗнч(ОперацияДокумента) = Тип("СправочникСсылка.ХозяйственныеОперации") Тогда
		
		Если ОперацияДокумента = Справочники.ХозяйственныеОперации.ВозвратКомитенту
			Или ОперацияДокумента = Справочники.ХозяйственныеОперации.ПриемНаКомиссию Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
		ИначеЕсли ОперацияДокумента = Справочники.ХозяйственныеОперации.ПриемНаОтветХранение
			Или ОперацияДокумента = Справочники.ХозяйственныеОперации.ВозвратСОтветХранения Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ОтветственноеХранение);
		ИначеЕсли ОперацияДокумента = Справочники.ХозяйственныеОперации.ПриемВПереработку
			Или ОперацияДокумента = Справочники.ХозяйственныеОперации.ВозвратИзПереработки Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ДавальческоеСырье);
		Иначе
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
			
			Если ОперацияДокумента = Справочники.ХозяйственныеОперации.ПродажаПокупателю Тогда
				ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ОтборСтатус.Количество()Тогда
			СообщитьЧтоВыборПартииНевозможен(Объект, ОперацияДокумента);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли Не ОперацияДокумента = Неопределено 
		И (ТипЗнч(ОперацияДокумента) = Тип("ПеречислениеСсылка.ВидыОперацийРасходнаяНакладная") 
		ИЛИ ТипЗнч(ОперацияДокумента) = Тип("ПеречислениеСсылка.ВидыОперацийПриходнаяНакладная"))Тогда
		
		Если ОперацияДокумента = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту
			Или ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
		ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение
			Или ОперацияДокумента = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ОтветственноеХранение);
		ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку
			Или ОперацияДокумента = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ДавальческоеСырье);
		ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
		Иначе
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
			
			Если ОперацияДокумента = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
				ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ОтборСтатус.Количество() Тогда
			СообщитьЧтоВыборПартииНевозможен(Объект, ОперацияДокумента);
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		Если ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
		ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ОтветственноеХранение);
		ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку Тогда
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ДавальческоеСырье);
		Иначе
			ОтборСтатус.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
			
			Если ОперацияДокумента = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
				ОтборСтатус.Добавить(Перечисления.СтатусыПартий.ТоварыНаКомиссии);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ОтборСтатус.Количество() Тогда
			СообщитьЧтоВыборПартииНевозможен(Объект, ОперацияДокумента);
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтборСтатус;
	
КонецФункции

// Возвращает признак того, что партия является основной для контрагента
//
// Параметры:
//  Ссылка	 - СправочникСсылка.ПартииНоменклатуры	 - Проверяемая партия
// 
// Возвращаемое значение:
//  Булево - Признак того, что партия является основной
//
Функция ПартияУстановленаПоУмолчанию(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииКонтрагентов.Партия КАК Партия
	|ИЗ
	|	РегистрСведений.ПартииКонтрагентов КАК ПартииКонтрагентов
	|ГДЕ
	|	ПартииКонтрагентов.Партия = &Ссылка";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Заполняет значения колонки "ОстатокОбщий" для таблицы "ТЧНоменклатура" формы документа.
//
// Параметры:
//  ТЧНоменклатура     - ДанныеФормыКоллекция - таблица формы.
//  НоменклатураОтбора - Массив.  
Процедура ЗаполнитьЗначенияОстатковТЧНоменклатураУстановкаЦен(ТЧНоменклатура, НоменклатураОтбора = Неопределено) Экспорт
		
	Если ТЧНоменклатура.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;         
				
	ТаблицаНоменклатуры = ДанныеФормыВЗначение(ТЧНоменклатура, Тип("ТаблицаЗначений"));
	
	Если НоменклатураОтбора = Неопределено Тогда    
		
		ВнешняяТаблицаНоменклатуры = ТаблицаНоменклатуры.Скопировать(, "Номенклатура");
	Иначе 
					
		МассивСтрокКопировать = СформироватьМассивСтрокДляКопированияУстановкаЦен(ТаблицаНоменклатуры,
			НоменклатураОтбора);   	
		Если МассивСтрокКопировать.Количество() = 0 Тогда  
			Возврат;
		КонецЕсли;  
				
		ВнешняяТаблицаНоменклатуры = ТаблицаНоменклатуры.Скопировать(МассивСтрокКопировать, "Номенклатура"); 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры", ВнешняяТаблицаНоменклатуры);

	Запрос.Текст = ТекстЗапросаОстаткиУстановкаЦенНоменклатуры(Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	ЗаполнитьКолонкуОстатокОбщийУстановкаЦен(ТЧНоменклатура, ТаблицаОстатков);
	
КонецПроцедуры 

// Возвращает ТаблицуЗначений, с заполненной колонкой "ОстатокОбщий".
// 
// Параметры:
//  ТЧНоменклатура 		- ТаблицаЗначений.
//  НоменклатураОтбора 	- Массив - (необязательный). 
//
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - ТаблицаЗначений, Неопределено
Функция ЗаполнитьЗначенияОстатковТЧНоменклатураУстановкаЦен_ВФоне(ТЧНоменклатура,
	НоменклатураОтбора = Неопределено) Экспорт
			
	Если ТЧНоменклатура.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;  
					
	Если НоменклатураОтбора = Неопределено Тогда 
		
		ВнешняяТаблицаНоменклатуры = ТЧНоменклатура.Скопировать(, "Номенклатура");		
	Иначе 
				
		МассивСтрокКопировать = СформироватьМассивСтрокДляКопированияУстановкаЦен(ТЧНоменклатура,
			НоменклатураОтбора); 	
		Если МассивСтрокКопировать.Количество() = 0 Тогда  
			Возврат Неопределено;
		КонецЕсли; 
		
		ВнешняяТаблицаНоменклатуры = ТЧНоменклатура.Скопировать(МассивСтрокКопировать, "Номенклатура"); 		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры", ВнешняяТаблицаНоменклатуры);

	Запрос.Текст = ТекстЗапросаОстаткиУстановкаЦенНоменклатуры(Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	ЗаполнитьКолонкуОстатокОбщийУстановкаЦен(ТЧНоменклатура, ТаблицаОстатков);
	
	Возврат ТЧНоменклатура; 
				
КонецФункции 

// Возвращает Список значений, в котором хранятся значения остатков в разрезе складов
//
// Параметры:
//  ИмяТаблицыДанныхФормы 	- Строка.
//  СтруктураПараметров 	- Структура - Структура с дополнительными параметрами. 
//
// Возвращаемое значение:
// 	СписокЗначений из ЭлементСпискаЗначений	
Функция СформироватьСписокСкладовОстаткиУстановкаЦен(ИмяТаблицыДанныхФормы, СтруктураПараметров) Экспорт
	
	СписокВозврата = Новый СписокЗначений;
		
	Запрос = Новый Запрос; 

	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура); 
	
	Если СтруктураПараметров.Свойство("Характеристика") Тогда
		Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика); 
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаСписокСкладовОстаткиУстановкаЦенНоменклатуры(ИмяТаблицыДанныхФормы);
		
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ДлинаЧисла = 0;
		ЕдиницаИзмерения = СтруктураПараметров.ЕдиницаИзмерения;	
		Коэффициент = ?(ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения"),
			ЕдиницаИзмерения.Коэффициент, 1);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗначенийПоСкладу = Новый Структура("Склад, Количество");
						
			Количество = Выборка.КоличествоОстаток;
			
			Если Количество = 0 Тогда 
				Продолжить; 
			КонецЕсли;
			
			Количество = Окр(Количество / Коэффициент, 3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ПредставлениеЗначения = КоличествоТовара + " " + Строка(ЕдиницаИзмерения) + ". " + Строка(Выборка.Склад);
			
			СтруктураЗначенийПоСкладу.Склад 		= Выборка.Склад;
			СтруктураЗначенийПоСкладу.Количество 	= Количество;
			
			СписокВозврата.Добавить(СтруктураЗначенийПоСкладу, ПредставлениеЗначения);
			
		КонецЦикла;
	КонецЕсли;

	Возврат СписокВозврата;

КонецФункции

// Заполняет значения колонки "ОстатокОбщий" для формы документа.
//
// Параметры:
// 	ТЧХарактеристики 	- ДанныеФормыКоллекция - таблица формы.
// 	НоменклатураОтбора 	- СправочникСсылка.Номенклатура - владелец характеристики. 
Процедура ЗаполнитьЗначенияОстатковНоменклатурыТЧХарактеристикиУстановкаЦен(ТЧХарактеристики, НоменклатураОтбора) Экспорт
	
	Если ТЧХарактеристики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 		 
	
	ТаблицаХарактеристик = ДанныеФормыВЗначение(ТЧХарактеристики, Тип("ТаблицаЗначений")); 	
	МассивХарактеристик = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаХарактеристик, "Характеристика");
		
	Запрос = Новый Запрос;	 
	
	Запрос.УстановитьПараметр("НоменклатураОтбора"	, НоменклатураОтбора); 
	Запрос.УстановитьПараметр("МассивХарактеристик"	, МассивХарактеристик);	
	
	Запрос.Текст = ТекстЗапросаОстаткиУстановкаЦенНоменклатуры(Истина); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	ЗаполнитьКолонкуОстатокОбщийУстановкаЦен(ТЧХарактеристики, ТаблицаОстатков);
	
КонецПроцедуры 

// Возвращает ТаблицуЗначений  с заполненной колонкой "ОстатокОбщий". 
//
// Параметры:
//  ТЧХарактеристики 	- ТаблицаЗначений.
//  НоменклатураОтбора - СправочникСсылка.Номенклатура - владелец характеристики 
//
// Возвращаемое значение:
//	ТаблицаЗначений, Неопределено
Функция ЗаполнитьЗначенияОстатковНоменклатурыТЧХарактеристикиУстановкаЦен_ВФоне(ТЧХарактеристики,
	НоменклатураОтбора) Экспорт
	
	Если ТЧХарактеристики.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 		 
		
	МассивХарактеристик = ОбщегоНазначения.ВыгрузитьКолонку(ТЧХарактеристики, "Характеристика");
		
	Запрос = Новый Запрос;	 
	
	Запрос.УстановитьПараметр("НоменклатураОтбора"	, НоменклатураОтбора); 
	Запрос.УстановитьПараметр("МассивХарактеристик"	, МассивХарактеристик);	
	
	Запрос.Текст = ТекстЗапросаОстаткиУстановкаЦенНоменклатуры(Истина); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	ЗаполнитьКолонкуОстатокОбщийУстановкаЦен(ТЧХарактеристики, ТаблицаОстатков);

	Возврат ТЧХарактеристики;
	
КонецФункции 

// Заполняет колонки табличной части документа Заказ на производство значениями по остаткам и резервам
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  СтруктураДанные - Структура
//  				- Неопределено
//  НомерВариантаКП - Число - Номер варианта КП
//  НоменклатураОтбора 	- СправочникСсылка.Номенклатура, Неопределено - Номенклатура для отбора
//  РезервированиеЗапасов - Булево
//@skip-check method-too-many-params
Процедура ЗаполнитьЗначенияРезервовИОстатокЗаказНаПроизводство(Объект, СтруктураДанные = Неопределено,
	НомерВариантаКП = 0, НоменклатураОтбора = Неопределено, РезервированиеЗапасов = Ложь) Экспорт
	
	Если Не Объект.Запасы.Количество() Тогда
		Возврат
	КонецЕсли;
	
	ИмяТЧ = "Запасы";
	
	Запрос = Новый Запрос;
	
	Если СтруктураДанные = Неопределено Тогда
		
		Если ЗначениеЗаполнено(НоменклатураОтбора) Тогда
			ПараметрыОтбора = Новый Структура("Номенклатура", НоменклатураОтбора);
			СтрокиДляВыгрузки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		Иначе
			СтрокиДляВыгрузки = Неопределено;
		КонецЕсли;
		МассивНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,"Номенклатура");
		МассивХарактеристик = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,"Характеристика");
		МассивПартий = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,"Партия");
	Иначе
		
		Номенклатура = СтруктураДанные.Номенклатура;
		Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика)
		, СтруктураДанные.Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия),
			СтруктураДанные.Партия, Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия",
			Номенклатура, Характеристика, Партия);

		СтрокиДляВыгрузки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Характеристика);
		МассивПартий = Новый Массив;
		МассивПартий.Добавить(Партия);
	КонецЕсли;
	
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	Если Не СтрокиДляВыгрузки = Неопределено Тогда
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,
			"Номенклатура, Характеристика, Партия, Количество, ЕдиницаИзмерения, СтруктурнаяЕдиница, ЗаказПокупателя");
		СтрокиОбходаЗапасов = СтрокиДляВыгрузки;
	Иначе
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(,
			"Номенклатура, Характеристика, Партия, Количество, ЕдиницаИзмерения, СтруктурнаяЕдиница, ЗаказПокупателя");
		СтрокиОбходаЗапасов = Объект.Запасы;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ЗаказПокупателя) И МассивЗаказов.Найти(СтрокаТЧ.ЗаказПокупателя) = Неопределено Тогда
			МассивЗаказов.Добавить(СтрокаТЧ.ЗаказПокупателя);
		КонецЕсли;
	КонецЦикла;
	
	Если Не МассивЗаказов.Количество() И ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда
		МассивЗаказов.Добавить(Объект.ЗаказПокупателя)
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Характеристика", МассивХарактеристик);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЗаказПокупателя", МассивЗаказов);
	Запрос.УстановитьПараметр("ЕстьЗаказы", ?(МассивЗаказов.Количество(), Истина, Ложь));
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	Запрос.Текст = ТекстЗапросаОстаткиИРезервыВРазрезеЗаказов();
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	РассчитатьКоличествоПоСтрокамСогласноКоэффициентам(ТаблицаНоменклатуры);
	
	ТаблицаНоменклатуры.Свернуть("Номенклатура, Характеристика, Партия, ЗаказПокупателя", "Количество");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	ПараметрыОтбора.Вставить("Партия");
	ПараметрыОтбора.Вставить("СтруктурнаяЕдиница");
	ПараметрыОтбора.Вставить("ЗаказПокупателя");
	
	ПараметрыОтбораДляПоискаОстатков = Новый Структура;
	ПараметрыОтбораДляПоискаОстатков.Вставить("Номенклатура");
	ПараметрыОтбораДляПоискаОстатков.Вставить("Характеристика");
	ПараметрыОтбораДляПоискаОстатков.Вставить("Партия");
	ПараметрыОтбораДляПоискаОстатков.Вставить("СтруктурнаяЕдиница");
	ПараметрыОтбораДляПоискаОстатков.Вставить("ЗаказПокупателя");
	
	ПараметрыОтбораСкладБезЗаказа = Новый Структура;
	ПараметрыОтбораСкладБезЗаказа.Вставить("Номенклатура");
	ПараметрыОтбораСкладБезЗаказа.Вставить("Характеристика");
	ПараметрыОтбораСкладБезЗаказа.Вставить("Партия");
	ПараметрыОтбораСкладБезЗаказа.Вставить("СтруктурнаяЕдиница");
	
	ПараметрыОтбораБезСклада = Новый Структура();
	ПараметрыОтбораБезСклада.Вставить("Номенклатура");
	ПараметрыОтбораБезСклада.Вставить("Характеристика");
	ПараметрыОтбораБезСклада.Вставить("Партия");
	ПараметрыОтбораБезСклада.Вставить("ЗаказПокупателя");
	
	ПараметрыОтбораБезСкладаБезЗаказа = Новый Структура();
	ПараметрыОтбораБезСкладаБезЗаказа.Вставить("Номенклатура");
	ПараметрыОтбораБезСкладаБезЗаказа.Вставить("Характеристика");
	ПараметрыОтбораБезСкладаБезЗаказа.Вставить("Партия");
	
	ПараметрыОтбораБезСкладаБезПартии = Новый Структура();
	ПараметрыОтбораБезСкладаБезПартии.Вставить("Номенклатура");
	ПараметрыОтбораБезСкладаБезПартии.Вставить("Характеристика");
	ПараметрыОтбораБезСкладаБезПартии.Вставить("ЗаказПокупателя");

	НомерСтроки = 0;
	ОбъектПроведен = Объект.Проведен;
	ЕстьДубли = Ложь;
	
	СтруктураПараметровОтбора = Новый Структура("ССкладом, БезСклада, БезСкладаСЗаказом",
		ПараметрыОтбораДляПоискаОстатков, ПараметрыОтбораБезСклада, ПараметрыОтбораБезСкладаБезПартии);
	ЗаполнитьНачальныеДанныеДляОбработкиТабличнойЧастиЗаказНаПроизводство(Объект, МассивЗаказов,
		СтрокиОбходаЗапасов, ТаблицаНоменклатуры, СтруктураПараметровОтбора);
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		ПараметрыОтбора.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ПараметрыОтбораБезСкладаБезЗаказа.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСкладаБезЗаказа.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСкладаБезЗаказа.Партия = СтрокаТабличнойЧасти.Партия;
		
		ПараметрыОтбораСкладБезЗаказа.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораСкладБезЗаказа.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораСкладБезЗаказа.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораСкладБезЗаказа.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		
		ПараметрыОтбораДляПоискаОстатков.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораДляПоискаОстатков.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораДляПоискаОстатков.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораДляПоискаОстатков.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		ПараметрыОтбораДляПоискаОстатков.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ЭтоДубльСтроки = СтрокаТабличнойЧасти.ЭтоДубльСтроки;
		ЕстьДубли = ?(Не ЕстьДубли, ЭтоДубльСтроки, ЕстьДубли);
	
		СтрокаТабличнойЧасти.МожноОтгрузить = 0;
		СтрокаТабличнойЧасти.Обеспечено = 0;
		СтрокаТабличнойЧасти.ВРезерве = 0;
		СтрокаТабличнойЧасти.Зарезервировано = 0;
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбораДляПоискаОстатков);
		СтрокаОстатка = ?(НайденныеСтрокиОстатки.Количество(), НайденныеСтрокиОстатки[0], Неопределено);
		
		Если СтрокаОстатка = Неопределено Тогда
			СтрокаТабличнойЧасти.ОстатокСвободно = 0;
			СтрокаТабличнойЧасти.КПоступлению = 0;
			СтрокаТабличнойЧасти.ОстатокОбщий = 0;
			СтрокаТабличнойЧасти.Размещено = 0;
			СтрокаТабличнойЧасти.СрокПополнения = 1;
			Продолжить
		КонецЕсли;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораБезСклада.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ОстатокСвободно = Окр(СтрокаОстатка.ОстатокТекСклад/КоэффициентЕдиницыИзмерения, 3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницах = ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбораСкладБезЗаказа, "Резервировать", НомерВариантаКП, , ИмяТЧ);
		ИтогПоЗначениюВРезерв = Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницах / КоэффициентЕдиницыИзмерения, 3);
		
		ЗарезервированоЗаказомСКоэффициентом =
			Окр(СтрокаОстатка.ЗарезервированоЗаказом / КоэффициентЕдиницыИзмерения, 3);
		
		СтрокаТабличнойЧасти.ОстатокСвободно =
			(ОстатокСвободно +  ЗарезервированоЗаказомСКоэффициентом - ИтогПоЗначениюВРезерв);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам = ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбораБезСклада, "Резервировать", НомерВариантаКП, , ИмяТЧ);
		ИтогПоЗначениюВРезервПоВсемСкладам =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам/КоэффициентЕдиницыИзмерения, 3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад = ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбора, "Резервировать", НомерВариантаКП, , ИмяТЧ);
		ИтогПоЗначениюВРезервТекСклад =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад/КоэффициентЕдиницыИзмерения, 3);
		
		РезервНаСкладахСКоэффициентом = Окр(СтрокаОстатка.РезервНаСкладах / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.ВРезерве = РезервНаСкладахСКоэффициентом + ИтогПоЗначениюВРезервПоВсемСкладам;
		
		РезервТекСкладСКоэффициентом = Окр(СтрокаОстатка.РезервТекСклад / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.Зарезервировано = РезервТекСкладСКоэффициентом + ИтогПоЗначениюВРезервТекСклад;
		
		ЗаказаноБезРезерваСКоэффициентом = Окр(СтрокаОстатка.ЗаказаноБезРезерва/КоэффициентЕдиницыИзмерения, 3);
		ОстатокОбщийСКоэффициентом = Окр(СтрокаОстатка.ОстатокОбщий / КоэффициентЕдиницыИзмерения, 3);
		
		СтрокаТабличнойЧасти.КПоступлению = ЗаказаноБезРезерваСКоэффициентом;
		
		ЗарезервированоЗаказомСКоэффициентомВсеСклады =
			Окр(СтрокаОстатка.ЗарезервированоЗаказомВсеСклады / КоэффициентЕдиницыИзмерения, 3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам = ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбораБезСкладаБезЗаказа, "Резервировать", НомерВариантаКП, , ИмяТЧ);
		ИтогПоЗначениюВРезервПоВсемСкладам =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам / КоэффициентЕдиницыИзмерения, 3);
		
		Если Не ОбъектПроведен Тогда
			СтрокаТабличнойЧасти.ОстатокОбщий = ОстатокОбщийСКоэффициентом - ИтогПоЗначениюВРезервПоВсемСкладам;
		Иначе
			СтрокаТабличнойЧасти.ОстатокОбщий = ОстатокОбщийСКоэффициентом - ИтогПоЗначениюВРезервПоВсемСкладам
				+ ЗарезервированоЗаказомСКоэффициентомВсеСклады;
		КонецЕсли;
		
		Если РезервированиеЗапасов Тогда
			
			Если ОбъектПроведен Тогда
				
				СтрокаТабличнойЧасти.Размещено = СтрокаОстатка.РезервЗаказано;
				
				Если Не СтрокаТабличнойЧасти.НеОтгружено = 0 Тогда
					СтрокаТабличнойЧасти.Обеспечено = СтрокаТабличнойЧасти.ВРезерве + СтрокаТабличнойЧасти.Размещено;
				КонецЕсли;
				
			Иначе
				
				СуммаПоСтрокамРезерв = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбораБезСклада,
					"Резервировать", НомерВариантаКП,,ИмяТЧ);
				СуммаПоСтрокамСТекКоэффициентомРезерв = СуммаПоСтрокамРезерв / КоэффициентЕдиницыИзмерения;
				СтрокаТабличнойЧасти.Обеспечено = СуммаПоСтрокамСТекКоэффициентомРезерв;
				
			КонецЕсли;
			
			Если Не ЭтоДубльСтроки Тогда
				РазностьСколькоНужноИСколькоЕсть =
					(СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.ВРезерве)
					- СтрокаТабличнойЧасти.НеОтгружено;
				МожноОтгрузитьВсего = ?(РазностьСколькоНужноИСколькоЕсть > 0, СтрокаТабличнойЧасти.НеОтгружено,
					СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.ВРезерве);
				СтрокаТабличнойЧасти.МожноОтгрузить = МожноОтгрузитьВсего;
			КонецЕсли
			
		Иначе
			
			Если Не ЭтоДубльСтроки Тогда
				РазностьСколькоНужноИСколькоЕсть = СтрокаТабличнойЧасти.ОстатокСвободно
					- СтрокаТабличнойЧасти.НеОтгружено;
				МожноОтгрузитьВсего = ?(РазностьСколькоНужноИСколькоЕсть > 0, СтрокаТабличнойЧасти.НеОтгружено,
					СтрокаТабличнойЧасти.ОстатокСвободно);
				СтрокаТабличнойЧасти.МожноОтгрузить = МожноОтгрузитьВсего;
			КонецЕсли
			
		КонецЕсли;
		
		Если Не ЭтоДубльСтроки 
			И Не СтрокаТабличнойЧасти.НеОтгружено = 0 
			И СтрокаТабличнойЧасти.МожноОтгрузить > 0 Тогда
			СуммаОстаткаИРезерва = СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.Зарезервировано;
			СтрокаТабличнойЧасти.ИндексЦвета = ?(СуммаОстаткаИРезерва < СтрокаТабличнойЧасти.НеОтгружено, 1, 0);
		КонецЕсли;
		
		Если СтрокаОстатка.КоличествоДокументовЗаказано > 1 Тогда
			
			РасшифровкаСчетчика = ПредметИсчисления(
			СтрокаОстатка.КоличествоДокументовЗаказано,
			НСтр("ru = 'документ'"),
			НСтр("ru = 'документа'"),
			НСтр("ru = 'документов'"),
			"м");
			
			СтрокаТабличнойЧасти.ДатаПоступления = Строка(СтрокаОстатка.КоличествоДокументовЗаказано)
				+ РасшифровкаСчетчика;
		Иначе
			СтрокаТабличнойЧасти.ДатаПоступления = ?(Не ЗначениеЗаполнено(СтрокаОстатка.ДатаПоступления), "",
				СтрокаОстатка.ДатаПоступления);
		КонецЕсли;
		
	КонецЦикла;
	
	// Дополним информацию по дублям строк
	Если Не ЕстьДубли Тогда
		Возврат
	КонецЕсли;

	ПараметрыОтбораДляДублей = Новый Структура("ЭтоДубльСтроки",  Истина);


	СтрокиДляОбхода = Объект.Запасы.НайтиСтроки(ПараметрыОтбораДляДублей);
	ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляОбхода,
		"Номенклатура, Характеристика, Партия, ОстатокСвободно, Зарезервировано, ВРезерве, СтруктурнаяЕдиница, ЗаказПокупателя");
	ТаблицаНоменклатуры.Свернуть(
		"Номенклатура, Характеристика, Партия, ОстатокСвободно, Зарезервировано, ВРезерве, СтруктурнаяЕдиница, ЗаказПокупателя");
	
	ТаблицаОбхода = ТаблицаНоменклатуры.Скопировать(, "Номенклатура, Характеристика, Партия, ЗаказПокупателя");
	ТаблицаОбхода.Свернуть("Номенклатура, Характеристика, Партия, ЗаказПокупателя");
	
	Для Каждого СтрокаИзДублейСтрок Из ТаблицаОбхода Цикл
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаИзДублейСтрок.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаИзДублейСтрок.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаИзДублейСтрок.Партия;
		ПараметрыОтбораБезСклада.ЗаказПокупателя = СтрокаИзДублейСтрок.ЗаказПокупателя;
		
		СтрокиДляОбхода = Объект.Запасы.НайтиСтроки(ПараметрыОтбораБезСклада);
		
		ИндексЦвета = 0;
		
		Для Каждого СтрокаТабличнойЧасти Из СтрокиДляОбхода Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
				Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
				Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
				КоэффициентЕдиницыИзмерения = 1;
			Иначе
				КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			
			// Колонка Можно отгрузить
			ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах = ПолучитьСуммуПоТабличнойЧасти(
				Объект, ПараметрыОтбораБезСклада, "НеОтгружено", НомерВариантаКП,,ИмяТЧ);
			ИтогПоЗначениюНеОтгружено =
				Окр(ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах / КоэффициентЕдиницыИзмерения, 3);
			
			СтрокиДляВыгрузки = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбораБезСклада);
			ТаблицаДляИтоговПоСкладу = ТаблицаНоменклатуры.Скопировать(СтрокиДляВыгрузки,
				"Номенклатура, Характеристика, Партия, ОстатокСвободно");
			
			СвободноДляРезерва = ТаблицаДляИтоговПоСкладу.Итог("ОстатокСвободно");
			
			ДоступноКОтгрузке = СвободноДляРезерва + СтрокаТабличнойЧасти.ВРезерве;
			
			СтрокаТабличнойЧасти.МожноОтгрузить =
				?(ИтогПоЗначениюНеОтгружено < ДоступноКОтгрузке, ИтогПоЗначениюНеОтгружено, ДоступноКОтгрузке);
			
			// Цвет значения колонки
			Если Не СтрокаТабличнойЧасти.НеОтгружено = 0 
				И СтрокаТабличнойЧасти.МожноОтгрузить > 0 Тогда
				
				ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
				ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
				ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
				ПараметрыОтбора.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
				ПараметрыОтбора.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
				
				ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
					"НеОтгружено", НомерВариантаКП, , ИмяТЧ);
				ИтогПоЗначениюНеОтгружено =
					Окр(ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах/КоэффициентЕдиницыИзмерения, 2);
				
				ДоступноКОтгрузке = СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.Зарезервировано;
				
				Если ИтогПоЗначениюНеОтгружено > ДоступноКОтгрузке Тогда
					ИндексЦвета = 1;
				Иначе
					СтрокаТабличнойЧасти.ИндексЦвета = 0;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИндексЦвета = 0 Тогда Продолжить КонецЕсли;
		
		Для Каждого СтрокаТабличнойЧасти Из СтрокиДляОбхода Цикл
			СтрокаТабличнойЧасти.ИндексЦвета = ИндексЦвета;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонки табличной части документа Заказ на перемещение значениями по остаткам и резервам
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура 
//  СтруктураДанные - Структура - Дополнительные параметры
Процедура ЗаполнитьНачальныеДанныеДляОбработкиТабличнойЧастиЗаказНаПеремещение(Объект, СтруктураДанные) Экспорт
	
	Если СтруктураДанные = Неопределено Тогда
		
		СтрокиДляВыгрузки = Неопределено;
		
		МассивНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,"Номенклатура");
		МассивХарактеристик = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,"Характеристика");
		МассивПартий = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,"Партия");
		
	Иначе
		
		Номенклатура = СтруктураДанные.Номенклатура;
		Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика)
		, СтруктураДанные.Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия),
			СтруктураДанные.Партия,
			Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия",
			Номенклатура, Характеристика, Партия);
		
		СтрокиДляВыгрузки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Характеристика);
		МассивПартий = Новый Массив;
		МассивПартий.Добавить(Партия);
		
	КонецЕсли;
	
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	Если Не СтрокиДляВыгрузки = Неопределено Тогда
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,
			"Номенклатура, Характеристика, Партия, Количество, ЕдиницаИзмерения, ЗаказПокупателя");
		СтрокиОбходаЗапасов = СтрокиДляВыгрузки;
	Иначе
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить( ,
			"Номенклатура, Характеристика, Партия, Количество, ЕдиницаИзмерения, ЗаказПокупателя");
		СтрокиОбходаЗапасов = Объект.Запасы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Характеристика", МассивХарактеристик);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Отправитель", Объект.СтруктурнаяЕдиницаРезерв);
	Запрос.УстановитьПараметр("Получатель", Объект.СтруктурнаяЕдиницаПолучатель);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("УчетПотребностиПоСкладам", ПолучитьФункциональнуюОпцию("УчетПотребностиПоСкладам"));
	
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(Объект.СтруктурнаяЕдиницаРезерв);
	МассивСкладов.Добавить(Объект.СтруктурнаяЕдиницаПолучатель);
	
	Запрос.УстановитьПараметр("СтруктурныеЕдиницы", МассивСкладов);
	
	Запрос.Текст = ТекстЗапросаОстаткиИРезервыЗаказНаПеремещение();
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	РассчитатьКоличествоПоСтрокамСогласноКоэффициентам(ТаблицаНоменклатуры);
	
	ТаблицаНоменклатуры.Свернуть("Номенклатура, Характеристика, Партия, ЗаказПокупателя", "Количество");
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	ПараметрыОтбора.Вставить("Партия");
	ПараметрыОтбора.Вставить("ЗаказПокупателя");
	
	ЕстьДубли = Ложь;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ЭтоДубльСтроки = СтрокаТабличнойЧасти.ЭтоДубльСтроки;
		ЕстьДубли = ?(Не ЕстьДубли, ЭтоДубльСтроки, ЕстьДубли);
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
		СтрокаОстатка = ?(НайденныеСтрокиОстатки.Количество(), НайденныеСтрокиОстатки[0], Неопределено);
		
		Если СтрокаОстатка = Неопределено Тогда
			СтрокаТабличнойЧасти.НеОтгружено = 0;
			СтрокаТабличнойЧасти.СвободноОтправитель = 0;
			СтрокаТабличнойЧасти.ОстатокОбщий = 0;
			СтрокаТабличнойЧасти.СвободноПолучатель = 0;
			СтрокаТабличнойЧасти.КПоступлению = 0;
			СтрокаТабличнойЧасти.МаксимальныйОстаток = 0;
			СтрокаТабличнойЧасти.МинимальныйОстаток = 0;
			Продолжить
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СвободноОтправитель = Окр(
			СтрокаОстатка.СвободноОтправитель / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.СвободноПолучатель = Окр(
			СтрокаОстатка.СвободноПолучатель / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.ОстатокОбщий = Окр(
			СтрокаОстатка.ОстатокВсего / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.МаксимальныйОстаток = Окр(
			СтрокаОстатка.МаксимальныйОстаток / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.МинимальныйОстаток = Окр(
			СтрокаОстатка.МинимальныйОстаток / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.НеОтгружено = Окр(СтрокаОстатка.НеОтгружено / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.Заказано = Окр(СтрокаОстатка.Заказано / КоэффициентЕдиницыИзмерения, 3);
		
		Если СтрокаОстатка.КоличествоДокументов > 1 Тогда
			
			РасшифровкаСчетчика = ПредметИсчисления(
				СтрокаОстатка.КоличествоДокументов,
				НСтр("ru = 'документ'"),
				НСтр("ru = 'документа'"),
				НСтр("ru = 'документов'"),
				"м");
			
			СтрокаТабличнойЧасти.ДатаПоступления = Строка(СтрокаОстатка.КоличествоДокументов) + РасшифровкаСчетчика;
		
		Иначе
			СтрокаТабличнойЧасти.ДатаПоступления = ?(Не ЗначениеЗаполнено(СтрокаОстатка.ДатаПоступления), "",
				СтрокаОстатка.ДатаПоступления);
		КонецЕсли;
		
		СтрокаТабличнойЧасти.КПоступлению = Окр(СтрокаОстатка.КПоступлению/КоэффициентЕдиницыИзмерения, 3);
		
	КонецЦикла;
	
	
КонецПроцедуры

// Заполняет колонки табличной части документа Заказ покупателя значениями по остаткам и резервам
// 
// Параметры:
//  Объект - ДанныеФормыструктура - Объект формы
//  СтруктураДанные - Структура, Неопределено - Структура данные
//  НомерВариантаКП - Число - Номер варианта КП
//  НоменклатураОтбора - СправочникСсылка.Номенклатура, Неопределено - Номенклатура отбора
//  РезервированиеЗапасов - Булево - Резервирование запасов
//  ИмяТЧ - Строка - Имя ТЧ
//@skip-check method-too-many-params
Процедура ЗаполнитьЗначенияРезервовИОстатокНоменклатурыВТабличнойЧасти(Объект, СтруктураДанные = Неопределено,
	НомерВариантаКП = 0, НоменклатураОтбора = Неопределено, РезервированиеЗапасов = Ложь, ИмяТЧ = "Запасы") Экспорт
	
	Если Не Объект[ИмяТЧ].Количество() Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если СтруктураДанные = Неопределено Тогда
		
		Если ИмяТЧ = "Запасы" Тогда
			Если Не ЗначениеЗаполнено(НоменклатураОтбора) Тогда
				ПараметрыОтбора = Новый Структура("НомерВариантаКП", НомерВариантаКП);
			Иначе
				ПараметрыОтбора = Новый Структура("НомерВариантаКП, Номенклатура", НомерВариантаКП,
					НоменклатураОтбора);
			КонецЕсли;
			СтрокиДляВыгрузки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
			МассивНоменклатуры = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки,"Номенклатура");
			МассивХарактеристик = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки,"Характеристика");
			МассивПартий = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки,"Партия");
		Иначе
			СтрокиДляВыгрузки = Неопределено;
			МассивНоменклатуры = Объект[ИмяТЧ].Выгрузить(,"Номенклатура");
			МассивХарактеристик = Объект[ИмяТЧ].Выгрузить(,"Характеристика");
			МассивПартий = Объект[ИмяТЧ].Выгрузить(,"Партия");
		КонецЕсли;
		
	Иначе
		
		Номенклатура = СтруктураДанные.Номенклатура;
		Характеристика =
			?(СтруктураДанные.ИспользоватьХарактеристики И ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Партия = ?(СтруктураДанные.ИспользоватьПартии,
			СтруктураДанные.Партия, Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия",
			Номенклатура, Характеристика, Партия);
			
		Если ИмяТЧ = "Запасы" Тогда
			ПараметрыОтбора.Вставить("НомерВариантаКП", НомерВариантаКП);
		КонецЕсли;
	
		СтрокиДляВыгрузки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Характеристика);
		МассивПартий = Новый Массив;
		МассивПартий.Добавить(Партия);
		
	КонецЕсли;
	
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	Если Не СтрокиДляВыгрузки = Неопределено Тогда
		ТаблицаНоменклатуры = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки,
			"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв, Количество, ЕдиницаИзмерения");
		СтрокиОбходаЗапасов = СтрокиДляВыгрузки;
	Иначе
		ТаблицаНоменклатуры = Объект[ИмяТЧ].Выгрузить( ,
			"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв, Количество, ЕдиницаИзмерения");
		СтрокиОбходаЗапасов = Объект[ИмяТЧ];
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура",        МассивНоменклатуры);
	Запрос.УстановитьПараметр("Характеристика",      МассивХарактеристик);
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ЗаказПокупателя",     Объект.Ссылка);
	
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Запрос.УстановитьПараметр("ОрганизацииПередачи", ИнтеркампаниСервер.ОрганизацииОстатков(Организация));
	Иначе
		Запрос.УстановитьПараметр("ОрганизацииПередачи",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаОстаткиИРезервы();
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	РассчитатьКоличествоПоСтрокамСогласноКоэффициентам(ТаблицаНоменклатуры);
	
	ТаблицаНоменклатуры.Свернуть("Номенклатура, Характеристика, Партия", "Количество");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	ПараметрыОтбора.Вставить("Партия");
	ПараметрыОтбора.Вставить("СтруктурнаяЕдиницаРезерв");
	
	ПараметрыОтбораБезСклада = Новый Структура();
	ПараметрыОтбораБезСклада.Вставить("Номенклатура");
	ПараметрыОтбораБезСклада.Вставить("Характеристика");
	ПараметрыОтбораБезСклада.Вставить("Партия");

	НомерСтроки = 0;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ОбъектПроведен = РаботаСЗаявкамиКлиентСервер.ЗаказПроведен(Объект);
	Иначе
		ОбъектПроведен = Объект.Проведен;
	КонецЕсли;
	
	ЕстьДубли = Ложь;
	
	СтруктураПараметровОтбора = Новый Структура("ССкладом, БезСклада", ПараметрыОтбора, ПараметрыОтбораБезСклада);
	ЗаполнитьНачальныеДанныеДляОбработкиТабличнойЧасти(Объект, СтрокиОбходаЗапасов, ТаблицаНоменклатуры,
		СтруктураПараметровОтбора);
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.СтруктурнаяЕдиницаРезерв = СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв;
		
		ЭтоДубльСтроки = СтрокаТабличнойЧасти.ЭтоДубльСтроки;
		ЕстьДубли = ?(Не ЕстьДубли, ЭтоДубльСтроки, ЕстьДубли);
	
		СтрокаТабличнойЧасти.МожноОтгрузить = 0;
		СтрокаТабличнойЧасти.Обеспечено = 0;
		СтрокаТабличнойЧасти.ВРезерве = 0;
		СтрокаТабличнойЧасти.Зарезервировано = 0;
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
		СтрокаОстатка = ?(НайденныеСтрокиОстатки.Количество(), НайденныеСтрокиОстатки[0], Неопределено);
		
		Если СтрокаОстатка = Неопределено Тогда
			СтрокаТабличнойЧасти.ОстатокСвободно = 0;
			СтрокаТабличнойЧасти.КПоступлению = 0;
			СтрокаТабличнойЧасти.ОстатокОбщий = 0;
			СтрокаТабличнойЧасти.Размещено = 0;
			СтрокаТабличнойЧасти.СрокПополнения = 1;
			Продолжить
		КонецЕсли;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		
		ОстатокСвободно = Окр(СтрокаОстатка.ОстатокТекСклад/КоэффициентЕдиницыИзмерения,3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницах = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
			"Резервировать", НомерВариантаКП, ,ИмяТЧ);
		ИтогПоЗначениюВРезерв = Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницах / КоэффициентЕдиницыИзмерения, 3);
		
		ЗарезервированоЗаказомСКоэффициентом =
		Окр(СтрокаОстатка.ЗарезервированоЗаказом / КоэффициентЕдиницыИзмерения, 3);
		
		СтрокаТабличнойЧасти.ОстатокСвободно =
			(ОстатокСвободно +  ЗарезервированоЗаказомСКоэффициентом - ИтогПоЗначениюВРезерв);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам = ПолучитьСуммуПоТабличнойЧасти(
			Объект, ПараметрыОтбораБезСклада, "Резервировать", НомерВариантаКП, , ИмяТЧ);
		ИтогПоЗначениюВРезервПоВсемСкладам =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам / КоэффициентЕдиницыИзмерения, 3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад = ПолучитьСуммуПоТабличнойЧасти(
			Объект, ПараметрыОтбора, "Резервировать", НомерВариантаКП, , ИмяТЧ);
		ИтогПоЗначениюВРезервТекСклад =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад / КоэффициентЕдиницыИзмерения, 3);
		
		РезервНаСкладахСКоэффициентом = Окр(СтрокаОстатка.РезервНаСкладах / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.ВРезерве = РезервНаСкладахСКоэффициентом + ИтогПоЗначениюВРезервПоВсемСкладам;
		
		РезервТекСкладСКоэффициентом = Окр(СтрокаОстатка.РезервТекСклад / КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.Зарезервировано = РезервТекСкладСКоэффициентом + ИтогПоЗначениюВРезервТекСклад;
		
		ЗаказаноБезРезерваСКоэффициентом = Окр(СтрокаОстатка.ЗаказаноБезРезерва / КоэффициентЕдиницыИзмерения, 3);
		ОстатокОбщийСКоэффициентом = Окр(СтрокаОстатка.ОстатокОбщий / КоэффициентЕдиницыИзмерения, 3);
		
		СтрокаТабличнойЧасти.КПоступлению = ЗаказаноБезРезерваСКоэффициентом;
		
		ЗарезервированоЗаказомСКоэффициентомВсеСклады =
			Окр(СтрокаОстатка.ЗарезервированоЗаказомВсеСклады / КоэффициентЕдиницыИзмерения, 3);
		
		Если Не ОбъектПроведен Тогда
			СтрокаТабличнойЧасти.ОстатокОбщий = ОстатокОбщийСКоэффициентом - ИтогПоЗначениюВРезервПоВсемСкладам;
		Иначе
			СтрокаТабличнойЧасти.ОстатокОбщий = ОстатокОбщийСКоэффициентом - ИтогПоЗначениюВРезервПоВсемСкладам
				+ ЗарезервированоЗаказомСКоэффициентомВсеСклады;
		КонецЕсли;
		
		Если РезервированиеЗапасов Тогда
			
			Если ОбъектПроведен Тогда
				
				СтрокаТабличнойЧасти.Размещено = СтрокаОстатка.РезервЗаказано;
				
				Если Не СтрокаТабличнойЧасти.НеОтгружено = 0 Тогда
					СтрокаТабличнойЧасти.Обеспечено = СтрокаТабличнойЧасти.ВРезерве
						+ СтрокаТабличнойЧасти.Размещено;
				КонецЕсли;
			Иначе
				
				СуммаПоСтрокамРезерв = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбораБезСклада,
					"Резервировать", НомерВариантаКП,,ИмяТЧ);
				СуммаПоСтрокамСТекКоэффициентомРезерв = СуммаПоСтрокамРезерв / КоэффициентЕдиницыИзмерения;
				СтрокаТабличнойЧасти.Обеспечено = СуммаПоСтрокамСТекКоэффициентомРезерв;
				
			КонецЕсли;
			
			Если Не ЭтоДубльСтроки Тогда
				РазностьСколькоНужноИСколькоЕсть = (СтрокаТабличнойЧасти.ОстатокСвободно
					+ СтрокаТабличнойЧасти.ВРезерве) - СтрокаТабличнойЧасти.НеОтгружено;
				МожноОтгрузитьВсего = ?(РазностьСколькоНужноИСколькоЕсть > 0, СтрокаТабличнойЧасти.НеОтгружено,
					СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.ВРезерве);
				СтрокаТабличнойЧасти.МожноОтгрузить = МожноОтгрузитьВсего;
			КонецЕсли
			
		Иначе
			
			Если Не ЭтоДубльСтроки Тогда
				РазностьСколькоНужноИСколькоЕсть = СтрокаТабличнойЧасти.ОстатокСвободно
					- СтрокаТабличнойЧасти.НеОтгружено;
				МожноОтгрузитьВсего = ?(РазностьСколькоНужноИСколькоЕсть > 0, СтрокаТабличнойЧасти.НеОтгружено,
					СтрокаТабличнойЧасти.ОстатокСвободно);
				СтрокаТабличнойЧасти.МожноОтгрузить = МожноОтгрузитьВсего;
			КонецЕсли
			
		КонецЕсли;
		
		Если Не ЭтоДубльСтроки 
			И Не СтрокаТабличнойЧасти.НеОтгружено = 0 
			И СтрокаТабличнойЧасти.МожноОтгрузить > 0 Тогда
			СуммаОстаткаИРезерва = СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.Зарезервировано;
			СтрокаТабличнойЧасти.ИндексЦвета = ?(СуммаОстаткаИРезерва < СтрокаТабличнойЧасти.НеОтгружено, 1,0);
		КонецЕсли;
		
		Если СтрокаОстатка.КоличествоДокументовЗаказано > 1 Тогда
			
			РасшифровкаСчетчика = ПредметИсчисления(
			СтрокаОстатка.КоличествоДокументовЗаказано,
				НСтр("ru = 'документ'"),
				НСтр("ru = 'документа'"),
				НСтр("ru = 'документов'"),
				"м");
			
			СтрокаТабличнойЧасти.ДатаПоступления = Строка(СтрокаОстатка.КоличествоДокументовЗаказано)
				+ РасшифровкаСчетчика;
		Иначе
			СтрокаТабличнойЧасти.ДатаПоступления = ?(Не ЗначениеЗаполнено(СтрокаОстатка.ДатаПоступления), "",
				СтрокаОстатка.ДатаПоступления);
		КонецЕсли;
		
	КонецЦикла;
	
	// Дополним информацию по дублям строк
	Если Не ЕстьДубли Тогда Возврат КонецЕсли;

	Если ИмяТЧ = "Запасы" Тогда
		ПараметрыОтбораДляДублей = Новый Структура("НомерВариантаКП, ЭтоДубльСтроки", НомерВариантаКП, Истина);
	Иначе
		ПараметрыОтбораДляДублей = Новый Структура("ЭтоДубльСтроки",  Истина);
	КонецЕсли;

	СтрокиДляОбхода = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбораДляДублей);
	ТаблицаНоменклатуры = Объект[ИмяТЧ].Выгрузить(СтрокиДляОбхода,
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв, ОстатокСвободно, Зарезервировано, ВРезерве");
	ТаблицаНоменклатуры.Свернуть(
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв, ОстатокСвободно, Зарезервировано, ВРезерве");
	
	ТаблицаОбхода = ТаблицаНоменклатуры.Скопировать(, "Номенклатура, Характеристика, Партия");
	ТаблицаОбхода.Свернуть("Номенклатура, Характеристика, Партия");
	
	Для Каждого СтрокаИзДублейСтрок Из ТаблицаОбхода Цикл
		
		ПараметрыОтбораБезСклада.Номенклатура   = СтрокаИзДублейСтрок.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаИзДублейСтрок.Характеристика;
		ПараметрыОтбораБезСклада.Партия         = СтрокаИзДублейСтрок.Партия;
		
		СтрокиДляОбхода = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбораБезСклада);
		
		ИндексЦвета = 0;
		
		Для Каждого СтрокаТабличнойЧасти Из СтрокиДляОбхода Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
				Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда
					Продолжить 
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
				Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
				КоэффициентЕдиницыИзмерения = 1;
			Иначе
				КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			
			// Колонка Можно отгрузить
			ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах = ПолучитьСуммуПоТабличнойЧасти(Объект,
				ПараметрыОтбораБезСклада, "НеОтгружено", НомерВариантаКП, , ИмяТЧ);
			ИтогПоЗначениюНеОтгружено =
				Окр(ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах/КоэффициентЕдиницыИзмерения, 3);
			
			СтрокиДляВыгрузки = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбораБезСклада);
			ТаблицаДляИтоговПоСкладу = ТаблицаНоменклатуры.Скопировать(СтрокиДляВыгрузки,
				"Номенклатура, Характеристика, Партия, ОстатокСвободно");
			
			СвободноДляРезерва = ТаблицаДляИтоговПоСкладу.Итог("ОстатокСвободно");
			
			ДоступноКОтгрузке = СвободноДляРезерва + СтрокаТабличнойЧасти.ВРезерве;
			
			СтрокаТабличнойЧасти.МожноОтгрузить = ?(ИтогПоЗначениюНеОтгружено < ДоступноКОтгрузке,
				ИтогПоЗначениюНеОтгружено, ДоступноКОтгрузке);
			
			// Цвет значения колонки
			Если Не СтрокаТабличнойЧасти.НеОтгружено = 0 
				И СтрокаТабличнойЧасти.МожноОтгрузить > 0 Тогда
				
				ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
				ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
				ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
				ПараметрыОтбора.СтруктурнаяЕдиницаРезерв = СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв;
				
				ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
					"НеОтгружено", НомерВариантаКП, , ИмяТЧ);
				ИтогПоЗначениюНеОтгружено =
					Окр(ИтогПоЗначениюНеОтгруженоВБазовыхЕдиницах / КоэффициентЕдиницыИзмерения, 3);
				
				ДоступноКОтгрузке = СтрокаТабличнойЧасти.ОстатокСвободно + СтрокаТабличнойЧасти.Зарезервировано;
				
				Если ИтогПоЗначениюНеОтгружено > ДоступноКОтгрузке Тогда
					ИндексЦвета = 1;
				Иначе
					СтрокаТабличнойЧасти.ИндексЦвета = 0;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИндексЦвета = 0 Тогда Продолжить КонецЕсли;
		
		Для Каждого СтрокаТабличнойЧасти Из СтрокиДляОбхода Цикл
			СтрокаТабличнойЧасти.ИндексЦвета = ИндексЦвета;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонки табличной части документа Расходная накладная, Производство, Заказ-Наряд (в стадии выполнения)
// значениями по остаткам
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  СтруктураДанные - Структура
//  				- Неопределено
//  НоменклатураОтбора 	- СправочникСсылка.Номенклатура, Неопределено - Номенклатура для отбора
//  ИмяТЧ - Строка - Имя табличной части
//  ТипДокумента - Строка, Неопределено - Тип документа
//@skip-check method-too-many-params
Процедура ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧасти(Объект, СтруктураДанные = Неопределено, 
	НоменклатураОтбора = Неопределено, ИмяТЧ = "Запасы", ТипДокумента = Неопределено) Экспорт
	
	ИмяКолонкиЗаказ = ?(ТипДокумента = "Производство", "ЗаказПокупателя", "Заказ");
	
	Если ТипДокумента = "ЗаказНаряд" Тогда
		ИмяСклада = "СтруктурнаяЕдиницаРезерв";
		КолонкиДляВыгрузки = "Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Ячейка, ЯчейкаДоступна,"
			+ ИмяСклада;
	Иначе
		ИмяСклада = "СтруктурнаяЕдиница";
		КолонкиДляВыгрузки = "Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Ячейка, ЯчейкаДоступна,"
			+ ИмяСклада + ", " + ИмяКолонкиЗаказ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если СтруктураДанные = Неопределено Тогда
		
		ТаблицаНоменклатуры = Объект[ИмяТЧ].Выгрузить(,КолонкиДляВыгрузки);
		
		МассивНоменклатуры = Объект[ИмяТЧ].Выгрузить(, "Номенклатура");
		МассивХарактеристик = Объект[ИмяТЧ].Выгрузить(, "Характеристика");
		
		СтрокиДляВыгрузки = Объект[ИмяТЧ];
	Иначе
		Номенклатура = СтруктураДанные.Номенклатура;
		Характеристика = 
			?(СтруктураДанные.ИспользоватьХарактеристики И ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика,
				Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Партия = ?(СтруктураДанные.ИспользоватьПартии, СтруктураДанные.Партия,
			Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		Если ЗначениеЗаполнено(НоменклатураОтбора) Тогда
			ПараметрыОтбора = Новый Структура(" Номенклатура", НоменклатураОтбора);
		Иначе
			ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия",
				Номенклатура, Характеристика, Партия);
		КонецЕсли;
		
		СтрокиДляВыгрузки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
		ТаблицаНоменклатуры = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки, КолонкиДляВыгрузки);
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Характеристика);
	КонецЕсли;
	
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	СтрокиОбходаЗапасов = СтрокиДляВыгрузки;
	
	МассивЗаказов = Новый Массив;
	
	Если ТипДокумента = "ЗаказНаряд" Тогда
		
		МассивЗаказов.Добавить(Объект.Ссылка);
		
		КолонкаСклад = ТаблицаНоменклатуры.Колонки.Найти("СтруктурнаяЕдиницаРезерв");
		КолонкаСклад.Имя = "СтруктурнаяЕдиница";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		
		ТаблицаНоменклатуры.Колонки.Добавить("Заказ",ОписаниеТипов);
		
		Для Каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СтрокаТаблицы.Заказ = Объект.Ссылка;
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.СтруктурнаяЕдиница) Тогда
				СтрокаТаблицы.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиницаПродажи;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Если ТипДокумента = "Производство" Тогда
			КолонкаЗаказ = ТаблицаНоменклатуры.Колонки.Найти("ЗаказПокупателя");
			КолонкаЗаказ.Имя = "Заказ";
		КонецЕсли;
		
		Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти[ИмяКолонкиЗаказ]) Тогда
				МассивЗаказов.Добавить(СтрокаТабличнойЧасти[ИмяКолонкиЗаказ]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ТаблицаНоменклатуры.Колонки.Найти("ЯчейкаДоступна") = Неопределено
		И Не ТаблицаНоменклатуры.Колонки.Найти("СтруктурнаяЕдиница") = Неопределено Тогда
		
		СкладыСДоступнымиЯчейками = МассивСкладовСДоступнымиЯчейками();
		
		Если СкладыСДоступнымиЯчейками.Количество() Тогда
			
			Для Каждого СтрокаТаблицыНоменклатура Из ТаблицаНоменклатуры Цикл
				Если Не СкладыСДоступнымиЯчейками.Найти(СтрокаТаблицыНоменклатура.СтруктурнаяЕдиница) = Неопределено Тогда
					СтрокаТаблицыНоменклатура.ЯчейкаДоступна = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Характеристика", МассивХарактеристик);
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Запрос.УстановитьПараметр("ОрганизацииПередачи", ИнтеркампаниСервер.ОрганизацииОстатков(Организация));	
	Иначе
		Запрос.УстановитьПараметр("ОрганизацииПередачи",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	КонецЕсли;
	
	Запрос.Текст = ?(ТипДокумента = "ЗаказНаряд", ТекстЗапросаОстаткиИРезервыЗаказНаряд(),
		ТекстЗапросаОстаткиИРезервыРасходнаяНакладная());
		
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	ПараметрыОтбора.Вставить("Партия");
	ПараметрыОтбора.Вставить("СтруктурнаяЕдиница");
	ПараметрыОтбора.Вставить("Заказ");
	ПараметрыОтбора.Вставить("Ячейка");

	ПараметрыОтбораБезСкладаБезЗаказа = Новый Структура("Номенклатура, Характеристика, Партия");
	
	ПараметрыОтбораСкладИЯчейка = Новый Структура;
	ПараметрыОтбораСкладИЯчейка.Вставить("Номенклатура");
	ПараметрыОтбораСкладИЯчейка.Вставить("Характеристика");
	ПараметрыОтбораСкладИЯчейка.Вставить("Партия");
	ПараметрыОтбораСкладИЯчейка.Вставить("Ячейка");
	Если Не ПустаяСтрока(ИмяСклада) Тогда
		ПараметрыОтбораСкладИЯчейка.Вставить(ИмяСклада);
	КонецЕсли;

	ПараметрыОтбораСклад = Новый Структура;
	ПараметрыОтбораСклад.Вставить("Номенклатура");
	ПараметрыОтбораСклад.Вставить("Характеристика");
	ПараметрыОтбораСклад.Вставить("Партия");
	ПараметрыОтбораСклад.Вставить("СтруктурнаяЕдиница");
	
	ПараметрыОтбораСкладПоТЧДокумента = Новый Структура;
	ПараметрыОтбораСкладПоТЧДокумента.Вставить("Номенклатура");
	ПараметрыОтбораСкладПоТЧДокумента.Вставить("Характеристика");
	ПараметрыОтбораСкладПоТЧДокумента.Вставить("Партия");
	Если Не ПустаяСтрока(ИмяСклада) Тогда
		ПараметрыОтбораСкладПоТЧДокумента.Вставить(ИмяСклада);
	КонецЕсли;
	
	Если ТипДокумента = "ЗаказНаряд" Тогда
		ПараметрыОтбораСкладЗаказБезЯчейки = Новый Структура("Номенклатура, Характеристика, Партия, " + ИмяСклада);
		ПараметрыОтбораБезСклада = Новый Структура("Номенклатура, Характеристика, Партия");
	Иначе
		ПараметрыОтбораСкладЗаказБезЯчейки = Новый Структура("Номенклатура, Характеристика, Партия,"
			+ ИмяКолонкиЗаказ + " ," + ИмяСклада);
		ПараметрыОтбораБезСклада = Новый Структура("Номенклатура, Характеристика, Партия," + ИмяКолонкиЗаказ);
	КонецЕсли;
	
	ОбщиеОстаткиПоНоменклатуреПоСкладам = ТаблицаОстатков.Скопировать(,
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, ОстатокТекСклад, КоличествоПроходов, КоличествоСтрок");
	ОбщиеОстаткиПоНоменклатуреПоСкладам.Свернуть(
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, ОстатокТекСклад, КоличествоПроходов, КоличествоСтрок");
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
			
		Заказ = ?(ТипДокумента = "ЗаказНаряд", Объект.Ссылка, СтрокаТабличнойЧасти[ИмяКолонкиЗаказ]);
			
		ПараметрыОтбораСклад.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораСклад.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораСклад.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораСклад.СтруктурнаяЕдиница = СтрокаТабличнойЧасти[ИмяСклада];
		
		ПараметрыОтбораСкладПоТЧДокумента.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораСкладПоТЧДокумента.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораСкладПоТЧДокумента.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораСкладПоТЧДокумента[ИмяСклада] = СтрокаТабличнойЧасти[ИмяСклада];
		
		ПараметрыОтбораБезСкладаБезЗаказа.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСкладаБезЗаказа.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСкладаБезЗаказа.Партия = СтрокаТабличнойЧасти.Партия;
		
		КоличествоСКоэффициентом = СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.СтруктурнаяЕдиница = СтрокаТабличнойЧасти[ИмяСклада];
		ПараметрыОтбора.Заказ = Заказ;
		ПараметрыОтбора.Ячейка = СтрокаТабличнойЧасти.Ячейка;
		
		ПараметрыОтбораСкладИЯчейка.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораСкладИЯчейка.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораСкладИЯчейка.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораСкладИЯчейка[ИмяСклада] = СтрокаТабличнойЧасти[ИмяСклада];
		ПараметрыОтбораСкладИЯчейка.Ячейка = СтрокаТабличнойЧасти.Ячейка;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		
		ПараметрыОтбораСкладЗаказБезЯчейки.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораСкладЗаказБезЯчейки.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораСкладЗаказБезЯчейки.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораСкладЗаказБезЯчейки[ИмяСклада] = СтрокаТабличнойЧасти[ИмяСклада];
		
		Если Не ТипДокумента = "ЗаказНаряд" Тогда
			ПараметрыОтбораБезСклада[ИмяКолонкиЗаказ] = Заказ;
			ПараметрыОтбораСкладЗаказБезЯчейки[ИмяКолонкиЗаказ] = Заказ;
		КонецЕсли;
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
	
		ЭтоПоследняяСтрокаПоНоменклатуреПоЯчейке = Ложь;
		
		Если НайденныеСтрокиОстатки.Количество() Тогда
			СтрокаОстатка = НайденныеСтрокиОстатки[0];
			Если СтрокаОстатка.КоличествоПроходов = 0 Тогда
				СтрокиПоНоменклатуре = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбораСкладИЯчейка);
				СтрокаОстатка.КоличествоСтрок = СтрокиПоНоменклатуре.Количество();
			КонецЕсли;
			СтрокаОстатка.КоличествоПроходов = СтрокаОстатка.КоличествоПроходов+1;
			ЭтоПоследняяСтрокаПоНоменклатуреПоЯчейке =
				?(СтрокаОстатка.КоличествоПроходов = СтрокаОстатка.КоличествоСтрок, Истина, Ложь);
		Иначе
			СтрокаОстатка = Неопределено
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ПредставлениеДублей = "";
		
		СуммаПоСтрокам = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбораБезСкладаБезЗаказа, "Количество",
			, , ИмяТЧ);
		СуммаПоСтрокамСТекКоэффициентом = СуммаПоСтрокам / КоэффициентЕдиницыИзмерения;
		
		Если КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")+ " / "
				+ Формат(СуммаПоСтрокам, "ЧДЦ=3");
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")+ " / "
				+ Формат(СуммаПоСтрокамСТекКоэффициентом, "ЧДЦ=3");
		КонецЕсли;
		
		СтрокаТабличнойЧасти.МожноОтгрузить  = 0;
		СтрокаТабличнойЧасти.ВРезерве        = 0;
		СтрокаТабличнойЧасти.НеХватает       = 0;
		СтрокаТабличнойЧасти.ОстатокВЯчейке  = 0;
		СтрокаТабличнойЧасти.ОстатокСвободно = 0;
		СтрокаТабличнойЧасти.ОстатокОбщий    = 0;
		
		Если СтрокаОстатка = Неопределено Тогда
			Продолжить
		КонецЕсли;
		
		СтрокиОстаткиНоменклатураСкладБезЯчейки =
			ОбщиеОстаткиПоНоменклатуреПоСкладам.НайтиСтроки(ПараметрыОтбораСклад);
		
		ЭтоПоследняяСтрокаПоНоменклатуре = Ложь;
		
		Если СтрокиОстаткиНоменклатураСкладБезЯчейки.Количество() Тогда
			СтрокаОстаткаВЦелом = СтрокиОстаткиНоменклатураСкладБезЯчейки[0];
			
			Если СтрокаОстаткаВЦелом.КоличествоПроходов = 0 Тогда
				СтрокиПоНоменклатуре = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбораСкладПоТЧДокумента);
				СтрокаОстаткаВЦелом.КоличествоСтрок = СтрокиПоНоменклатуре.Количество();
			КонецЕсли;
			
			СтрокаОстаткаВЦелом.КоличествоПроходов = СтрокаОстаткаВЦелом.КоличествоПроходов+1;
			ЭтоПоследняяСтрокаПоНоменклатуре =
				?(СтрокаОстаткаВЦелом.КоличествоПроходов = СтрокаОстаткаВЦелом.КоличествоСтрок, Истина, Ложь);
			
		Иначе
			СтрокаОстаткаВЦелом = Неопределено
		КонецЕсли;

		Если СтрокаОстаткаВЦелом = Неопределено Тогда 
			Продолжить
		КонецЕсли;
		
		ОстатокСвободно = Окр(СтрокаОстаткаВЦелом.ОстатокТекСклад/КоэффициентЕдиницыИзмерения, 3);
		ОстатокВЯчейке = Окр(СтрокаОстатка.ОстатокВЯчейке/КоэффициентЕдиницыИзмерения, 3);
		
		Если Не ЭтоПоследняяСтрокаПоНоменклатуреПоЯчейке Тогда
			Если СтрокаТабличнойЧасти.ЯчейкаДоступна Тогда
				ОстатокВЯчейке = ?(СтрокаТабличнойЧасти.Количество < ОстатокВЯчейке,
					СтрокаТабличнойЧасти.Количество, ОстатокВЯчейке);
				СтрокаТабличнойЧасти.ОстатокВЯчейке = ?(СтрокаТабличнойЧасти.ЯчейкаДоступна, ОстатокВЯчейке, 0);
				СтрокаОстатка.ОстатокВЯчейке = СтрокаОстатка.ОстатокВЯчейке
					- (СтрокаТабличнойЧасти.ОстатокВЯчейке*КоэффициентЕдиницыИзмерения);
			Иначе
				СтрокаОстатка.ОстатокВЯчейке = 0;
				СтрокаТабличнойЧасти.ОстатокВЯчейке = 0;
			КонецЕсли;
		Иначе
			СтрокаТабличнойЧасти.ОстатокВЯчейке = ?(СтрокаТабличнойЧасти.ЯчейкаДоступна, ОстатокВЯчейке, 0);
		КонецЕсли;
		
		Резерв = ?(ТипДокумента = "ЗаказНаряд", СтрокаТабличнойЧасти.РезервОтгрузка, СтрокаТабличнойЧасти.Резерв);
		
		Если Не ЭтоПоследняяСтрокаПоНоменклатуре Тогда
			
			Если СтрокаТабличнойЧасти.ЯчейкаДоступна Тогда
				ОстатокСвободно = ?(СтрокаТабличнойЧасти.ОстатокВЯчейке < ОстатокСвободно,
					СтрокаТабличнойЧасти.ОстатокВЯчейке - Резерв, ОстатокСвободно);
				СтрокаТабличнойЧасти.ОстатокСвободно = ?(СтрокаТабличнойЧасти.Количество < ОстатокСвободно,
					СтрокаТабличнойЧасти.Количество, ОстатокСвободно);
			Иначе
				ОстатокСвободно = ?(СтрокаТабличнойЧасти.Количество < ОстатокСвободно,
					СтрокаТабличнойЧасти.Количество - Резерв, ОстатокСвободно);
				СтрокаТабличнойЧасти.ОстатокСвободно = ОстатокСвободно;
			КонецЕсли;
			
			СтрокаОстаткаВЦелом.ОстатокТекСклад = СтрокаОстаткаВЦелом.ОстатокТекСклад
				- ((СтрокаТабличнойЧасти.ОстатокСвободно*КоэффициентЕдиницыИзмерения)
					-(Резерв*КоэффициентЕдиницыИзмерения));
			
		Иначе
			
			Если СтрокаТабличнойЧасти.ЯчейкаДоступна Тогда
				ОстатокСвободно = ?(СтрокаТабличнойЧасти.ОстатокВЯчейке < ОстатокСвободно,
					СтрокаТабличнойЧасти.ОстатокВЯчейке - Резерв, ОстатокСвободно);
				СтрокаТабличнойЧасти.ОстатокСвободно = ?(СтрокаТабличнойЧасти.Количество < ОстатокСвободно,
					СтрокаТабличнойЧасти.Количество, ОстатокСвободно);
			Иначе
				СтрокаТабличнойЧасти.ОстатокСвободно = ОстатокСвободно;
			КонецЕсли;
			
		КонецЕсли;
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам = ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбораБезСклада, "Резервировать", , , ИмяТЧ, ТипДокумента, "Отгрузка");
		ИтогПоЗначениюВРезервПоВсемСкладам =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам/КоэффициентЕдиницыИзмерения,3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад= ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбораСкладЗаказБезЯчейки, "Резервировать", , , ИмяТЧ, ТипДокумента, "Отгрузка");
		ИтогПоЗначениюВРезервТекСклад =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад/КоэффициентЕдиницыИзмерения, 3);
		
		Если ЗначениеЗаполнено(Заказ) Тогда
			РезервНаСкладахСКоэффициентом = Окр(СтрокаОстатка.РезервНаСкладахИтог / КоэффициентЕдиницыИзмерения, 3);
			РезервТекСкладСКоэффициентом = Окр(СтрокаОстатка.РезервТекСкладИтог / КоэффициентЕдиницыИзмерения, 3);
		Иначе
			РезервНаСкладахСКоэффициентом = 0;
			РезервТекСкладСКоэффициентом  = 0;
		КонецЕсли;
			
		СтрокаТабличнойЧасти.ВРезерве = РезервНаСкладахСКоэффициентом + СтрокаОстатка.СписаноРезерваНакладной
			- ИтогПоЗначениюВРезервПоВсемСкладам;
		СтрокаТабличнойЧасти.ВРезервеТекСклад = РезервТекСкладСКоэффициентом
			+ СтрокаОстатка.СписаноРезерваНакладнойТекСклад - ИтогПоЗначениюВРезервТекСклад;
		
		ОстатокОбщийСКоэффициентом = Окр(СтрокаОстатка.ОстатокОбщий/КоэффициентЕдиницыИзмерения, 3);
		СтрокаТабличнойЧасти.ОстатокОбщий = ОстатокОбщийСКоэффициентом;
		
		МожноОтгрузить = СтрокаТабличнойЧасти.ОстатокСвободно+ Резерв;
		
		СтрокаТабличнойЧасти.МожноОтгрузить = ?(СтрокаТабличнойЧасти.Количество < МожноОтгрузить,
			СтрокаТабличнойЧасти.Количество, МожноОтгрузить);
		
		СтрокаТабличнойЧасти.НеХватает = СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.МожноОтгрузить;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонки табличной части документа Чек ККМ значениями по остаткам
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  СтруктураДанные - Структура
//  				- Неопределено 
//  НоменклатураОтбора 	- СправочникСсылка.Номенклатура, Неопределено - Номенклатура отбора 
Процедура ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиЧекККМ(Объект, СтруктураДанные = Неопределено,
	НоменклатураОтбора = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если СтруктураДанные = Неопределено Тогда
		
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(,
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Заказ, Ячейка, ЯчейкаДоступна, СтруктурнаяЕдиница");
		
		МассивНоменклатуры = Объект.Запасы.Выгрузить(, "Номенклатура");
		МассивХарактеристик = Объект.Запасы.Выгрузить(, "Характеристика");
		
		СтрокиДляВыгрузки = Объект.Запасы;
	Иначе
		Номенклатура = СтруктураДанные.Номенклатура;
		Характеристика = 
			?(СтруктураДанные.ИспользоватьХарактеристики И ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика,
				Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Партия = ?(СтруктураДанные.ИспользоватьПартии,
			СтруктураДанные.Партия,
			Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		Если ЗначениеЗаполнено(НоменклатураОтбора) Тогда
			ПараметрыОтбора = Новый Структура(" Номенклатура", НоменклатураОтбора);
		Иначе
			ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия",
				Номенклатура, Характеристика, Партия);
		КонецЕсли;
		
		СтрокиДляВыгрузки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Заказ, Ячейка, ЯчейкаДоступна, СтруктурнаяЕдиница");
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Характеристика);
		
	КонецЕсли;
	
	ВШапке = Объект.ПоложениеЗаказаПокупателя = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке");
	
	Для Каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
		СтрокаТаблицы.Заказ = ?(Не ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Или ВШапке,
			Объект.Заказ, СтрокаТаблицы.Заказ);
	КонецЦикла;
	
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	СтрокиОбходаЗапасов = СтрокиДляВыгрузки;
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(Объект.Заказ);
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Характеристика", МассивХарактеристик);
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Запрос.УстановитьПараметр("ОрганизацииПередачи", ИнтеркампаниСервер.ОрганизацииОстатков(Организация));	
	Иначе
		Запрос.УстановитьПараметр("ОрганизацииПередачи", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаОстаткиИРезервыЧекККМ();
		
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	ПараметрыОтбора.Вставить("Партия");
	ПараметрыОтбора.Вставить("Заказ");
	ПараметрыОтбора.Вставить("СтруктурнаяЕдиница");
	ПараметрыОтбора.Вставить("Ячейка");
	
	ПараметрыОтбораБезЗаказа = Новый Структура;
	ПараметрыОтбораБезЗаказа.Вставить("Номенклатура");
	ПараметрыОтбораБезЗаказа.Вставить("Характеристика");
	ПараметрыОтбораБезЗаказа.Вставить("Партия");
	ПараметрыОтбораБезЗаказа.Вставить("СтруктурнаяЕдиница");
	ПараметрыОтбораБезЗаказа.Вставить("Ячейка");
	
	ОбщиеОстаткиПоНоменклатуреПоСкладам = ТаблицаОстатков.Скопировать(,
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, Ячейка, ОстатокТекСклад, КоличествоПроходов, КоличествоСтрок");
	ОбщиеОстаткиПоНоменклатуреПоСкладам.Свернуть(
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, Ячейка, ОстатокТекСклад, КоличествоПроходов, КоличествоСтрок");
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
		
		КоличествоСКоэффициентом = СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения;
		
		ПараметрыОтбораБезЗаказа.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезЗаказа.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезЗаказа.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораБезЗаказа.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		ПараметрыОтбораБезЗаказа.Ячейка = СтрокаТабличнойЧасти.Ячейка;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.Заказ = СтрокаТабличнойЧасти.Заказ;
		ПараметрыОтбора.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		ПараметрыОтбора.Ячейка = СтрокаТабличнойЧасти.Ячейка;
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтрокиОстатки.Количество() Тогда
			СтрокаОстатка = НайденныеСтрокиОстатки[0];
			Если СтрокаОстатка.КоличествоПроходов = 0 Тогда
				СтрокиПоНоменклатуре = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
				СтрокаОстатка.КоличествоСтрок = СтрокиПоНоменклатуре.Количество();
			КонецЕсли;
			СтрокаОстатка.КоличествоПроходов = СтрокаОстатка.КоличествоПроходов+1;
		Иначе
			СтрокаОстатка = Неопределено
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ПредставлениеДублей = "";
		
		СуммаПоСтрокам = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбораБезЗаказа, "Количество");
		СуммаПоСтрокамСТекКоэффициентом = СуммаПоСтрокам / КоэффициентЕдиницыИзмерения;
		
		Если КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3") + " / "
				+ Формат(СуммаПоСтрокам, "ЧДЦ=3");
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3") + " / "
				+ Формат(СуммаПоСтрокамСТекКоэффициентом, "ЧДЦ=3");
		КонецЕсли;
		
		СтрокаТабличнойЧасти.МожноОтгрузить = 0;
		СтрокаТабличнойЧасти.ВРезерве = 0;
		СтрокаТабличнойЧасти.НеХватает = 0;
		СтрокаТабличнойЧасти.ОстатокСвободно = 0;
		СтрокаТабличнойЧасти.ОстатокОбщий = 0;
		
		Если СтрокаОстатка = Неопределено Тогда Продолжить КонецЕсли;
		
		СтрокиОстаткиНоменклатураСклад = ОбщиеОстаткиПоНоменклатуреПоСкладам.НайтиСтроки(ПараметрыОтбораБезЗаказа);
		
		ЭтоПоследняяСтрокаПоНоменклатуре = Ложь;
		
		Если СтрокиОстаткиНоменклатураСклад.Количество() Тогда
			СтрокаОстаткаВЦелом = СтрокиОстаткиНоменклатураСклад[0];
			
			Если СтрокаОстаткаВЦелом.КоличествоПроходов = 0 Тогда
				СтрокиПоНоменклатуре = Объект.Запасы.НайтиСтроки(ПараметрыОтбораБезЗаказа);
				СтрокаОстаткаВЦелом.КоличествоСтрок = СтрокиПоНоменклатуре.Количество();
			КонецЕсли;
			
			СтрокаОстаткаВЦелом.КоличествоПроходов = СтрокаОстаткаВЦелом.КоличествоПроходов+1;
			ЭтоПоследняяСтрокаПоНоменклатуре =
				?(СтрокаОстаткаВЦелом.КоличествоПроходов = СтрокаОстаткаВЦелом.КоличествоСтрок, Истина, Ложь);
			
		Иначе
			СтрокаОстаткаВЦелом = Неопределено
		КонецЕсли;

		Если СтрокаОстаткаВЦелом = Неопределено Тогда Продолжить КонецЕсли;
		
		ОстатокСвободно = Окр(СтрокаОстаткаВЦелом.ОстатокТекСклад/КоэффициентЕдиницыИзмерения,3);
		
		Если Не ЭтоПоследняяСтрокаПоНоменклатуре Тогда
			
			ОстатокСвободно = ?(СтрокаТабличнойЧасти.Количество < ОстатокСвободно,
				СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Резерв, ОстатокСвободно);
			СтрокаТабличнойЧасти.ОстатокСвободно = ОстатокСвободно;
			СтрокаОстаткаВЦелом.ОстатокТекСклад = СтрокаОстаткаВЦелом.ОстатокТекСклад
				- ((СтрокаТабличнойЧасти.ОстатокСвободно*КоэффициентЕдиницыИзмерения)
					- (СтрокаТабличнойЧасти.Резерв*КоэффициентЕдиницыИзмерения));
			
		Иначе
			СтрокаТабличнойЧасти.ОстатокСвободно = ОстатокСвободно;
		КонецЕсли;
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам = ПолучитьСуммуПоТабличнойЧасти(Объект,
			ПараметрыОтбора, "Резервировать");
		ИтогПоЗначениюВРезервПоВсемСкладам =
			Окр(ИтогПоЗначениюВРезервВБазовыхЕдиницахПоВсемСкладам / КоэффициентЕдиницыИзмерения,3);
		
		ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
			"Резервировать");
		ИтогПоЗначениюВРезервТекСклад = Окр(
			ИтогПоЗначениюВРезервВБазовыхЕдиницахТекСклад / КоэффициентЕдиницыИзмерения,3);
		
		Если ЗначениеЗаполнено(Объект.Заказ) Тогда
			РезервНаСкладахСКоэффициентом = Окр(СтрокаОстатка.РезервНаСкладахИтог /КоэффициентЕдиницыИзмерения, 3);
			РезервТекСкладСКоэффициентом = Окр(СтрокаОстатка.РезервТекСкладИтог / КоэффициентЕдиницыИзмерения, 3);
		Иначе
			РезервНаСкладахСКоэффициентом = 0;
			РезервТекСкладСКоэффициентом = 0;
		КонецЕсли;
			
		СтрокаТабличнойЧасти.ВРезерве = РезервНаСкладахСКоэффициентом + СтрокаОстатка.СписаноРезерваНакладной
			- ИтогПоЗначениюВРезервПоВсемСкладам;
		СтрокаТабличнойЧасти.ВРезервеТекСклад = РезервТекСкладСКоэффициентом
			+ СтрокаОстатка.СписаноРезерваНакладнойТекСклад - ИтогПоЗначениюВРезервТекСклад;
		
		ОстатокОбщийСКоэффициентом = Окр(СтрокаОстатка.ОстатокОбщий / КоэффициентЕдиницыИзмерения,3);
		
		СтрокаТабличнойЧасти.ОстатокОбщий = ОстатокОбщийСКоэффициентом;
		
		МожноОтгрузить = ОстатокСвободно + СтрокаТабличнойЧасти.Резерв;
		
		СтрокаТабличнойЧасти.МожноОтгрузить = ?(СтрокаТабличнойЧасти.Количество < МожноОтгрузить,
			СтрокаТабличнойЧасти.Количество, МожноОтгрузить);
		
		СтрокаТабличнойЧасти.НеХватает = СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.МожноОтгрузить;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонки табличной части документа Чек ККМ Форма РМК значениями по остаткам
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура
//  СтруктураДанные - Структура, Неопределено - Структура данные
//  НоменклатураОтбора - СправочникСсылка.Номенклатура, Неопределено - Номенклатура отбора
Процедура ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиЧекККМ_РМК(Объект, СтруктураДанные = Неопределено,  НоменклатураОтбора = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если СтруктураДанные = Неопределено Тогда
		
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(,
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Ячейка, ЯчейкаДоступна, СтруктурнаяЕдиница");
		
		МассивНоменклатуры = Объект.Запасы.Выгрузить(,"Номенклатура");
		МассивХарактеристик = Объект.Запасы.Выгрузить(,"Характеристика");
		
		СтрокиДляВыгрузки = Объект.Запасы;
	Иначе
		Номенклатура = СтруктураДанные.Номенклатура;
		Характеристика =
			?(СтруктураДанные.ИспользоватьХарактеристики И ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		
		Если Не СтруктураДанные.Свойство("Партия") Тогда
			 СтруктураДанные.Вставить("Партия", Справочники.ПартииНоменклатуры.ПустаяСсылка())
		КонецЕсли;
		
		Партия = ?(СтруктураДанные.ИспользоватьПартии,
			СтруктураДанные.Партия, Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		Если ЗначениеЗаполнено(НоменклатураОтбора) Тогда
			ПараметрыОтбора = Новый Структура(" Номенклатура", НоменклатураОтбора);
		Иначе
			ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия",
				Номенклатура, Характеристика, Партия);
		КонецЕсли;
		
		СтрокиДляВыгрузки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		ТаблицаНоменклатуры = Объект.Запасы.Выгрузить(СтрокиДляВыгрузки,
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Ячейка, ЯчейкаДоступна, СтруктурнаяЕдиница");
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Характеристика);
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	ТаблицаНоменклатуры.Колонки.Добавить("Заказ", ОписаниеТипов);
	ТаблицаНоменклатуры.ЗаполнитьЗначения(Объект.Заказ, "Заказ");
	
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	СтрокиОбходаЗапасов = СтрокиДляВыгрузки;
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(Объект.Заказ);
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Характеристика", МассивХарактеристик);
	Запрос.УстановитьПараметр("ЗаказПокупателя",Объект.Заказ);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Запрос.УстановитьПараметр("ОрганизацииПередачи", ИнтеркампаниСервер.ОрганизацииОстатков(Организация));	
	Иначе
		Запрос.УстановитьПараметр("ОрганизацииПередачи", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаОстаткиИРезервыЧекККМ_РМК();
		
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура",);
	ПараметрыОтбора.Вставить("Характеристика",);
	ПараметрыОтбора.Вставить("Партия",);
	ПараметрыОтбора.Вставить("СтруктурнаяЕдиница",);
	ПараметрыОтбора.Вставить("Заказ",);
	ПараметрыОтбора.Вставить("Ячейка",);
	
	ПараметрыОтбораБезЗаказа = Новый Структура;
	ПараметрыОтбораБезЗаказа.Вставить("Номенклатура",);
	ПараметрыОтбораБезЗаказа.Вставить("Характеристика",);
	ПараметрыОтбораБезЗаказа.Вставить("Партия",);
	ПараметрыОтбораБезЗаказа.Вставить("СтруктурнаяЕдиница",);
	ПараметрыОтбораБезЗаказа.Вставить("Ячейка",);
	
	ОбщиеОстаткиПоНоменклатуреПоСкладам = ТаблицаОстатков.Скопировать(,
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, Ячейка, ОстатокТекСклад, КоличествоПроходов, КоличествоСтрок");
	ОбщиеОстаткиПоНоменклатуреПоСкладам.Свернуть(
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, Ячейка, ОстатокТекСклад, КоличествоПроходов, КоличествоСтрок");
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда
				Продолжить
		КонецЕсли;
		
		ПараметрыОтбора.Номенклатура       = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика     = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия             = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.Заказ              = Объект.Заказ;
		ПараметрыОтбора.Ячейка             = СтрокаТабличнойЧасти.Ячейка;
		ПараметрыОтбора.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		
		ПараметрыОтбораБезЗаказа.Номенклатура       = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезЗаказа.Характеристика     = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезЗаказа.Партия             = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораБезЗаказа.Ячейка             = СтрокаТабличнойЧасти.Ячейка;
		ПараметрыОтбораБезЗаказа.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтрокиОстатки.Количество() Тогда
			СтрокаОстатка = НайденныеСтрокиОстатки[0];
			Если СтрокаОстатка.КоличествоПроходов = 0 Тогда
				СтрокиПоНоменклатуре = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
				СтрокаОстатка.КоличествоСтрок = СтрокиПоНоменклатуре.Количество();
			КонецЕсли;
			СтрокаОстатка.КоличествоПроходов = СтрокаОстатка.КоличествоПроходов+1;
		Иначе
			СтрокаОстатка = Неопределено
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Доступно = 0;
		СтрокаТабличнойЧасти.КПоступлению = 0;
		ОстатокСвободно = 0;
		
		Если СтрокаОстатка = Неопределено Тогда Продолжить КонецЕсли;
		
		СтрокиОстаткиНоменклатураСклад = ОбщиеОстаткиПоНоменклатуреПоСкладам.НайтиСтроки(ПараметрыОтбораБезЗаказа);
		
		ЭтоПоследняяСтрокаПоНоменклатуре = Ложь;
		
		Если СтрокиОстаткиНоменклатураСклад.Количество() Тогда
			СтрокаОстаткаВЦелом = СтрокиОстаткиНоменклатураСклад[0];
			
			Если СтрокаОстаткаВЦелом.КоличествоПроходов = 0 Тогда
				СтрокиПоНоменклатуре = Объект.Запасы.НайтиСтроки(ПараметрыОтбораБезЗаказа);
				СтрокаОстаткаВЦелом.КоличествоСтрок = СтрокиПоНоменклатуре.Количество();
			КонецЕсли;
			
			СтрокаОстаткаВЦелом.КоличествоПроходов = СтрокаОстаткаВЦелом.КоличествоПроходов+1;
			ЭтоПоследняяСтрокаПоНоменклатуре =
				?(СтрокаОстаткаВЦелом.КоличествоПроходов = СтрокаОстаткаВЦелом.КоличествоСтрок, Истина, Ложь);
			
		Иначе
			СтрокаОстаткаВЦелом = Неопределено
		КонецЕсли;

		Если СтрокаОстаткаВЦелом = Неопределено Тогда Продолжить КонецЕсли;
		
		ОстатокСвободно = Окр(СтрокаОстаткаВЦелом.ОстатокТекСклад/КоэффициентЕдиницыИзмерения,3);
		
		Если Не ЭтоПоследняяСтрокаПоНоменклатуре Тогда
			СтрокаОстаткаВЦелом.ОстатокТекСклад = СтрокаОстаткаВЦелом.ОстатокТекСклад
				- (СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Заказ) Тогда
			РезервНаСкладахСКоэффициентом = Окр(СтрокаОстатка.РезервНаСкладахИтог/КоэффициентЕдиницыИзмерения, 3);
		Иначе
			РезервНаСкладахСКоэффициентом = 0;
		КонецЕсли;
			
		ВРезерве = РезервНаСкладахСКоэффициентом + СтрокаОстатка.СписаноРезерваНакладной;
		Доступно = ОстатокСвободно + ВРезерве;
		СтрокаТабличнойЧасти.КПоступлению = Окр(СтрокаОстатка.КПоступлению/КоэффициентЕдиницыИзмерения, 3);
		
		СтрокаТабличнойЧасти.Доступно = Доступно;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонку "В резерв" табличной части документа Заказ покупателя по остаткам и производит распределение по
// свободным остаткам других складов
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект
//  ПараметрыОтбора - Структура, Неопределено - Параметры отбора
//  СтруктураОтбораНоменклатуры - Структура, Неопределено - Структура отбора номенклатуры
//  ИмяТЧ - Строка - Имя ТЧ
Процедура ЗаполнитьКолонкуРезервПоОстаткамЗаказПокупателя(Объект, ПараметрыОтбора = Неопределено,
	СтруктураОтбораНоменклатуры = Неопределено, ИмяТЧ = "Запасы") Экспорт
	
	Если ИмяТЧ = "Запасы" И ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = Новый Структура;
	КонецЕсли;
	
	ПоЗаказуНаПереработку = ТипЗнч(Объект.Ссылка) = ТипЗнч(Документы.ЗаказПоставщику.ПустаяСсылка());
	
	ЗаполнитьСтруктурнуюЕдиницуРезерваВТЧ(Объект);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ИмяТЧ = "Запасы" И ПараметрыОтбора.Свойство("НомерВариантаКП") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.Характеристика КАК Характеристика,
		|	ТаблицаЗапасы.Партия КАК Партия
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы
		|ГДЕ
		|	ТаблицаЗапасы.ТипНоменклатурыЗапас";
		Запрос.УстановитьПараметр("ТаблицаЗапасы", Объект[ИмяТЧ].Выгрузить(ПараметрыОтбора));
	ИначеЕсли ПоЗаказуНаПереработку Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.Характеристика КАК Характеристика,
		|	ТаблицаЗапасы.Партия КАК Партия,
		|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы";
		
		Запрос.УстановитьПараметр("ТаблицаЗапасы", Объект[ИмяТЧ].Выгрузить());
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.Характеристика КАК Характеристика,
		|	ТаблицаЗапасы.Партия КАК Партия
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы";
		
		Запрос.УстановитьПараметр("ТаблицаЗапасы", Объект[ИмяТЧ].Выгрузить());
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЗаполнитьРезервПоОстаткам();
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(Объект.Организация));
	Запрос.УстановитьПараметр("ПриоритетныйСклад", Объект.СтруктурнаяЕдиницаРезерв);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	Если ИмяТЧ = "Запасы" Тогда
		СвернутаяТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(,
			"Номенклатура, Характеристика, Цена, Партия, ЕдиницаИзмерения, ДатаОтгрузки, Количество, Резерв, НомерВариантаКП");
		СвернутаяТаблицаЗапасы.Свернуть(
			"Номенклатура, Характеристика, Цена, Партия, ЕдиницаИзмерения, ДатаОтгрузки, НомерВариантаКП", "Количество, Резерв");
		СвернутаяТаблицаЗапасы.Сортировать("Номенклатура Возр, ДатаОтгрузки Возр");
	ИначеЕсли ПоЗаказуНаПереработку Тогда
		СвернутаяТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(,
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Количество, Резерв, ЗаказПокупателя");
		СвернутаяТаблицаЗапасы.Свернуть(
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, ЗаказПокупателя", "Количество, Резерв");
		СвернутаяТаблицаЗапасы.Сортировать("Номенклатура Возр");
	Иначе
		СвернутаяТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(,
			"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Количество, Резерв");
		СвернутаяТаблицаЗапасы.Свернуть("Номенклатура, Характеристика, Партия, ЕдиницаИзмерения", "Количество, Резерв");
		СвернутаяТаблицаЗапасы.Сортировать("Номенклатура Возр");
	КонецЕсли;
		
	Если Не СтруктураОтбораНоменклатуры = Неопределено Тогда
		СвернутаяТаблицаЗапасы = СвернутаяТаблицаЗапасы.НайтиСтроки(СтруктураОтбораНоменклатуры);
	ИначеЕсли ИмяТЧ = "Запасы" И ПараметрыОтбора.Свойство("НомерВариантаКП") Тогда
		СвернутаяТаблицаЗапасы = СвернутаяТаблицаЗапасы.НайтиСтроки(ПараметрыОтбора);
	КонецЕсли;
	
	СтруктураДляПоиска = Новый Структура;
	СтруктураДляПоиска.Вставить("Номенклатура",);
	СтруктураДляПоиска.Вставить("Характеристика",);
	СтруктураДляПоиска.Вставить("Партия",);
	
	Если ИмяТЧ = "Запасы" Тогда
		СтруктураДляПоиска.Вставить("ДатаОтгрузки",);
		СтруктураДляПоиска.Вставить("Цена",);
	КонецЕсли;
	
	Если ПоЗаказуНаПереработку Тогда
		СтруктураДляПоиска.Вставить("ЗаказПокупателя",);
	КонецЕсли;
	
	СтруктураДляПоиска.Вставить("ЕдиницаИзмерения",);
	
	СтруктураДляПоискаБезДатыОтгрузки = Новый Структура;
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Номенклатура",);
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Характеристика",);
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Партия",);
	
	СтруктураДляПоискаПоСкладу = Новый Структура;
	СтруктураДляПоискаПоСкладу.Вставить("Номенклатура",);
	СтруктураДляПоискаПоСкладу.Вставить("Характеристика",);
	СтруктураДляПоискаПоСкладу.Вставить("Партия",);
	СтруктураДляПоискаПоСкладу.Вставить("СтруктурнаяЕдиница",);
	
	СтрокиКУдалению = Новый Массив;
	МассивОбработанныхСтрок = Новый Массив;
	
	Для Каждого СтрокаТабЗапасы Из СвернутаяТаблицаЗапасы Цикл
		
		Если НЕ ТипЗнч(СтрокаТабЗапасы.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			Или Не ЗначениеЗаполнено(СтрокаТабЗапасы.Номенклатура) Тогда 
			Продолжить
		КонецЕсли;
		
		СтруктураДляПоиска.Номенклатура = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоиска.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоиска.Партия = СтрокаТабЗапасы.Партия;
		СтруктураДляПоиска.ЕдиницаИзмерения = СтрокаТабЗапасы.ЕдиницаИзмерения;
		
		Если ИмяТЧ = "Запасы" Тогда
			СтруктураДляПоиска.ДатаОтгрузки = СтрокаТабЗапасы.ДатаОтгрузки;
			СтруктураДляПоиска.Цена = СтрокаТабЗапасы.Цена;
		КонецЕсли;
		
		Если ПоЗаказуНаПереработку Тогда
			СтруктураДляПоиска.ЗаказПокупателя = СтрокаТабЗапасы.ЗаказПокупателя;
		КонецЕсли;
		
		СтруктураДляПоискаБезДатыОтгрузки.Номенклатура = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоискаБезДатыОтгрузки.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоискаБезДатыОтгрузки.Партия = СтрокаТабЗапасы.Партия;
		
		МассивСтрокОстаткиОбщие = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаБезДатыОтгрузки);
		
		Если Не МассивСтрокОстаткиОбщие.Количество() Тогда Продолжить КонецЕсли;
		
		РасходПоРезервуПоВсемСкладам = 0;
		
		Для Каждого СтрокаМассива Из МассивСтрокОстаткиОбщие Цикл
			РасходПоРезервуПоВсемСкладам = РасходПоРезервуПоВсемСкладам + СтрокаМассива.РасходПоРезерву;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(СтрокаТабЗапасы.ЕдиницаИзмерения)
			Или ТипЗнч(СтрокаТабЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
			Тогда 
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабЗапасы.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		МассивСтрокЗапасы = Объект[ИмяТЧ].НайтиСтроки(СтруктураДляПоиска);
		
		КоличествоДляРаспределения = 0;
		ОтгруженоВсего = 0;
		
		Для Каждого СтрокаМассива Из МассивСтрокЗапасы Цикл
			КоличествоДляРаспределения = КоличествоДляРаспределения + СтрокаМассива.Количество;
			ОтгруженоВсего = ОтгруженоВсего + СтрокаМассива.Отгружено;
		КонецЦикла;
		
		ОтгруженоБезРезерва = ОтгруженоВсего - РасходПоРезервуПоВсемСкладам/КоэффициентЕдиницыИзмерения;
		КомпенсацияОтгружено = 0;
		
		Если КоличествоДляРаспределения = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Номенклатура %1% по заказу отгружена. Потребность в распределении отсутствует.'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", Строка(СтрокаТабЗапасы.Номенклатура));
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстСообщения;
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		СтрокиКУдалению.Очистить();
		МассивОбработанныхСтрок.Очистить();
		ПерваяСтрока = Неопределено;
		ОстатокПослеРаспределенияСтроки = 0;
		
		Для Каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.Количество) Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке: %1 не заполнено количество.'"),
					СтрокаЗапасы.НомерСтроки);
				КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы",
					СтрокаЗапасы.НомерСтроки, "Количество");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле); 
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			Если КоличествоДляРаспределения = 0 Тогда
				СтрокиКУдалению.Добавить(СтрокаЗапасы);
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЗапасы.СтруктурнаяЕдиницаРезерв) Тогда
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.СтруктурнаяЕдиницаРезерв;
			ИначеЕсли ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаРезерв) Тогда
				СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиницаРезерв;
			Иначе
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
				СтрокаЗапасы.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаДляПоиска;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтруктурнаяЕдиницаДляПоиска) Тогда Продолжить КонецЕсли;
				
			СтруктураДляПоискаПоСкладу.Номенклатура = СтрокаТабЗапасы.Номенклатура;
			СтруктураДляПоискаПоСкладу.Характеристика = СтрокаТабЗапасы.Характеристика;
			СтруктураДляПоискаПоСкладу.Партия = СтрокаТабЗапасы.Партия;
			СтруктураДляПоискаПоСкладу.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
			
			МассивСтрокОстатки = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаПоСкладу);
			
			СтрокаЗапасы.Резерв = 0;
			
			Если Не МассивСтрокОстатки.Количество() Или МассивСтрокОстатки[0].КоличествоОстаток = 0 Тогда
				
				Если МассивСтрокОстаткиОбщие.Количество() И СтрокаЗапасы.Отгружено = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				Иначе
					КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.Отгружено;
					СтрокаЗапасы.Количество = СтрокаЗапасы.Отгружено;
					ОтгруженоБезРезерва = ?(ОтгруженоБезРезерва > СтрокаЗапасы.Количество, ОтгруженоБезРезерва
						- СтрокаЗапасы.Количество, 0);
					МассивОбработанныхСтрок.Добавить(СтрокаЗапасы);
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
			
			СтрокаОстатка = МассивСтрокОстатки[0];
			
			КоличествоОстаток = СтрокаОстатка.КоличествоОстаток/КоэффициентЕдиницыИзмерения;
			РасходПоРезерву = СтрокаОстатка.РасходПоРезерву/КоэффициентЕдиницыИзмерения;
			ТекРасходПоРезерву = РасходПоРезерву;
			РезервПоДругимДокументам = СтрокаОстатка.РезервПоДругимДокументам/КоэффициентЕдиницыИзмерения;
			
			Если РезервПоДругимДокументам - РасходПоРезерву >= 0 Тогда
				РезервПоДругимДокументам = РезервПоДругимДокументам - РасходПоРезерву;
				СтрокаОстатка.РезервПоДругимДокументам = СтрокаОстатка.РезервПоДругимДокументам
					- СтрокаОстатка.РасходПоРезерву;
				РасходПоРезерву = 0;
				СтрокаОстатка.РасходПоРезерву = 0;
			Иначе
				РасходПоРезерву = РасходПоРезерву - РезервПоДругимДокументам;
				СтрокаОстатка.РасходПоРезерву = СтрокаОстатка.РасходПоРезерву
					- СтрокаОстатка.РезервПоДругимДокументам;
				РезервПоДругимДокументам = 0;
				СтрокаОстатка.РезервПоДругимДокументам = 0;
			КонецЕсли;
			
			Если ОтгруженоБезРезерва>0 И СтрокаЗапасы.НеОтгружено = 0 Тогда
				ПолнаяОтгрузка = ОтгруженоБезРезерва + ТекРасходПоРезерву;
				Если ПолнаяОтгрузка > СтрокаЗапасы.Количество Тогда
					КомпенсацияОтгружено = ПолнаяОтгрузка - СтрокаЗапасы.Количество;
					СтрокаЗапасы.Отгружено = СтрокаЗапасы.Отгружено+КомпенсацияОтгружено;
					СтрокаЗапасы.Количество = ПолнаяОтгрузка;
					КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.НеОтгружено;
					ОтгруженоБезРезерва = 0;
				КонецЕсли;
			Иначе
				СтрокаЗапасы.Отгружено = СтрокаЗапасы.Отгружено - КомпенсацияОтгружено;
			КонецЕсли;
			ПолнаяОтгрузка = 0;
			
			Если СтрокаЗапасы.НеОтгружено < КоличествоОстаток Тогда
				
				Если ОстатокПослеРаспределенияСтроки > 0 Тогда
					
					Если СтрокаЗапасы.НеОтгружено + ОстатокПослеРаспределенияСтроки < КоличествоОстаток Тогда
						
						СтрокаЗапасы.НеОтгружено = СтрокаЗапасы.НеОтгружено + ОстатокПослеРаспределенияСтроки;
						ОстатокПослеРаспределенияСтроки = 0;
					Иначе
						СтрокаЗапасы.НеОтгружено = СтрокаЗапасы.Количество - СтрокаЗапасы.Отгружено;
						ОстатокПослеРаспределенияСтроки =
							(СтрокаЗапасы.НеОтгружено + ОстатокПослеРаспределенияСтроки) - КоличествоОстаток;
					КонецЕсли;
					
				Иначе
					
					Количество = ?(КоличествоОстаток > КоличествоДляРаспределения,
						КоличествоДляРаспределения, КоличествоОстаток);
					
					СтрокаЗапасы.НеОтгружено = Количество - СтрокаЗапасы.Отгружено;
					ОстатокПослеРаспределенияСтроки = СтрокаЗапасы.Количество - СтрокаЗапасы.НеОтгружено;
					
				КонецЕсли;
				
			Иначе
				
				Количество = ?(КоличествоОстаток > КоличествоДляРаспределения,
					КоличествоДляРаспределения, КоличествоОстаток);
				
				СтрокаЗапасы.НеОтгружено = Количество - СтрокаЗапасы.Отгружено;
				ОстатокПослеРаспределенияСтроки = СтрокаЗапасы.Количество - СтрокаЗапасы.НеОтгружено;
				
			КонецЕсли;
			
			СтрокаЗапасы.НеОтгружено = ?(СтрокаЗапасы.НеОтгружено<0,0,СтрокаЗапасы.НеОтгружено);
			
			СтрокаЗапасы.Количество = СтрокаЗапасы.НеОтгружено + (ТекРасходПоРезерву);
			СтрокаОстатка.РасходПоРезерву = 0;
			
			Если СтрокаЗапасы.НеОтгружено > РезервПоДругимДокументам Тогда
				
				НеобходимыйРезерв = СтрокаЗапасы.НеОтгружено-РезервПоДругимДокументам+РасходПоРезерву;
				
				СтрокаЗапасы.Резерв = ?(НеобходимыйРезерв > КоличествоОстаток,
					КоличествоОстаток, НеобходимыйРезерв);
				
				СтрокаОстатка.РезервПоДругимДокументам = 0;
			Иначе
				СтрокаОстатка.РезервПоДругимДокументам = СтрокаОстатка.РезервПоДругимДокументам
					- СтрокаЗапасы.НеОтгружено*КоэффициентЕдиницыИзмерения;
			КонецЕсли;
			
			НеотъемлемыйРезервТекДокумент =
				СтрокаОстатка.НеотъемлемыйРезервТекДокумент / КоэффициентЕдиницыИзмерения;
			
			Если НеотъемлемыйРезервТекДокумент > СтрокаЗапасы.Резерв Тогда
				
				Если СтрокаЗапасы.Количество >= НеотъемлемыйРезервТекДокумент Тогда
					СтрокаЗапасы.Резерв = НеотъемлемыйРезервТекДокумент;
					СтрокаОстатка.НеотъемлемыйРезервТекДокумент = 0;
				Иначе
					СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
					СтрокаОстатка.НеотъемлемыйРезервТекДокумент = СтрокаОстатка.НеотъемлемыйРезервТекДокумент
						- СтрокаЗапасы.Резерв*КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
			Иначе
				СтрокаОстатка.НеотъемлемыйРезервТекДокумент = 0;
			КонецЕсли;
			
			СтрокаЗапасы.СтруктурнаяЕдиницаРезерв = ?(Не ЗначениеЗаполнено(СтрокаЗапасы.СтруктурнаяЕдиницаРезерв),
				СтруктурнаяЕдиницаДляПоиска, СтрокаЗапасы.СтруктурнаяЕдиницаРезерв);
			
			СтрокаОстатка.КоличествоОстаток = СтрокаОстатка.КоличествоОстаток
				- СтрокаЗапасы.НеОтгружено * КоэффициентЕдиницыИзмерения;
			
			Если Не СтрокаЗапасы.ЭтоДубльСтроки Тогда
				ТекРасходПоРезерву = РасходПоРезервуПоВсемСкладам;
			КонецЕсли;
			
			СтрокаЗапасы.Количество = СтрокаЗапасы.Количество + СтрокаЗапасы.Отгружено - ТекРасходПоРезерву;
			
			КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.Количество;
			
			ПерваяСтрока = ?(ПерваяСтрока = Неопределено, СтрокаЗапасы, ПерваяСтрока);
			
			СтрокаУдалена = НайденаСтрокаСТакимЖеСкладомОбработанаТекущаяИУдалена(СтрокиКУдалению, СтрокаЗапасы,
				МассивОбработанныхСтрок);
			
			Если Не СтрокаУдалена Тогда
				МассивОбработанныхСтрок.Добавить(СтрокаЗапасы);
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоДляРаспределения > 0 И МассивСтрокОстаткиОбщие.Количество() Тогда
			
			Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаРезерв) Тогда
				СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиницаРезерв;
			Иначе
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
				СтрокаЗапасы.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаДляПоиска;
			КонецЕсли;
			
			ПодготовитьТаблицуСогласноПриоритетам(ТаблицаОстатков, СтруктурнаяЕдиницаДляПоиска);
			
			НоваяСтрока = Неопределено;
			
			НомерСтроки = СтрокаЗапасы.НомерСтроки;
			
			Для каждого СтрокаМассиваСтрокОстатки Из МассивСтрокОстаткиОбщие Цикл
				
				РасходПоРезерву = СтрокаМассиваСтрокОстатки.РасходПоРезерву / КоэффициентЕдиницыИзмерения;
				ТекРасходПоРезерву = РасходПоРезерву;
				РезервПоДругимДокументам =
					СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам / КоэффициентЕдиницыИзмерения;
				
				Если РасходПоРезерву > 0 И РезервПоДругимДокументам > 0 Тогда
					
					Если РезервПоДругимДокументам - РасходПоРезерву >= 0 Тогда
						РезервПоДругимДокументам = РезервПоДругимДокументам - РасходПоРезерву;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам =
							СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам
							- СтрокаМассиваСтрокОстатки.РасходПоРезерву;
						РасходПоРезерву = 0;
						СтрокаМассиваСтрокОстатки.РасходПоРезерву = 0;
					Иначе
						РасходПоРезерву = РасходПоРезерву - РезервПоДругимДокументам;
						СтрокаМассиваСтрокОстатки.РасходПоРезерву = СтрокаОстатка.РасходПоРезерву
							- СтрокаОстатка.РезервПоДругимДокументам;
						РезервПоДругимДокументам = 0;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам = 0;
					КонецЕсли;
					
				КонецЕсли;
				
				ОстатокНаСкладе = СтрокаМассиваСтрокОстатки.КоличествоОстаток / КоэффициентЕдиницыИзмерения;
				
				Если ОстатокНаСкладе + РасходПоРезерву <= 0 Тогда Продолжить КонецЕсли;
				
				НоваяСтрока = Объект[ИмяТЧ].Вставить(НомерСтроки);
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗапасы);
				
				НоваяСтрока.КлючСвязи = 0;
				ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(Объект[ИмяТЧ], НоваяСтрока, "КлючСвязи");
				
				НоваяСтрока.СтруктурнаяЕдиницаРезерв = СтрокаМассиваСтрокОстатки.СтруктурнаяЕдиница;
				НоваяСтрока.Резерв = 0;
				
				Если ОстатокНаСкладе > КоличествоДляРаспределения Тогда
					
					НоваяСтрока.Количество = КоличествоДляРаспределения;
					СтрокаМассиваСтрокОстатки.КоличествоОстаток = СтрокаМассиваСтрокОстатки.КоличествоОстаток
						- КоличествоДляРаспределения*КоэффициентЕдиницыИзмерения;
					КоличествоДляРаспределения = 0;
					
					Если НоваяСтрока.Количество > РезервПоДругимДокументам Тогда
						НоваяСтрока.Резерв = НоваяСтрока.Количество-РезервПоДругимДокументам;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам = 0;
					Иначе
						НоваяСтрока.Резерв = 0;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам =
							СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам
							- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
					КонецЕсли;
				Иначе
					НоваяСтрока.Количество = ОстатокНаСкладе+ТекРасходПоРезерву;
					КоличествоДляРаспределения = КоличествоДляРаспределения - НоваяСтрока.Количество;
					СтрокаМассиваСтрокОстатки.КоличествоОстаток = 0;
							
					Если НоваяСтрока.Количество > РезервПоДругимДокументам Тогда
						НоваяСтрока.Резерв = (ОстатокНаСкладе + РасходПоРезерву)-РезервПоДругимДокументам;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам = 0;
					Иначе
						НоваяСтрока.Резерв = 0;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам =
							СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам
							- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаУдалена = НайденаСтрокаСТакимЖеСкладомОбработанаТекущаяИУдалена(СтрокиКУдалению,
					НоваяСтрока, МассивОбработанныхСтрок);
				
				Если Не СтрокаУдалена Тогда
					МассивОбработанныхСтрок.Добавить(НоваяСтрока);
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				
				Если КоличествоДляРаспределения = 0 Тогда Прервать КонецЕсли;
				
			КонецЦикла;
			
			ПоследняяСтрокаМассива = ?(МассивОбработанныхСтрок.Количество(),
				МассивОбработанныхСтрок[МассивОбработанныхСтрок.Количество() - 1], Неопределено);
			
			ПоследняяСтрока = ПоследняяСтрокаМассива;
			
			Если КоличествоДляРаспределения > 0 И Не ПоследняяСтрокаМассива = Неопределено Тогда
				ПоследняяСтрока.Количество = ПоследняяСтрока.Количество + КоличествоДляРаспределения;
			КонецЕсли;
			
		КонецЕсли;
		
		ОчиститьПриоритеты(ТаблицаОстатков);
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Объект[ИмяТЧ].Удалить(СтрокаКУдалению);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонку "В резерв" табличной части документа Заказ на производство по остаткам и производит распределение
// по свободным остаткам других складов
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура
//  ПараметрыОтбора - Структура, Неопределено - Параметры отбора
//  СтруктураОтбораНоменклатуры - СправочникСсылка.Номенклатура, Неопределено - Структура отбора номенклатуры
//  ИмяТЧ - Строка - Имя ТЧ
Процедура ЗаполнитьКолонкуРезервПоОстаткамЗаказНаПроизводство(Объект, ПараметрыОтбора = Неопределено,
	СтруктураОтбораНоменклатуры = Неопределено, ИмяТЧ = "Запасы") Экспорт
	
	ЗаполнитьСтруктурнуюЕдиницуРезерваВТЧ(Объект);
	
	СвернутаяТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(,
		"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Количество, Резерв, ЗаказПокупателя");
	СвернутаяТаблицаЗапасы.Свернуть(
		"Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, ЗаказПокупателя", "Количество, Резерв");
	СвернутаяТаблицаЗапасы.Сортировать("Номенклатура Возр");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы";
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Объект[ИмяТЧ].Выгрузить());
	
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЗаполнитьРезервПоОстаткамЗаказНаПроизводство();
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(Объект.Организация));
	Запрос.УстановитьПараметр("ПриоритетныйСклад", Объект.СтруктурнаяЕдиницаРезерв);

	МассивЗаказов = Новый Массив;
	
	Для Каждого СтрокаТЧ Из СвернутаяТаблицаЗапасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ЗаказПокупателя) Тогда
			МассивЗаказов.Добавить(СтрокаТЧ.ЗаказПокупателя)
		КонецЕсли;
	КонецЦикла;
	 
	Запрос.УстановитьПараметр("ЗаказыЕсть", ?(МассивЗаказов.Количество(), Истина, Ложь));
	Запрос.УстановитьПараметр("Ссылка", МассивЗаказов);
	Запрос.УстановитьПараметр("СсылкаТекДокумент", Объект.Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
		
	Если Не СтруктураОтбораНоменклатуры = Неопределено Тогда
		СвернутаяТаблицаЗапасы = СвернутаяТаблицаЗапасы.НайтиСтроки(СтруктураОтбораНоменклатуры);
	КонецЕсли;
	
	СтруктураДляПоискаСвободногоОстатка = Новый Структура;
	СтруктураДляПоискаСвободногоОстатка.Вставить("Номенклатура");
	СтруктураДляПоискаСвободногоОстатка.Вставить("Характеристика");
	СтруктураДляПоискаСвободногоОстатка.Вставить("Партия");
	СтруктураДляПоискаСвободногоОстатка.Вставить("СвободныйОстаток", Истина);
	
	СтруктураДляПоиска = Новый Структура;
	СтруктураДляПоиска.Вставить("Номенклатура");
	СтруктураДляПоиска.Вставить("Характеристика");
	СтруктураДляПоиска.Вставить("Партия");
	СтруктураДляПоиска.Вставить("ЕдиницаИзмерения");
	СтруктураДляПоиска.Вставить("ЗаказПокупателя");
	
	СтруктураДляПоискаБезДатыОтгрузки = Новый Структура;
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Номенклатура");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Характеристика");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Партия");
	
	СтруктураДляПоискаПоСкладу = Новый Структура;
	СтруктураДляПоискаПоСкладу.Вставить("Номенклатура");
	СтруктураДляПоискаПоСкладу.Вставить("Характеристика");
	СтруктураДляПоискаПоСкладу.Вставить("Партия");
	СтруктураДляПоискаПоСкладу.Вставить("СтруктурнаяЕдиница");
	СтруктураДляПоискаПоСкладу.Вставить("ЗаказПокупателя");
	
	СтруктураДляПоискаПоСкладуПоЗаказу = Новый Структура;
	СтруктураДляПоискаПоСкладуПоЗаказу.Вставить("Номенклатура");
	СтруктураДляПоискаПоСкладуПоЗаказу.Вставить("Характеристика");
	СтруктураДляПоискаПоСкладуПоЗаказу.Вставить("Партия");
	СтруктураДляПоискаПоСкладуПоЗаказу.Вставить("СтруктурнаяЕдиница");
	СтруктураДляПоискаПоСкладуПоЗаказу.Вставить("ЗаказПокупателя");
	
	СтрокиКУдалению = Новый Массив;
	МассивОбработанныхСтрок = Новый Массив;
	
	Для Каждого СтрокаТабЗапасы Из СвернутаяТаблицаЗапасы Цикл
		
		Если НЕ ТипЗнч(СтрокаТабЗапасы.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			Или Не ЗначениеЗаполнено(СтрокаТабЗапасы.Номенклатура) Тогда 
			Продолжить
		КонецЕсли;
		
		СтруктураДляПоиска.Номенклатура     = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоиска.Характеристика   = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоиска.Партия           = СтрокаТабЗапасы.Партия;
		СтруктураДляПоиска.ЕдиницаИзмерения = СтрокаТабЗапасы.ЕдиницаИзмерения;
		СтруктураДляПоиска.ЗаказПокупателя  = СтрокаТабЗапасы.ЗаказПокупателя;
		
		СтруктураДляПоискаБезДатыОтгрузки.Номенклатура   = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоискаБезДатыОтгрузки.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоискаБезДатыОтгрузки.Партия         = СтрокаТабЗапасы.Партия;
		
		МассивСтрокОстаткиСвободные = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаСвободногоОстатка);
		МассивСтрокОстаткиОбщие = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаБезДатыОтгрузки);
		
		Для Каждого СтрокаСвободногоОстатка Из МассивСтрокОстаткиСвободные Цикл
			 МассивСтрокОстаткиОбщие.Добавить(СтрокаСвободногоОстатка);
		КонецЦикла;
		
		Если Не МассивСтрокОстаткиОбщие.Количество() Тогда Продолжить КонецЕсли;
		
		РасходПоРезервуПоВсемСкладам = 0;
		
		Для Каждого СтрокаМассива Из МассивСтрокОстаткиОбщие Цикл
			РасходПоРезервуПоВсемСкладам = РасходПоРезервуПоВсемСкладам + СтрокаМассива.РасходПоРезерву;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(СтрокаТабЗапасы.ЕдиницаИзмерения)
			Или ТипЗнч(СтрокаТабЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
			Тогда 
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабЗапасы.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		МассивСтрокЗапасы = Объект[ИмяТЧ].НайтиСтроки(СтруктураДляПоиска);
		
		КоличествоДляРаспределения = 0;
		ОтгруженоВсего = 0;
		
		Для Каждого СтрокаМассива Из МассивСтрокЗапасы Цикл
			КоличествоДляРаспределения = КоличествоДляРаспределения + СтрокаМассива.Количество;
			ОтгруженоВсего = ОтгруженоВсего + СтрокаМассива.Отгружено;
		КонецЦикла;
		
		ОтгруженоБезРезерва = ОтгруженоВсего - РасходПоРезервуПоВсемСкладам/КоэффициентЕдиницыИзмерения;
		КомпенсацияОтгружено = 0;
		
		Если КоличествоДляРаспределения = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Номенклатура %1% по заказу %2% отгружена. 
									|Потребность в распределении отсутствует.'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", Строка(СтрокаТабЗапасы.Номенклатура));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2%",
				?(ЗначениеЗаполнено(СтрокаТабЗапасы.ЗаказПокупателя),
					Строка(СтрокаТабЗапасы.ЗаказПокупателя), "<Без заказа>"));
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстСообщения;
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			Продолжить;
			
		КонецЕсли;
		
		СтрокиКУдалению.Очистить();
		МассивОбработанныхСтрок.Очистить();
		ПерваяСтрока = Неопределено;
		ОстатокПослеРаспределенияСтроки = 0;
		
		Для Каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.Количество) Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке: %1 не заполнено количество.'"),
					СтрокаЗапасы.НомерСтроки);
				КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы",
					СтрокаЗапасы.НомерСтроки, "Количество");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле); 
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			Если КоличествоДляРаспределения = 0 Тогда
				СтрокиКУдалению.Добавить(СтрокаЗапасы);
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЗапасы.СтруктурнаяЕдиница) Тогда
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.СтруктурнаяЕдиница;
			ИначеЕсли ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаРезерв) Тогда
				СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиницаРезерв;
			Иначе
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
				СтрокаЗапасы.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтруктурнаяЕдиницаДляПоиска) Тогда Продолжить КонецЕсли;
				
			СтруктураДляПоискаПоСкладу.Номенклатура       = СтрокаТабЗапасы.Номенклатура;
			СтруктураДляПоискаПоСкладу.Характеристика     = СтрокаТабЗапасы.Характеристика;
			СтруктураДляПоискаПоСкладу.Партия             = СтрокаТабЗапасы.Партия;
			СтруктураДляПоискаПоСкладу.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
			СтруктураДляПоискаПоСкладу.ЗаказПокупателя    = Документы.ЗаказПокупателя.ПустаяСсылка();
			
			СтруктураДляПоискаПоСкладуПоЗаказу.Номенклатура       = СтрокаТабЗапасы.Номенклатура;
			СтруктураДляПоискаПоСкладуПоЗаказу.Характеристика     = СтрокаТабЗапасы.Характеристика;
			СтруктураДляПоискаПоСкладуПоЗаказу.Партия             = СтрокаТабЗапасы.Партия;
			СтруктураДляПоискаПоСкладуПоЗаказу.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
			СтруктураДляПоискаПоСкладуПоЗаказу.ЗаказПокупателя    = СтрокаТабЗапасы.ЗаказПокупателя;
			
			МассивСтрокОстаткиВЦелом = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаПоСкладу);
			МассивСтрокПоЗаказу = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаПоСкладуПоЗаказу);
			
			СтрокаЗапасы.Резерв = 0;
			
			Если Не МассивСтрокОстаткиВЦелом.Количество() Или МассивСтрокОстаткиВЦелом[0].КоличествоОстаток = 0 Тогда
				
				Если МассивСтрокОстаткиОбщие.Количество() И СтрокаЗапасы.Отгружено = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				Иначе
					КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.Отгружено;
					СтрокаЗапасы.Количество = СтрокаЗапасы.Отгружено;
					ОтгруженоБезРезерва = ?(ОтгруженоБезРезерва > СтрокаЗапасы.Количество,
						ОтгруженоБезРезерва - СтрокаЗапасы.Количество, 0);
					МассивОбработанныхСтрок.Добавить(СтрокаЗапасы);
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
			
			СтрокаОстатка = МассивСтрокОстаткиВЦелом[0];
			
			Если НЕ МассивСтрокПоЗаказу.Количество() Тогда
				СтрокаПоСкладуПоЗаказу = СтрокаОстатка;
			Иначе
				СтрокаПоСкладуПоЗаказу = МассивСтрокПоЗаказу[0];
			КонецЕсли;
			
			КоличествоОстаток = СтрокаОстатка.КоличествоОстаток/КоэффициентЕдиницыИзмерения;
			РасходПоРезерву = СтрокаПоСкладуПоЗаказу.РасходПоРезерву/КоэффициентЕдиницыИзмерения;
			ТекРасходПоРезерву = РасходПоРезерву;
			РезервПоДругимДокументам = СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам/КоэффициентЕдиницыИзмерения;
			
			Если РезервПоДругимДокументам - РасходПоРезерву >= 0 Тогда
				РезервПоДругимДокументам = РезервПоДругимДокументам - РасходПоРезерву;
				СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам = СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам
					- СтрокаПоСкладуПоЗаказу.РасходПоРезерву;
				РасходПоРезерву = 0;
				СтрокаПоСкладуПоЗаказу.РасходПоРезерву = 0;
			Иначе
				РасходПоРезерву = РасходПоРезерву - РезервПоДругимДокументам;
				СтрокаПоСкладуПоЗаказу.РасходПоРезерву = СтрокаПоСкладуПоЗаказу.РасходПоРезерву
					- СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам;
				РезервПоДругимДокументам = 0;
				СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам = 0;
			КонецЕсли;
			
			Если ОтгруженоБезРезерва>0 И СтрокаЗапасы.НеОтгружено = 0 Тогда
				ПолнаяОтгрузка = ОтгруженоБезРезерва + ТекРасходПоРезерву;
				Если ПолнаяОтгрузка > СтрокаЗапасы.Количество Тогда
					КомпенсацияОтгружено = ПолнаяОтгрузка - СтрокаЗапасы.Количество;
					СтрокаЗапасы.Отгружено = СтрокаЗапасы.Отгружено+КомпенсацияОтгружено;
					СтрокаЗапасы.Количество = ПолнаяОтгрузка;
					КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.НеОтгружено;
					ОтгруженоБезРезерва = 0;
				КонецЕсли;
			Иначе
				СтрокаЗапасы.Отгружено = СтрокаЗапасы.Отгружено - КомпенсацияОтгружено;
			КонецЕсли;
			ПолнаяОтгрузка = 0;
			
			Если СтрокаЗапасы.НеОтгружено < КоличествоОстаток Тогда
				
				Если ОстатокПослеРаспределенияСтроки > 0 Тогда
					
					Если СтрокаЗапасы.НеОтгружено + ОстатокПослеРаспределенияСтроки < КоличествоОстаток Тогда
						
						СтрокаЗапасы.НеОтгружено = СтрокаЗапасы.НеОтгружено + ОстатокПослеРаспределенияСтроки;
						ОстатокПослеРаспределенияСтроки = 0;
					Иначе
						СтрокаЗапасы.НеОтгружено = СтрокаЗапасы.Количество - СтрокаЗапасы.Отгружено;
						ОстатокПослеРаспределенияСтроки =
							(СтрокаЗапасы.НеОтгружено + ОстатокПослеРаспределенияСтроки) - КоличествоОстаток;
					КонецЕсли;
					
				Иначе
					
					Количество = ?(КоличествоОстаток > КоличествоДляРаспределения,
						КоличествоДляРаспределения, КоличествоОстаток);
					
					СтрокаЗапасы.НеОтгружено = Количество - СтрокаЗапасы.Отгружено;
					ОстатокПослеРаспределенияСтроки = СтрокаЗапасы.Количество - СтрокаЗапасы.НеОтгружено;
					
				КонецЕсли;
				
			Иначе
				
				Количество = ?(КоличествоОстаток > КоличествоДляРаспределения,
					КоличествоДляРаспределения, КоличествоОстаток);
				
				СтрокаЗапасы.НеОтгружено = Количество - СтрокаЗапасы.Отгружено;
				ОстатокПослеРаспределенияСтроки = СтрокаЗапасы.Количество - СтрокаЗапасы.НеОтгружено;
				
			КонецЕсли;
			
			СтрокаЗапасы.НеОтгружено = ?(СтрокаЗапасы.НеОтгружено<0, 0, СтрокаЗапасы.НеОтгружено);
			
			СтрокаЗапасы.Количество = СтрокаЗапасы.НеОтгружено + (ТекРасходПоРезерву);
			СтрокаПоСкладуПоЗаказу.РасходПоРезерву = 0;
			
			Если СтрокаЗапасы.НеОтгружено > РезервПоДругимДокументам Тогда
				
				НеобходимыйРезерв = СтрокаЗапасы.НеОтгружено-РезервПоДругимДокументам+РасходПоРезерву;
				
				СтрокаЗапасы.Резерв = ?(НеобходимыйРезерв> КоличествоОстаток, КоличествоОстаток, НеобходимыйРезерв);
				
				СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам = 0;
			Иначе
				СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам = СтрокаПоСкладуПоЗаказу.РезервПоДругимДокументам
					- СтрокаЗапасы.НеОтгружено*КоэффициентЕдиницыИзмерения;
			КонецЕсли;
			
			НеотъемлемыйРезервТекДокумент =
				СтрокаПоСкладуПоЗаказу.НеотъемлемыйРезервТекДокумент / КоэффициентЕдиницыИзмерения;
			
			Если НеотъемлемыйРезервТекДокумент > СтрокаЗапасы.Резерв Тогда
				
				Если СтрокаЗапасы.Количество >= НеотъемлемыйРезервТекДокумент Тогда
					СтрокаЗапасы.Резерв = НеотъемлемыйРезервТекДокумент;
					СтрокаПоСкладуПоЗаказу.НеотъемлемыйРезервТекДокумент = 0;
				Иначе
					СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
					СтрокаПоСкладуПоЗаказу.НеотъемлемыйРезервТекДокумент =
						СтрокаПоСкладуПоЗаказу.НеотъемлемыйРезервТекДокумент
						- СтрокаЗапасы.Резерв*КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
			Иначе
				СтрокаПоСкладуПоЗаказу.НеотъемлемыйРезервТекДокумент = 0;
			КонецЕсли;
			
			СтрокаЗапасы.СтруктурнаяЕдиница = ?(Не ЗначениеЗаполнено(СтрокаЗапасы.СтруктурнаяЕдиница),
				СтруктурнаяЕдиницаДляПоиска, СтрокаЗапасы.СтруктурнаяЕдиница);
			
			СтрокаОстатка.КоличествоОстаток = СтрокаОстатка.КоличествоОстаток
				- СтрокаЗапасы.НеОтгружено*КоэффициентЕдиницыИзмерения;
			
			Если Не СтрокаЗапасы.ЭтоДубльСтроки Тогда
				ТекРасходПоРезерву = РасходПоРезервуПоВсемСкладам;
			КонецЕсли;
			
			СтрокаЗапасы.Количество = СтрокаЗапасы.Количество + СтрокаЗапасы.Отгружено - ТекРасходПоРезерву;
			
			КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.Количество;
			
			ПерваяСтрока = ?(ПерваяСтрока = Неопределено, СтрокаЗапасы, ПерваяСтрока);
			
			СтрокаУдалена = НайденаСтрокаСТакимЖеСкладомОбработанаТекущаяИУдаленаЗаказНаПроизводство(
				СтрокиКУдалению,СтрокаЗапасы, МассивОбработанныхСтрок);
			
			Если Не СтрокаУдалена Тогда
				МассивОбработанныхСтрок.Добавить(СтрокаЗапасы);
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоДляРаспределения > 0 И МассивСтрокОстаткиОбщие.Количество() Тогда
			
			Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаРезерв) Тогда
				СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиницаРезерв;
			Иначе
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
				СтрокаЗапасы.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
			КонецЕсли;
			
			ПодготовитьТаблицуСогласноПриоритетам(ТаблицаОстатков, СтруктурнаяЕдиницаДляПоиска);
			
			НоваяСтрока = Неопределено;
			
			НомерСтроки = СтрокаЗапасы.НомерСтроки;
			
			Для каждого СтрокаМассиваСтрокОстатки Из МассивСтрокОстаткиОбщие Цикл
				
				РасходПоРезерву = СтрокаМассиваСтрокОстатки.РасходПоРезерву/КоэффициентЕдиницыИзмерения;
				ТекРасходПоРезерву = РасходПоРезерву;
				РезервПоДругимДокументам =
					СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам / КоэффициентЕдиницыИзмерения;
				
				Если РасходПоРезерву > 0 И РезервПоДругимДокументам > 0 Тогда
					
					Если РезервПоДругимДокументам - РасходПоРезерву >= 0 Тогда
						РезервПоДругимДокументам = РезервПоДругимДокументам - РасходПоРезерву;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам =
							СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам
							- СтрокаМассиваСтрокОстатки.РасходПоРезерву;
						РасходПоРезерву = 0;
						СтрокаМассиваСтрокОстатки.РасходПоРезерву = 0;
					Иначе
						РасходПоРезерву = РасходПоРезерву - РезервПоДругимДокументам;
						СтрокаМассиваСтрокОстатки.РасходПоРезерву = СтрокаОстатка.РасходПоРезерву
							- СтрокаОстатка.РезервПоДругимДокументам;
						РезервПоДругимДокументам = 0;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам = 0;
					КонецЕсли;
					
				КонецЕсли;
				
				ОстатокНаСкладе = СтрокаМассиваСтрокОстатки.КоличествоОстаток/КоэффициентЕдиницыИзмерения;
				
				Если ОстатокНаСкладе + РасходПоРезерву <= 0 Тогда Продолжить КонецЕсли;
				
				НоваяСтрока = Объект[ИмяТЧ].Вставить(НомерСтроки);
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗапасы);
				
				НоваяСтрока.СтруктурнаяЕдиница = СтрокаМассиваСтрокОстатки.СтруктурнаяЕдиница;
				НоваяСтрока.Резерв = 0;
				
				Если ОстатокНаСкладе > КоличествоДляРаспределения Тогда
					
					НоваяСтрока.Количество = КоличествоДляРаспределения;
					СтрокаМассиваСтрокОстатки.КоличествоОстаток = СтрокаМассиваСтрокОстатки.КоличествоОстаток
						- КоличествоДляРаспределения * КоэффициентЕдиницыИзмерения;
					КоличествоДляРаспределения = 0;
					
					Если НоваяСтрока.Количество > РезервПоДругимДокументам Тогда
						НоваяСтрока.Резерв = НоваяСтрока.Количество - РезервПоДругимДокументам;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам = 0;
					Иначе
						НоваяСтрока.Резерв = 0;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам =
							СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам
							- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
					КонецЕсли;
				Иначе
					НоваяСтрока.Количество = ОстатокНаСкладе+ТекРасходПоРезерву;
					КоличествоДляРаспределения = КоличествоДляРаспределения - НоваяСтрока.Количество;
					СтрокаМассиваСтрокОстатки.КоличествоОстаток = 0;
							
					Если НоваяСтрока.Количество > РезервПоДругимДокументам Тогда
						НоваяСтрока.Резерв = (ОстатокНаСкладе + РасходПоРезерву) - РезервПоДругимДокументам;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам = 0;
					Иначе
						НоваяСтрока.Резерв = 0;
						СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам =
							СтрокаМассиваСтрокОстатки.РезервПоДругимДокументам
							- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаУдалена = НайденаСтрокаСТакимЖеСкладомОбработанаТекущаяИУдаленаЗаказНаПроизводство(
					СтрокиКУдалению,НоваяСтрока, МассивОбработанныхСтрок);
				
				Если Не СтрокаУдалена Тогда
					МассивОбработанныхСтрок.Добавить(НоваяСтрока);
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				
				Если КоличествоДляРаспределения = 0 Тогда Прервать КонецЕсли;
				
			КонецЦикла;
			
			ПоследняяСтрокаМассива = ?(МассивОбработанныхСтрок.Количество(),
				МассивОбработанныхСтрок[МассивОбработанныхСтрок.Количество() - 1], Неопределено);
			
			ПоследняяСтрока = ПоследняяСтрокаМассива;
			
			Если КоличествоДляРаспределения > 0 И Не ПоследняяСтрокаМассива = Неопределено Тогда
				ПоследняяСтрока.Количество = ПоследняяСтрока.Количество + КоличествоДляРаспределения;
			КонецЕсли;
			
		КонецЕсли;
		
		ОчиститьПриоритеты(ТаблицаОстатков);
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Объект[ИмяТЧ].Удалить(СтрокаКУдалению);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонку "В резерв" табличной части документа Заказ покупателя без распределения по остаткам на других складах
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  ПараметрыОтбора - Структура, Неопределено - Параметры отбора
//  ИмяТЧ - Строка - Имя ТЧ
//  ТипДокумента - Строка - Тип документа
Процедура ЗаполнитьКолонкуРезервПоОстаткамЗаказПокупателяБезРазбиения(Объект, ПараметрыОтбора = Неопределено,
	ИмяТЧ = "Запасы", ТипДокумента = "ЗаказПокупателя") Экспорт
	
	Если ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = Новый Структура;
	КонецЕсли;
	ПараметрыОтбора.Вставить("ЭтоРазделитель", Ложь);
	
	Строки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
	Для каждого Строка Из Строки Цикл
		Строка.Резерв = 0;
	КонецЦикла;
	
	СтрокиДляВыгрузки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
	ТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки,
		"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв");
	ТаблицаЗапасы.Свернуть("Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаРезервПоОстаткамЗаказПокупателяБезРазбиения();
		
	Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаРезерв);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Запрос.УстановитьПараметр("Организации", ИнтеркампаниСервер.ОрганизацииОстатков(Объект.Организация));
	Иначе
		Запрос.УстановитьПараметр("Организации", 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Константы.УчетПоКомпании.Компания(Объект.Организация)));
	КонецЕсли; 
	
	ТаблицаПериодов = Новый ТаблицаЗначений();
	ТаблицаПериодов.Колонки.Добавить("ДатаОтгрузки");
	ТаблицаПериодов.Колонки.Добавить("СтрокаЗапасы");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РезервДругимиДокументамиБазовыеЕдиницы = Выборка.РезервДругимиДокументами;
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		СтруктураДляПоиска.Вставить("СтруктурнаяЕдиницаРезерв", Выборка.СтруктурнаяЕдиницаРезерв);
		
		Для каждого КлючИЗначение Из ПараметрыОтбора Цикл
			Если СтруктураДляПоиска.Свойство(КлючИЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураДляПоиска.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		МассивСтрокЗапасы = Объект[ИмяТЧ].НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			НоваяСтрока = ТаблицаПериодов.Добавить();
			НоваяСтрока.ДатаОтгрузки = СтрокаЗапасы.ДатаОтгрузки;
			НоваяСтрока.СтрокаЗапасы = СтрокаЗапасы;
		КонецЦикла;
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		ТаблицаПериодов.Сортировать("ДатаОтгрузки");
		Для каждого СтрокаТаблицыПериодов Из ТаблицаПериодов Цикл
			СтрокаЗапасы = СтрокаТаблицыПериодов.СтрокаЗапасы;
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.ЕдиницаИзмерения)
				Или ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
				Тогда 
				КоэффициентЕдиницыИзмерения = 1;
			Иначе
				КоэффициентЕдиницыИзмерения = СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			
			ВсегоОстаток =
				?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"),
					ВсегоОстаток, ВсегоОстаток / КоэффициентЕдиницыИзмерения);
			Количество = СтрокаЗапасы.Количество;
			
			Если РезервДругимиДокументамиБазовыеЕдиницы > 0 Тогда
				
				РезервДругимиДокументами = РезервДругимиДокументамиБазовыеЕдиницы/КоэффициентЕдиницыИзмерения;
				
				Если РезервДругимиДокументами>=Количество Тогда
					РезервДругимиДокументамиБазовыеЕдиницы = РезервДругимиДокументамиБазовыеЕдиницы
						- Количество*КоэффициентЕдиницыИзмерения;
					Продолжить
				Иначе
					Количество = Количество - РезервДругимиДокументами;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Количество >= ВсегоОстаток Тогда
				СтрокаЗапасы.Резерв = ВсегоОстаток;
				ВсегоОстаток = 0;
			Иначе
				СтрокаЗапасы.Резерв = Количество;
				ВсегоОстаток = ВсегоОстаток - Количество;
				ВсегоОстаток =
					?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"),
						ВсегоОстаток, ВсегоОстаток * КоэффициентЕдиницыИзмерения);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПериодов.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет количество по Остаткам и резервам в документе Расходная накладная
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  ПараметрыОтбора - Структура, Неопределено - Параметры отбора
//  СтруктураОтбораНоменклатуры - Структура, Неопределено - Структура отбора номенклатуры
//  ИмяТЧ - Строка - Имя ТЧ
Процедура ЗаполнитьКоличествоПоОстаткамИРезервамПродажа(Объект, ПараметрыОтбора = Неопределено,
	СтруктураОтбораНоменклатуры = Неопределено, ИмяТЧ = "Запасы") Экспорт
	
	ЭтоЗаказНаряд = Ложь;
	
	ЭтоЧекККМ = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ"), Истина, Ложь);
	НеРасчитыватьВес = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") И ИмяТЧ = "Материалы";
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЭтоЗаказНаряд = Истина;
		ИмяСтруктурнойЕдиницы = "СтруктурнаяЕдиницаРезерв"
	Иначе
		ИмяСтруктурнойЕдиницы = "СтруктурнаяЕдиница"
	КонецЕсли;
	
	Если СтруктураОтбораНоменклатуры = Неопределено Тогда
		СтруктураОтбораНоменклатуры = Новый Структура;
	КонецЕсли;
	
	Для каждого Строка Из Объект[ИмяТЧ] Цикл
		Строка.Резерв = 0;
	КонецЦикла;
	
	Для Каждого СтрокаЗапасы Из Объект[ИмяТЧ] Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЗапасы.Количество) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке: %1 не заполнено количество.'"),
				СтрокаЗапасы.НомерСтроки);
			КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасы.НомерСтроки,
				"Количество");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, КонтекстноеПоле); 
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиДляВыгрузки = Объект[ИмяТЧ].НайтиСтроки(СтруктураОтбораНоменклатуры);

	Если ЭтоЗаказНаряд Тогда
		Если ИмяТЧ = "Запасы" Тогда
			СтрокаКолонокДляЗапроса =
				"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв, ТипНоменклатурыЗапас";
			СтрокаКолонокДляОбхода = "Номенклатура, Характеристика, Цена, ЕдиницаИзмерения, Партия";
			СтрокаСуммКолонокДляОбхода = "Количество, РезервОтгрузка, Вес, Объем";
		Иначе
			СтрокаКолонокДляЗапроса = "Номенклатура, Характеристика, Партия, СтруктурнаяЕдиницаРезерв";
			СтрокаКолонокДляОбхода = "Номенклатура, Характеристика, ЕдиницаИзмерения, Партия";
			СтрокаСуммКолонокДляОбхода = "Количество, РезервОтгрузка";
		КонецЕсли;
		
	Иначе
		СтрокаКолонокДляЗапроса =
			"Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, Заказ, ТипНоменклатурыЗапас";
		СтрокаКолонокДляОбхода = "Номенклатура, Характеристика, Цена, ЕдиницаИзмерения, Партия, Заказ";
		
		Если ЭтоЧекККМ Тогда
			СтрокаСуммКолонокДляОбхода = "Количество, Резерв";
		Иначе
			СтрокаСуммКолонокДляОбхода = "Количество, Резерв, Вес, Объем";
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки, СтрокаКолонокДляЗапроса);
	ТаблицаЗапасы.Свернуть(СтрокаКолонокДляЗапроса);
	
	СвернутаяТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(, СтрокаКолонокДляОбхода + "," + СтрокаСуммКолонокДляОбхода);
	СвернутаяТаблицаЗапасы.Свернуть(СтрокаКолонокДляОбхода, СтрокаСуммКолонокДляОбхода);
	
	Если ЭтоЗаказНаряд Тогда
		Заказ = Объект.Ссылка;
	Иначе
		Заказ = ?(ЗначениеЗаполнено(Объект.Заказ), Объект.Заказ, Документы.ЗаказПокупателя.ПустаяСсылка());
	КонецЕсли;
	
	ЗаказДляТЧ = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	
	Если ТаблицаЗапасы.Колонки.Найти("Заказ") = Неопределено Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		
		ТаблицаЗапасы.Колонки.Добавить("Заказ", ОписаниеТипов);
		СвернутаяТаблицаЗапасы.Колонки.Добавить("Заказ", ОписаниеТипов);
		
		Для Каждого СтрокаТаблицы Из ТаблицаЗапасы Цикл
			СтрокаТаблицы.Заказ = ЗаказДляТЧ;
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из СвернутаяТаблицаЗапасы Цикл
			СтрокаТаблицы.Заказ = ЗаказДляТЧ;
		КонецЦикла;
		
		КолонкаСтруктурнойЕдиницы = ТаблицаЗапасы.Колонки.Найти("СтруктурнаяЕдиницаРезерв");
		
		Если Не КолонкаСтруктурнойЕдиницы = Неопределено Тогда
			КолонкаСтруктурнойЕдиницы.Имя = "СтруктурнаяЕдиница";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаЗапасы.Колонки.Найти("ТипНоменклатурыЗапас") = Неопределено Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		
		ТаблицаЗапасы.Колонки.Добавить("ТипНоменклатурыЗапас", ОписаниеТипов);
		
		Для Каждого СтрокаТаблицы Из ТаблицаЗапасы Цикл
			СтрокаТаблицы.ТипНоменклатурыЗапас = Истина;
		КонецЦикла;
		
	КонецЕсли;
		
	МассивНоменклатуры = ТаблицаЗапасы.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаЗаполнитьКоличествоПоОстаткамИРезервам();
	
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Организации = ИнтеркампаниСервер.ОрганизацииОстатков(Объект.Организация);
	Иначе
		Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Константы.УчетПоКомпании.Компания(
			Объект.Организация));
	КонецЕсли;
	
	Если ЭтоЗаказНаряд Тогда
		ЗаказВШапке = Истина
	Иначе
		ЗаказВШапке = ?(Объект.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
			Истина, Ложь)
	КонецЕсли;
	
	СкладВШапке = ?(Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, Истина, Ложь);
	
	ЭтоПриоритетныйСклад = ?(ЭтоЗаказНаряд, Объект.СтруктурнаяЕдиницаРезерв, Объект.СтруктурнаяЕдиница);
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы",          ТаблицаЗапасы);
	Запрос.УстановитьПараметр("Ссылка",                 Объект.Ссылка);
	Запрос.УстановитьПараметр("Организации",            Организации);
	Запрос.УстановитьПараметр("ПриоритетныйСклад",      ЭтоПриоритетныйСклад);
	Запрос.УстановитьПараметр("ЗаказВШапке",            ЗаказВШапке);
	Запрос.УстановитьПараметр("Заказ",                  Заказ);
	Запрос.УстановитьПараметр("МассивНоменклатуры",     МассивНоменклатуры);
	Запрос.УстановитьПараметр("ОтборПоСкладам",         Ложь);
	Запрос.УстановитьПараметр("СписокДоступныхСкладов", Неопределено);
	
	Если ПараметрыОтбора <> Неопределено Тогда
		Если ПараметрыОтбора.Свойство("СписокДоступныхСкладов") Тогда
			Запрос.УстановитьПараметр("ОтборПоСкладам", Истина);
			Запрос.УстановитьПараметр("СписокДоступныхСкладов", ПараметрыОтбора.СписокДоступныхСкладов);
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	УчетПоЯчейкам = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	
	Если УчетПоЯчейкам Тогда
		СтруктураПараметров = Новый Структура("Номенклатура, Организация, Регистратор",
			МассивНоменклатуры, Организации, Объект.Ссылка);
		ОстаткиПоЯчейкам = ОстаткиПоЯчейкам(СтруктураПараметров, ТаблицаЗапасы);
	КонецЕсли;
	
	СтруктураДляПоиска = Новый Структура;
	СтруктураДляПоиска.Вставить("Номенклатура");
	СтруктураДляПоиска.Вставить("Характеристика");
	СтруктураДляПоиска.Вставить("Партия");
	Если ИмяТЧ = "Запасы" Тогда
		СтруктураДляПоиска.Вставить("Цена");
	КонецЕсли;
	СтруктураДляПоиска.Вставить("ЕдиницаИзмерения");
	
	Если Не ЭтоЗаказНаряд Тогда
		СтруктураДляПоиска.Вставить("Заказ");
	КонецЕсли;
	
	СтруктураДляПоискаБезДатыОтгрузки = Новый Структура;
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Номенклатура");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Характеристика");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Партия");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Заказ");
	
	СтруктураДляПоискаПоСкладу = Новый Структура;
	СтруктураДляПоискаПоСкладу.Вставить("Номенклатура");
	СтруктураДляПоискаПоСкладу.Вставить("Характеристика");
	СтруктураДляПоискаПоСкладу.Вставить("Партия");
	СтруктураДляПоискаПоСкладу.Вставить("СтруктурнаяЕдиница");
	СтруктураДляПоискаПоСкладу.Вставить("Заказ");
	
	СтруктураДляПоискаПоСкладуБезЗаказа = Новый Структура;
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("Номенклатура");
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("Характеристика");
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("Партия");
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("СтруктурнаяЕдиница");
	
	Если УчетПоЯчейкам Тогда
		СтруктураДляПоискаПоЯчейкам = Новый Структура;
		СтруктураДляПоискаПоЯчейкам.Вставить("Номенклатура");
		СтруктураДляПоискаПоЯчейкам.Вставить("Характеристика");
		СтруктураДляПоискаПоЯчейкам.Вставить("Партия");
		СтруктураДляПоискаПоЯчейкам.Вставить("СтруктурнаяЕдиница");
		СтруктураДляПоискаПоЯчейкам.Вставить("Ячейка");
	КонецЕсли;
	
	Для Каждого СтрокаТабЗапасы Из СвернутаяТаблицаЗапасы Цикл
		
		Если НЕ ТипЗнч(СтрокаТабЗапасы.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			Или Не ЗначениеЗаполнено(СтрокаТабЗапасы.Номенклатура) Тогда 
			Продолжить
		КонецЕсли;
		
		Если Не ЭтоЧекККМ И СтрокаТабЗапасы.Количество > 0 И НЕ НеРасчитыватьВес  Тогда
			ВесЕдиницы = Окр(СтрокаТабЗапасы.Вес/СтрокаТабЗапасы.Количество, 4, РежимОкругления.Окр15как20);
			ОбъемЕдиницы = Окр(СтрокаТабЗапасы.Объем/СтрокаТабЗапасы.Количество, 4, РежимОкругления.Окр15как20);
		Иначе
			ВесЕдиницы = 0;
			ОбъемЕдиницы = 0;
		КонецЕсли;
		
		СтруктураДляПоиска.Номенклатура = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоиска.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоиска.Партия = СтрокаТабЗапасы.Партия;
		Если ИмяТЧ = "Запасы" Тогда
			СтруктураДляПоиска.Цена = СтрокаТабЗапасы.Цена;
		КонецЕсли;
		СтруктураДляПоиска.ЕдиницаИзмерения = СтрокаТабЗапасы.ЕдиницаИзмерения;
		
		Если Не ЭтоЗаказНаряд Тогда
			Если ЗначениеЗаполнено(СтрокаТабЗапасы.Заказ) Тогда
				СтруктураДляПоиска.Заказ = СтрокаТабЗапасы.Заказ;
			ИначеЕсли ЗначениеЗаполнено(Объект.Заказ) Тогда
				СтруктураДляПоиска.Заказ = Объект.Заказ;
			Иначе
				СтруктураДляПоиска.Заказ = СтрокаТабЗапасы.Заказ;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураДляПоискаБезДатыОтгрузки.Номенклатура = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоискаБезДатыОтгрузки.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоискаБезДатыОтгрузки.Партия = СтрокаТабЗапасы.Партия;
		СтруктураДляПоискаБезДатыОтгрузки.Заказ =
			?(Не ТипЗнч(СтрокаТабЗапасы.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя"),
				Документы.ЗаказПокупателя.ПустаяСсылка(), СтрокаТабЗапасы.Заказ);
		
		МассивСтрокОстаткиОбщие = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаБезДатыОтгрузки);
		
		МассивСтрокЗапасы = Объект[ИмяТЧ].НайтиСтроки(СтруктураДляПоиска);
		
		КоличествоДляРаспределения = 0;
		Для Каждого СтрокаМассива Из МассивСтрокЗапасы Цикл
			КоличествоДляРаспределения = КоличествоДляРаспределения + СтрокаМассива.Количество;
		КонецЦикла;
		
		СтрокиКУдалению = Новый Массив;
		МассивОбработанныхСтрок = Новый Массив;
		
		Для Каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			Если ЭтоЗаказНаряд Тогда
				ЗаказТЧ = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
			Иначе
				ЗаказТЧ = СтрокаЗапасы.Заказ;
			КонецЕсли;
			
			СтрокаУдалена = НайденИУдаленДубльТекущейСтроки(СтрокиКУдалению,СтрокаЗапасы, МассивОбработанныхСтрок,
				, ИмяСтруктурнойЕдиницы, ИмяТЧ);
			
			Если СтрокаУдалена Тогда Продолжить КонецЕсли;
			
			СтруктурнаяЕдиницаДляПоиска = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			Если СкладВШапке И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
				СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиница;
			ИначеЕсли Не СкладВШапке И ЗначениеЗаполнено(СтрокаЗапасы[ИмяСтруктурнойЕдиницы]) Тогда
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы[ИмяСтруктурнойЕдиницы];
			ИначеЕсли Не СкладВШапке Тогда
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
				СтрокаЗапасы[ИмяСтруктурнойЕдиницы] = СтруктурнаяЕдиницаДляПоиска;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗаказТЧ) Тогда
				СтруктураДляПоискаПоСкладу.Заказ = ЗаказТЧ;
			Иначе
				СтруктураДляПоискаПоСкладу.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.ЕдиницаИзмерения)
				Или ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
				Тогда 
				КоэффициентЕдиницыИзмерения = 1;
			Иначе
				КоэффициентЕдиницыИзмерения = СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктурнаяЕдиницаДляПоиска) Тогда
				
				СтруктураДляПоискаПоСкладу.Номенклатура = СтрокаТабЗапасы.Номенклатура;
				СтруктураДляПоискаПоСкладу.Характеристика = СтрокаТабЗапасы.Характеристика;
				СтруктураДляПоискаПоСкладу.Партия = СтрокаТабЗапасы.Партия;
				СтруктураДляПоискаПоСкладу.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
				
				МассивСтрокОстатки = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаПоСкладу);
				
				Если МассивСтрокОстатки.Количество() И МассивСтрокОстатки[0].КоличествоОстаток = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
					Продолжить;
				КонецЕсли;
				
				Если Не МассивСтрокОстатки.Количество() Тогда
					Если МассивСтрокОстаткиОбщие.Количество() Тогда
						СтрокиКУдалению.Добавить(СтрокаЗапасы);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				СтрокаОстатка = МассивСтрокОстатки[0];
				
				Если УчетПоЯчейкам Тогда
					
					СтруктураДляПоискаПоЯчейкам.Номенклатура       = СтрокаТабЗапасы.Номенклатура;
					СтруктураДляПоискаПоЯчейкам.Характеристика     = СтрокаТабЗапасы.Характеристика;
					СтруктураДляПоискаПоЯчейкам.Партия             = СтрокаТабЗапасы.Партия;
					СтруктураДляПоискаПоЯчейкам.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
					СтруктураДляПоискаПоЯчейкам.Ячейка             = СтрокаЗапасы.Ячейка;
					
					МассивСтрокОстатки = ОстаткиПоЯчейкам.НайтиСтроки(СтруктураДляПоискаПоЯчейкам);
					
					Если МассивСтрокОстатки.Количество() Тогда
						СтрокаПоЯчейке = МассивСтрокОстатки[0];
						КоличествоОстаток = СтрокаПоЯчейке.ОстатокСУчетомДвижения/КоэффициентЕдиницыИзмерения;
					Иначе
						КоличествоОстаток = 0;
					КонецЕсли
					
				Иначе
					КоличествоОстаток = СтрокаОстатка.КоличествоОстаток/КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
				Если КоличествоДляРаспределения <= КоличествоОстаток Тогда
					СтрокаЗапасы.Количество = КоличествоДляРаспределения;
				Иначе
					СтрокаЗапасы.Количество = КоличествоОстаток;
				КонецЕсли;
				
				Если Не ЭтоЧекККМ И Не НеРасчитыватьВес Тогда
					СтрокаЗапасы.Вес = Окр(СтрокаЗапасы.Количество * ВесЕдиницы, 4, РежимОкругления.Окр15как20);
					СтрокаЗапасы.Объем = Окр(СтрокаЗапасы.Количество * ОбъемЕдиницы, 4,
						РежимОкругления.Окр15как20);
				КонецЕсли;
				
				Если УчетПоЯчейкам И МассивСтрокОстатки.Количество() Тогда
					СтрокаПоЯчейке.ОстатокСУчетомДвижения = СтрокаПоЯчейке.ОстатокСУчетомДвижения
						- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
				ВсегоРезерва = СтрокаОстатка.ВсегоРезерва/КоэффициентЕдиницыИзмерения;
				
				Если СтрокаЗапасы.Количество > ВсегоРезерва Тогда 
					СтрокаЗапасы.Резерв = ВсегоРезерва;
					СтрокаОстатка.ВсегоРезерва = 0;
				Иначе
					СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
					СтрокаОстатка.ВсегоРезерва = СтрокаОстатка.ВсегоРезерва
						- СтрокаЗапасы.Резерв*КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
				СтрокаОстатка.КоличествоОстаток = СтрокаОстатка.КоличествоОстаток
					- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
				
				КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.Количество;
				
				Если СтрокаЗапасы.Количество = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				Иначе
					МассивОбработанныхСтрок.Добавить(СтрокаЗапасы);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоДляРаспределения > 0 И МассивСтрокОстаткиОбщие.Количество() Тогда
			
			Если Не ЗначениеЗаполнено(СтруктурнаяЕдиницаДляПоиска) Тогда
				
				Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
					СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиница;
				Иначе
					СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
					СтрокаЗапасы[ИмяСтруктурнойЕдиницы] = СтруктурнаяЕдиницаДляПоиска;
				КонецЕсли;
				
			КонецЕсли;
			
			ПодготовитьТаблицуСогласноПриоритетам(ТаблицаОстатков, СтруктурнаяЕдиницаДляПоиска);
			
			НоваяСтрока = Неопределено;
			
			МассивСтрокОбходаСкладов = Новый Массив;
			
			Для каждого СтрокаМассиваСтрокОстатки Из МассивСтрокОстаткиОбщие Цикл
				
				ОстатокНаСкладе = СтрокаМассиваСтрокОстатки.КоличествоОстаток;
				
				Если ОстатокНаСкладе = 0 Тогда Продолжить КонецЕсли;
				Если КоличествоДляРаспределения = 0 Тогда Прервать КонецЕсли;
				
				МассивСтрокОбходаСкладов.Очистить();
				
				Если УчетПоЯчейкам Тогда
					СтруктураДляПоискаПоСкладуБезЗаказа.Номенклатура = СтрокаМассиваСтрокОстатки.Номенклатура;
					СтруктураДляПоискаПоСкладуБезЗаказа.Характеристика = СтрокаМассиваСтрокОстатки.Характеристика;
					СтруктураДляПоискаПоСкладуБезЗаказа.Партия = СтрокаМассиваСтрокОстатки.Партия;
					СтруктураДляПоискаПоСкладуБезЗаказа.СтруктурнаяЕдиница =
						СтрокаМассиваСтрокОстатки.СтруктурнаяЕдиница;
					
					СтрокиОбходаСкладов = ОстаткиПоЯчейкам.НайтиСтроки(СтруктураДляПоискаПоСкладуБезЗаказа);
					
					Если Не СтрокиОбходаСкладов.Количество() Тогда
						МассивСтрокОбходаСкладов.Добавить(СтрокаМассиваСтрокОстатки);
					Иначе
						Для Каждого НайденнаяСтрока Из СтрокиОбходаСкладов Цикл
							МассивСтрокОбходаСкладов.Добавить(НайденнаяСтрока);
						КонецЦикла;
					КонецЕсли;
					
				Иначе
					МассивСтрокОбходаСкладов.Добавить(СтрокаМассиваСтрокОстатки);
				КонецЕсли;
				
				НомерСтроки = СтрокаЗапасы.НомерСтроки;
				
				Для Каждого СтрокаОбхода Из МассивСтрокОбходаСкладов Цикл
					
					НоваяСтрока = Объект[ИмяТЧ].Вставить(НомерСтроки);
					НомерСтроки = НомерСтроки + 1;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗапасы);
					
					НоваяСтрока.Количество = 0;
					НоваяСтрока.Резерв = 0;
					НоваяСтрока.Ячейка = Неопределено;
					
					Если УчетПоЯчейкам Тогда 
						НоваяСтрока.Ячейка = СтрокаОбхода.Ячейка;
						ОстатокНаСкладе = СтрокаОбхода.ОстатокСУчетомДвижения / КоэффициентЕдиницыИзмерения;
					Иначе
						ОстатокНаСкладе = СтрокаОбхода.КоличествоОстаток / КоэффициентЕдиницыИзмерения;
					КонецЕсли;
					
					НоваяСтрока[ИмяСтруктурнойЕдиницы] = СтрокаМассиваСтрокОстатки.СтруктурнаяЕдиница;
					
					ВсегоРезерва = СтрокаМассиваСтрокОстатки.ВсегоРезерва/КоэффициентЕдиницыИзмерения;
					
					Если ОстатокНаСкладе > КоличествоДляРаспределения Тогда
						
						ЗначениеРезерва = 0;
						
						НоваяСтрока.Количество = КоличествоДляРаспределения;
						
						Если СтрокаМассиваСтрокОстатки.ВсегоРезерва > 0 Тогда
							ЗначениеРезерва = ?(ВсегоРезерва > НоваяСтрока.Количество, НоваяСтрока.Количество, ВсегоРезерва);
						КонецЕсли;
						
						НоваяСтрока.Резерв = ЗначениеРезерва;
						
						СтрокаМассиваСтрокОстатки.КоличествоОстаток = СтрокаМассиваСтрокОстатки.КоличествоОстаток
							- КоличествоДляРаспределения*КоэффициентЕдиницыИзмерения;
						КоличествоДляРаспределения = 0;
						СтрокаМассиваСтрокОстатки.ВсегоРезерва = СтрокаМассиваСтрокОстатки.ВсегоРезерва
							- НоваяСтрока.Резерв*КоэффициентЕдиницыИзмерения;
						
						Если УчетПоЯчейкам Тогда
							СтрокаОбхода.ОстатокСУчетомДвижения = СтрокаОбхода.ОстатокСУчетомДвижения
								- КоличествоДляРаспределения*КоэффициентЕдиницыИзмерения
							КонецЕсли;
						
						Если НоваяСтрока.Количество = 0 Тогда
							СтрокиКУдалению.Добавить(НоваяСтрока);
						Иначе
							МассивОбработанныхСтрок.Добавить(НоваяСтрока);
						КонецЕсли;
						
						Прервать;
					Иначе
						
						ЗначениеРезерва = 0;
						
						НоваяСтрока.Количество = ОстатокНаСкладе;
						
						Если ВсегоРезерва > 0 Тогда
							ЗначениеРезерва = ?(ВсегоРезерва > НоваяСтрока.Количество,
								НоваяСтрока.Количество, ВсегоРезерва);
						КонецЕсли;
						СтрокаМассиваСтрокОстатки.ВсегоРезерва = СтрокаМассиваСтрокОстатки.ВсегоРезерва
							- ЗначениеРезерва;
						
						НоваяСтрока.Резерв = ЗначениеРезерва;
						КоличествоДляРаспределения = КоличествоДляРаспределения - ОстатокНаСкладе;
						СтрокаМассиваСтрокОстатки.КоличествоОстаток = 0;
						Если УчетПоЯчейкам Тогда СтрокаОбхода.ОстатокСУчетомДвижения = 0 КонецЕсли;
						
					КонецЕсли;
					
					Если Не ЭтоЧекККМ И НЕ НеРасчитыватьВес Тогда
						НоваяСтрока.Вес = Окр(НоваяСтрока.Количество * ВесЕдиницы, 4, РежимОкругления.Окр15как20);
						НоваяСтрока.Объем = Окр(НоваяСтрока.Количество * ОбъемЕдиницы, 4,
							РежимОкругления.Окр15как20);
					КонецЕсли;
					
					СтрокаУдалена = НайденИУдаленДубльТекущейСтроки(СтрокиКУдалению,НоваяСтрока,
						МассивОбработанныхСтрок, Истина, ИмяСтруктурнойЕдиницы,ИмяТЧ);
					
					Если Не СтрокаУдалена Тогда
						МассивОбработанныхСтрок.Добавить(НоваяСтрока);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			ПоследняяСтрокаМассива = ?(МассивОбработанныхСтрок.Количество(),
				МассивОбработанныхСтрок[МассивОбработанныхСтрок.Количество() - 1], Неопределено);
			
			ПоследняяСтрока = ПоследняяСтрокаМассива;
			
			Если КоличествоДляРаспределения > 0 И Не ПоследняяСтрока = Неопределено Тогда
				ПоследняяСтрока.Количество = ПоследняяСтрока.Количество + КоличествоДляРаспределения;
				
				Если Не ЭтоЧекККМ И НЕ НеРасчитыватьВес Тогда
					ПоследняяСтрока.Вес = Окр(ПоследняяСтрока.Количество * ВесЕдиницы, 4,
						РежимОкругления.Окр15как20);
					ПоследняяСтрока.Объем = Окр(ПоследняяСтрока.Количество * ОбъемЕдиницы, 4,
						РежимОкругления.Окр15как20);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОчиститьПриоритеты(ТаблицаОстатков);
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Объект[ИмяТЧ].Удалить(СтрокаКУдалению);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет количество по Остаткам и резервам в документе Производство
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура
//  ПараметрыОтбора - Структура, Неопределено - Параметры отбора
Процедура ЗаполнитьКоличествоПоОстаткамИРезервамПроизводство(Объект, ПараметрыОтбора = Неопределено) Экспорт
	
	ИмяТЧ = "Запасы";
	ИмяСтруктурнойЕдиницы = "СтруктурнаяЕдиница";
	
	Если ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = Новый Структура;
	КонецЕсли;
	
	Для каждого Строка Из Объект[ИмяТЧ] Цикл
		Строка.Резерв = 0;
	КонецЦикла;
	
	Для Каждого СтрокаЗапасы Из Объект[ИмяТЧ] Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЗапасы.Количество) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке: %1 не заполнено количество.'"),
				СтрокаЗапасы.НомерСтроки);
			КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасы.НомерСтроки,
				"Количество");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, КонтекстноеПоле); 
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиДляВыгрузки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);

	СтрокаКолонокДляЗапроса = "Номенклатура, Характеристика, Партия, СтруктурнаяЕдиница, ЗаказПокупателя";
	СтрокаКолонокДляОбхода = "Номенклатура, Характеристика, ЕдиницаИзмерения, Партия, ЗаказПокупателя";
	СтрокаСуммКолонокДляОбхода = "Количество, Резерв";
	
	ТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(СтрокиДляВыгрузки, СтрокаКолонокДляЗапроса);
	ТаблицаЗапасы.Свернуть(СтрокаКолонокДляЗапроса);
	
	СвернутаяТаблицаЗапасы = Объект[ИмяТЧ].Выгрузить(,СтрокаКолонокДляОбхода + "," + СтрокаСуммКолонокДляОбхода);
	СвернутаяТаблицаЗапасы.Свернуть(СтрокаКолонокДляОбхода, СтрокаСуммКолонокДляОбхода);
	
	Заказ = Объект.ЗаказПокупателя;
	
	КолонкаЗаказ = ТаблицаЗапасы.Колонки.Найти("ЗаказПокупателя"); 
	КолонкаЗаказ.Имя = "Заказ";
	
	Если ТаблицаЗапасы.Колонки.Найти("ТипНоменклатурыЗапас") = Неопределено Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		
		ТаблицаЗапасы.Колонки.Добавить("ТипНоменклатурыЗапас", ОписаниеТипов);
		
		Для Каждого СтрокаТаблицы Из ТаблицаЗапасы Цикл
			СтрокаТаблицы.ТипНоменклатурыЗапас = Истина;
		КонецЦикла;
		
	КонецЕсли;
		
	МассивНоменклатуры = ТаблицаЗапасы.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаЗаполнитьКоличествоПоОстаткамИРезервам();
		
	Организация = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	ЗаказВШапке = Объект.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы",          ТаблицаЗапасы);
	Запрос.УстановитьПараметр("Ссылка",                 Объект.Ссылка);
	Запрос.УстановитьПараметр("Организации",            ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	Запрос.УстановитьПараметр("ПриоритетныйСклад",      Объект.СтруктурнаяЕдиницаЗапасов);
	Запрос.УстановитьПараметр("ЗаказВШапке",            ЗаказВШапке);
	Запрос.УстановитьПараметр("Заказ",                  Заказ);
	Запрос.УстановитьПараметр("МассивНоменклатуры",     МассивНоменклатуры);
	Запрос.УстановитьПараметр("ОтборПоСкладам",         Ложь);
	Запрос.УстановитьПараметр("СписокДоступныхСкладов", Неопределено);
	
	Если ПараметрыОтбора <> Неопределено Тогда
		Если ПараметрыОтбора.Свойство("СписокДоступныхСкладов") Тогда
			Запрос.УстановитьПараметр("ОтборПоСкладам", Истина);
			Запрос.УстановитьПараметр("СписокДоступныхСкладов", ПараметрыОтбора.СписокДоступныхСкладов);
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	УчетПоЯчейкам = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	
	Если УчетПоЯчейкам Тогда
		СтруктураПараметров = Новый Структура("Номенклатура, Организация, Регистратор",
			МассивНоменклатуры, Организация, Объект.Ссылка);
		ОстаткиПоЯчейкам = ОстаткиПоЯчейкам(СтруктураПараметров, ТаблицаЗапасы);
	КонецЕсли;
	
	СтруктураДляПоиска = Новый Структура;
	СтруктураДляПоиска.Вставить("Номенклатура");
	СтруктураДляПоиска.Вставить("Характеристика");
	СтруктураДляПоиска.Вставить("Партия");
	СтруктураДляПоиска.Вставить("ЕдиницаИзмерения");
	СтруктураДляПоиска.Вставить("ЗаказПокупателя");
	
	СтруктураДляПоискаБезДатыОтгрузки = Новый Структура;
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Номенклатура");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Характеристика");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Партия");
	СтруктураДляПоискаБезДатыОтгрузки.Вставить("Заказ");
	
	СтруктураДляПоискаПоСкладу = Новый Структура;
	СтруктураДляПоискаПоСкладу.Вставить("Номенклатура");
	СтруктураДляПоискаПоСкладу.Вставить("Характеристика");
	СтруктураДляПоискаПоСкладу.Вставить("Партия");
	СтруктураДляПоискаПоСкладу.Вставить("СтруктурнаяЕдиница");
	СтруктураДляПоискаПоСкладу.Вставить("Заказ");
	
	СтруктураДляПоискаПоСкладуБезЗаказа = Новый Структура;
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("Номенклатура");
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("Характеристика");
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("Партия");
	СтруктураДляПоискаПоСкладуБезЗаказа.Вставить("СтруктурнаяЕдиница");
	
	Если УчетПоЯчейкам Тогда
		СтруктураДляПоискаПоЯчейкам = Новый Структура;
		СтруктураДляПоискаПоЯчейкам.Вставить("Номенклатура");
		СтруктураДляПоискаПоЯчейкам.Вставить("Характеристика");
		СтруктураДляПоискаПоЯчейкам.Вставить("Партия");
		СтруктураДляПоискаПоЯчейкам.Вставить("СтруктурнаяЕдиница");
		СтруктураДляПоискаПоЯчейкам.Вставить("Ячейка");
	КонецЕсли;
	
	Для Каждого СтрокаТабЗапасы Из СвернутаяТаблицаЗапасы Цикл
		
		Если НЕ ТипЗнч(СтрокаТабЗапасы.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			Или Не ЗначениеЗаполнено(СтрокаТабЗапасы.Номенклатура) Тогда 
			Продолжить
		КонецЕсли;
		
		СтруктураДляПоиска.Номенклатура = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоиска.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоиска.Партия = СтрокаТабЗапасы.Партия;
		СтруктураДляПоиска.ЕдиницаИзмерения = СтрокаТабЗапасы.ЕдиницаИзмерения;
		
		Если ЗначениеЗаполнено(СтрокаТабЗапасы.ЗаказПокупателя) Тогда
			СтруктураДляПоиска.ЗаказПокупателя = СтрокаТабЗапасы.ЗаказПокупателя;
		Иначе
			СтруктураДляПоиска.ЗаказПокупателя = Объект.ЗаказПокупателя;
		КонецЕсли;
		
		СтруктураДляПоискаБезДатыОтгрузки.Номенклатура = СтрокаТабЗапасы.Номенклатура;
		СтруктураДляПоискаБезДатыОтгрузки.Характеристика = СтрокаТабЗапасы.Характеристика;
		СтруктураДляПоискаБезДатыОтгрузки.Партия = СтрокаТабЗапасы.Партия;
		СтруктураДляПоискаБезДатыОтгрузки.Заказ = ?(СтрокаТабЗапасы.ЗаказПокупателя = Неопределено,
			Документы.ЗаказПокупателя.ПустаяСсылка(), СтрокаТабЗапасы.ЗаказПокупателя);
		
		МассивСтрокОстаткиОбщие = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаБезДатыОтгрузки);
		
		МассивСтрокЗапасы = Объект[ИмяТЧ].НайтиСтроки(СтруктураДляПоиска);
		
		КоличествоДляРаспределения = 0;
		Для Каждого СтрокаМассива Из МассивСтрокЗапасы Цикл
			КоличествоДляРаспределения = КоличествоДляРаспределения + СтрокаМассива.Количество;
		КонецЦикла;
		
		СтрокиКУдалению = Новый Массив;
		МассивОбработанныхСтрок = Новый Массив;
		
		Для Каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			ЗаказТЧ = СтрокаЗапасы.ЗаказПокупателя;
			
			СтрокаУдалена = НайденИУдаленДубльТекущейСтроки(СтрокиКУдалению, СтрокаЗапасы,
				МассивОбработанныхСтрок, , ИмяСтруктурнойЕдиницы, ИмяТЧ, "Производство");
			
			Если СтрокаУдалена Тогда
				Продолжить
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЗапасы[ИмяСтруктурнойЕдиницы]) Тогда
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы[ИмяСтруктурнойЕдиницы];
			ИначеЕсли ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов) Тогда
				СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиницаЗапасов;
			Иначе
				СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
				СтрокаЗапасы[ИмяСтруктурнойЕдиницы] = СтруктурнаяЕдиницаДляПоиска;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗаказТЧ) Тогда
				СтруктураДляПоискаПоСкладу.Заказ = ЗаказТЧ;
			Иначе
				СтруктураДляПоискаПоСкладу.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.ЕдиницаИзмерения)
				Или ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
				Тогда 
				КоэффициентЕдиницыИзмерения = 1;
			Иначе
				КоэффициентЕдиницыИзмерения = СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктурнаяЕдиницаДляПоиска) Тогда
				
				СтруктураДляПоискаПоСкладу.Номенклатура = СтрокаТабЗапасы.Номенклатура;
				СтруктураДляПоискаПоСкладу.Характеристика = СтрокаТабЗапасы.Характеристика;
				СтруктураДляПоискаПоСкладу.Партия = СтрокаТабЗапасы.Партия;
				СтруктураДляПоискаПоСкладу.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
				
				МассивСтрокОстатки = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоискаПоСкладу);
				
				Если МассивСтрокОстатки.Количество() И МассивСтрокОстатки[0].КоличествоОстаток = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
					Продолжить;
				КонецЕсли;
				
				Если Не МассивСтрокОстатки.Количество() Тогда
					Если МассивСтрокОстаткиОбщие.Количество() Тогда
						СтрокиКУдалению.Добавить(СтрокаЗапасы);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				СтрокаОстатка = МассивСтрокОстатки[0];
				
				Если УчетПоЯчейкам Тогда
					
					СтруктураДляПоискаПоЯчейкам.Номенклатура       = СтрокаТабЗапасы.Номенклатура;
					СтруктураДляПоискаПоЯчейкам.Характеристика     = СтрокаТабЗапасы.Характеристика;
					СтруктураДляПоискаПоЯчейкам.Партия             = СтрокаТабЗапасы.Партия;
					СтруктураДляПоискаПоЯчейкам.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДляПоиска;
					СтруктураДляПоискаПоЯчейкам.Ячейка             = СтрокаЗапасы.Ячейка;
					
					МассивСтрокОстатки = ОстаткиПоЯчейкам.НайтиСтроки(СтруктураДляПоискаПоЯчейкам);
					
					Если МассивСтрокОстатки.Количество() Тогда
						СтрокаПоЯчейке = МассивСтрокОстатки[0];
						КоличествоОстаток = СтрокаПоЯчейке.ОстатокСУчетомДвижения/КоэффициентЕдиницыИзмерения;
					Иначе
						КоличествоОстаток = 0;
					КонецЕсли
					
				Иначе
					КоличествоОстаток = СтрокаОстатка.КоличествоОстаток/КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
				Если КоличествоДляРаспределения <= КоличествоОстаток Тогда
					СтрокаЗапасы.Количество = КоличествоДляРаспределения;
				Иначе
					СтрокаЗапасы.Количество = КоличествоОстаток;
				КонецЕсли;
				
				Если УчетПоЯчейкам И МассивСтрокОстатки.Количество() Тогда
					СтрокаПоЯчейке.ОстатокСУчетомДвижения = СтрокаПоЯчейке.ОстатокСУчетомДвижения
						- СтрокаЗапасы.Количество*КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
				ВсегоРезерва = СтрокаОстатка.ВсегоРезерва / КоэффициентЕдиницыИзмерения;
				
				Если СтрокаЗапасы.Количество > ВсегоРезерва Тогда 
					СтрокаЗапасы.Резерв = ВсегоРезерва;
					СтрокаОстатка.ВсегоРезерва = 0;
				Иначе
					СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
					СтрокаОстатка.ВсегоРезерва = СтрокаОстатка.ВсегоРезерва
						- СтрокаЗапасы.Резерв * КоэффициентЕдиницыИзмерения;
				КонецЕсли;
				
				СтрокаОстатка.КоличествоОстаток = СтрокаОстатка.КоличествоОстаток
					- СтрокаЗапасы.Количество * КоэффициентЕдиницыИзмерения;
				
				КоличествоДляРаспределения = КоличествоДляРаспределения - СтрокаЗапасы.Количество;
				
				Если СтрокаЗапасы.Количество = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				Иначе
					МассивОбработанныхСтрок.Добавить(СтрокаЗапасы);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоДляРаспределения > 0 И МассивСтрокОстаткиОбщие.Количество() Тогда
			
			Если Не ЗначениеЗаполнено(СтруктурнаяЕдиницаДляПоиска) Тогда
				
				Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов) Тогда
					СтруктурнаяЕдиницаДляПоиска = Объект.СтруктурнаяЕдиницаЗапасов;
				Иначе
					СтруктурнаяЕдиницаДляПоиска = СтрокаЗапасы.Номенклатура.Склад;
					СтрокаЗапасы[ИмяСтруктурнойЕдиницы] = СтруктурнаяЕдиницаДляПоиска;
				КонецЕсли;
				
			КонецЕсли;
			
			ПодготовитьТаблицуСогласноПриоритетам(ТаблицаОстатков, СтруктурнаяЕдиницаДляПоиска);
			
			НоваяСтрока = Неопределено;
			
			МассивСтрокОбходаСкладов = Новый Массив;
			
			Для каждого СтрокаМассиваСтрокОстатки Из МассивСтрокОстаткиОбщие Цикл
				
				ОстатокНаСкладе = СтрокаМассиваСтрокОстатки.КоличествоОстаток;
				
				Если ОстатокНаСкладе = 0 Тогда Продолжить КонецЕсли;
				Если КоличествоДляРаспределения = 0 Тогда Прервать КонецЕсли;
				
				МассивСтрокОбходаСкладов.Очистить();
				
				Если УчетПоЯчейкам Тогда
					СтруктураДляПоискаПоСкладуБезЗаказа.Номенклатура   = СтрокаМассиваСтрокОстатки.Номенклатура;
					СтруктураДляПоискаПоСкладуБезЗаказа.Характеристика = СтрокаМассиваСтрокОстатки.Характеристика;
					СтруктураДляПоискаПоСкладуБезЗаказа.Партия         = СтрокаМассиваСтрокОстатки.Партия;
					СтруктураДляПоискаПоСкладуБезЗаказа.СтруктурнаяЕдиница =
						СтрокаМассиваСтрокОстатки.СтруктурнаяЕдиница;
					
					СтрокиОбходаСкладов = ОстаткиПоЯчейкам.НайтиСтроки(СтруктураДляПоискаПоСкладуБезЗаказа);
					
					Если Не СтрокиОбходаСкладов.Количество() Тогда
						МассивСтрокОбходаСкладов.Добавить(СтрокаМассиваСтрокОстатки);
					Иначе
						Для Каждого НайденнаяСтрока Из СтрокиОбходаСкладов Цикл
							МассивСтрокОбходаСкладов.Добавить(НайденнаяСтрока);
						КонецЦикла;
					КонецЕсли;
					
				Иначе
					МассивСтрокОбходаСкладов.Добавить(СтрокаМассиваСтрокОстатки);
				КонецЕсли;
				
				НомерСтроки = СтрокаЗапасы.НомерСтроки;
				
				Для Каждого СтрокаОбхода Из МассивСтрокОбходаСкладов Цикл
					
					НоваяСтрока = Объект[ИмяТЧ].Вставить(НомерСтроки);
					НомерСтроки = НомерСтроки + 1;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗапасы);
					
					НоваяСтрока.Количество = 0;
					НоваяСтрока.Резерв = 0;
					НоваяСтрока.Ячейка = Неопределено;
					
					Если УчетПоЯчейкам Тогда 
						НоваяСтрока.Ячейка = СтрокаОбхода.Ячейка;
						ОстатокНаСкладе = СтрокаОбхода.ОстатокСУчетомДвижения / КоэффициентЕдиницыИзмерения;
					Иначе
						ОстатокНаСкладе = СтрокаОбхода.КоличествоОстаток / КоэффициентЕдиницыИзмерения;
					КонецЕсли;
					
					НоваяСтрока[ИмяСтруктурнойЕдиницы] = СтрокаМассиваСтрокОстатки.СтруктурнаяЕдиница;
					
					ВсегоРезерва = СтрокаМассиваСтрокОстатки.ВсегоРезерва / КоэффициентЕдиницыИзмерения;
					
					Если ОстатокНаСкладе > КоличествоДляРаспределения Тогда
						
						НоваяСтрока.Количество = КоличествоДляРаспределения;
						
						Если СтрокаМассиваСтрокОстатки.ВсегоРезерва > 0 Тогда
							ЗначениеРезерва = ?(ВсегоРезерва > НоваяСтрока.Количество,
								НоваяСтрока.Количество, ВсегоРезерва);
						КонецЕсли;
						
						НоваяСтрока.Резерв = ЗначениеРезерва;
						
						СтрокаМассиваСтрокОстатки.КоличествоОстаток = СтрокаМассиваСтрокОстатки.КоличествоОстаток
							- КоличествоДляРаспределения*КоэффициентЕдиницыИзмерения;
						КоличествоДляРаспределения = 0;
						СтрокаМассиваСтрокОстатки.ВсегоРезерва = СтрокаМассиваСтрокОстатки.ВсегоРезерва
							- НоваяСтрока.Резерв*КоэффициентЕдиницыИзмерения;
						
						Если УчетПоЯчейкам Тогда
							СтрокаОбхода.ОстатокСУчетомДвижения = СтрокаОбхода.ОстатокСУчетомДвижения
								- КоличествоДляРаспределения*КоэффициентЕдиницыИзмерения
						КонецЕсли;
						
						МассивОбработанныхСтрок.Добавить(НоваяСтрока);
						
						Прервать;
						
					Иначе
						
						ЗначениеРезерва = 0;
						
						НоваяСтрока.Количество = ОстатокНаСкладе;
						
						Если ВсегоРезерва > 0 Тогда
							ЗначениеРезерва = ?(ВсегоРезерва > НоваяСтрока.Количество,
								НоваяСтрока.Количество, ВсегоРезерва);
						КонецЕсли;
						
						СтрокаМассиваСтрокОстатки.ВсегоРезерва = СтрокаМассиваСтрокОстатки.ВсегоРезерва
							- ЗначениеРезерва;
						
						НоваяСтрока.Резерв = ЗначениеРезерва;
						КоличествоДляРаспределения = КоличествоДляРаспределения - ОстатокНаСкладе;
						СтрокаМассиваСтрокОстатки.КоличествоОстаток = 0;
						Если УчетПоЯчейкам Тогда
							СтрокаОбхода.ОстатокСУчетомДвижения = 0
						КонецЕсли;
						
					КонецЕсли;
					
					СтрокаУдалена = НайденИУдаленДубльТекущейСтроки(СтрокиКУдалению, НоваяСтрока,
						МассивОбработанныхСтрок, Истина, ИмяСтруктурнойЕдиницы, ИмяТЧ, "Производство");
					
					Если Не СтрокаУдалена Тогда
						МассивОбработанныхСтрок.Добавить(НоваяСтрока);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			ПоследняяСтрокаМассива = ?(МассивОбработанныхСтрок.Количество(),
				МассивОбработанныхСтрок[МассивОбработанныхСтрок.Количество() - 1], Неопределено);
			
			ПоследняяСтрока = ПоследняяСтрокаМассива;
			
			Если КоличествоДляРаспределения > 0 И Не ПоследняяСтрока = Неопределено Тогда
				ПоследняяСтрока.Количество = ПоследняяСтрока.Количество + КоличествоДляРаспределения;
			КонецЕсли;
			
		КонецЕсли;
		
		ОчиститьПриоритеты(ТаблицаОстатков);
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Объект[ИмяТЧ].Удалить(СтрокаКУдалению);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список документов по Заказу покупателя
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  ТипОперации - Строка - Тип операции
//  СтруктураПараметров - Структура - Структура параметров
//  ИмяТЧ - Строка - Имя ТЧ
//  СостояниеВыполнения - Строка, Неопределено - Состояние выполнения
//  ТипДокумента - Строка, Неопределено - Тип документа
// 
// Возвращаемое значение:
//  СписокЗначений из ЭлементСпискаЗначений - Список документов по заказу
Функция СписокДокументовПоЗаказу(Объект, ТипОперации, СтруктураПараметров, ИмяТЧ = "Запасы",
	СостояниеВыполнения = Неопределено, ТипДокумента = Неопределено) Экспорт
	
	Номенклатура = СтруктураПараметров.Номенклатура;
	Характеристика = СтруктураПараметров.Характеристика;
	Партия = СтруктураПараметров.Партия;
	Склад = СтруктураПараметров.Склад;
	ЕдиницаИзмерения = СтруктураПараметров.ЕдиницаИзмерения;
	ЗаказПокупателя = СтруктураПараметров.ЗаказПокупателя;
	НомерВариантаКП = СтруктураПараметров.НомерВариантаКП;

	ЗаказПокупателя = ?(ЗначениеЗаполнено(ЗаказПокупателя), ЗаказПокупателя, Объект.Ссылка);
	
	КакВРасходнойНакладной = Ложь;
	
	Если СтруктураПараметров.Свойство("ВидыЗаполненияПоЗаказНаряду") Тогда
		КакВЗаказеПокупателя = СтруктураПараметров.ВидыЗаполненияПоЗаказНаряду.КакВЗаказеПокупателя;
		КакВРасходнойНакладной = СтруктураПараметров.ВидыЗаполненияПоЗаказНаряду.КакВРасходнойНакладной;
	Иначе
		КакВЗаказеПокупателя = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
			Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику"),
				Истина, Ложь);
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
		Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ИмяКолонкиСклада = "СтруктурнаяЕдиницаРезерв";
	Иначе
		ИмяКолонкиСклада = "СтруктурнаяЕдиница";
	КонецЕсли;
	
	ОрганизацияОбъекта = СтруктураПараметров.ОрганизацияОбъекта;
	
	Коэффициент = ?(ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения"),
		ЕдиницаИзмерения.Коэффициент, 1);
	Организация = Константы.УчетПоКомпании.Компания(ОрганизацияОбъекта);
	
	СписокВозврата = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	ДлинаЧисла = 0;
	
	Если ТипОперации = "Заказано" Тогда
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		
		Запрос.Текст = ТекстЗапросаЗаказано();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Количество = Окр(Выборка.Количество/Коэффициент,3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ИнформацияОЗаказе = СтрШаблон("%1 %2. Поставка: %3 . %4", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Формат(Выборка.ДатаПоступления, "ДФ=dd.MM.yyyy"), Строка(Выборка.Ссылка));
				
				
			СписокВозврата.Добавить(Выборка.Ссылка, ИнформацияОЗаказе);
			
		КонецЦикла;
		
	ИначеЕсли ТипОперации = "ЗапасыПоступления" Тогда
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			Запрос.УстановитьПараметр("ЗаказПокупателя", Объект.Заказ);
			Запрос.Текст = ТекстЗапросаЗапасыПоступленияСвободныеИПоЗаказу();
		Иначе
			Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
			Запрос.Текст = ТекстЗапросаЗапасыПоступленияСвободные();
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		ЕстьПравоПросмотраЗаказаПоставки =
			ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПоставщику, Пользователи.АвторизованныйПользователь())
			И ПравоДоступа("Чтение",
				Метаданные.Документы.ЗаказНаПроизводство, Пользователи.АвторизованныйПользователь());
		
		Пока Выборка.Следующий() Цикл
			
			Количество = Окр(Выборка.Количество / Коэффициент,3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			Если ТипЗнч(Выборка.ДатаПоступления) = Тип("Дата") Тогда
				ДатаПоступления = Формат(Выборка.ДатаПоступления,"ДЛФ=ДД");
			Иначе
				ДатаПоступления = Строка(Выборка.ДатаПоступления) + ПредметИсчисления(
					Выборка.ДатаПоступления,
					НСтр("ru = 'дата'"),
					НСтр("ru = 'даты'"),
					НСтр("ru = 'дат'"),
					"м");
			КонецЕсли;
			
			ИнформацияОЗаказе = СтрШаблон("%1 %2. %3 %4. %5", КоличествоТовара, Строка(ЕдиницаИзмерения),
				НСтр("ru = 'поставка:'"), ДатаПоступления,
				?(ЕстьПравоПросмотраЗаказаПоставки, Строка(Выборка.Ссылка), ""));
				
			СписокВозврата.Добавить(Выборка.Ссылка, ИнформацияОЗаказе);

		КонецЦикла;
		
	ИначеЕсли ТипОперации = "Остаток" Тогда
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		Запрос.УстановитьПараметр("Номенклатура",    Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  Характеристика);
		Запрос.УстановитьПараметр("Партия",          Партия);
		
		Запрос.Текст = ТекстЗапросаОстаток();
		
		Если Склад = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Запасы.СтруктурнаяЕдиница = &Склад", "");
		Иначе
			Запрос.УстановитьПараметр("Склад", Склад);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура");
		ПараметрыОтбора.Вставить("Характеристика");
		ПараметрыОтбора.Вставить("Партия");
		
		Если Не ПустаяСтрока(ИмяКолонкиСклада) Тогда
			ПараметрыОтбора.Вставить(ИмяКолонкиСклада);
		КонецЕсли;
		
		ПараметрыОтбораБезСклада = Новый Структура;
		ПараметрыОтбораБезСклада.Вставить("Номенклатура");
		ПараметрыОтбораБезСклада.Вставить("Характеристика");
		ПараметрыОтбораБезСклада.Вставить("Партия");
		
		Если ТипДокумента = "ЗаказНаПроизводство" Тогда
			ПараметрыОтбора.Вставить("ЗаказПокупателя");
			ПараметрыОтбораБезСклада.Вставить("ЗаказПокупателя");
		КонецЕсли;
		
		ПараметрыОтбора[ИмяКолонкиСклада] = Склад;
		
		Если КакВЗаказеПокупателя Тогда
			
			Если ЗначениеЗаполнено(Склад) Тогда
				
				ПараметрыОтбора.Номенклатура   = Номенклатура;
				ПараметрыОтбора.Характеристика = Характеристика;
				ПараметрыОтбора.Партия         = Партия;
				
				КоличествоВЕдиницахИзмеренияСтроки = ПолучитьСуммуПоТабличнойЧасти(
					Объект, ПараметрыОтбора, "Резервировать", НомерВариантаКП, Коэффициент, ИмяТЧ);
				
				ДлинаЧисла =
					?(ДлинаЧисла = 0, СтрДлина(Формат(КоличествоВЕдиницахИзмеренияСтроки, "ЧДЦ=0")), ДлинаЧисла);
				КоличествоТовара = СформироватьПредставлениеКоличества(КоличествоВЕдиницахИзмеренияСтроки,
					ДлинаЧисла);
				
				ПредставлениеДокумента = СтрШаблон("%1 %2. %3; <текущий документ>", КоличествоТовара,
					Строка(ЕдиницаИзмерения), Строка(Склад));
				
				СписокВозврата.Добавить(Объект.Ссылка, ПредставлениеДокумента);
				
			Иначе
				
				ПараметрыОтбораБезСклада.Номенклатура = Номенклатура;
				ПараметрыОтбораБезСклада.Характеристика = Характеристика;
				ПараметрыОтбораБезСклада.Партия = Партия;
				
				Если ТипДокумента = "ЗаказНаПроизводство" Тогда
					ПараметрыОтбораБезСклада.ЗаказПокупателя = ЗаказПокупателя;
				КонецЕсли;
				
				СтрокиПоНоменклатуре = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбораБезСклада);
				
				ТаблицаСкладов = Объект[ИмяТЧ].Выгрузить(СтрокиПоНоменклатуре,ИмяКолонкиСклада);
				ТаблицаСкладов.Свернуть(ИмяКолонкиСклада);
				
				Для Каждого СтрокаЗапасов Из ТаблицаСкладов Цикл
					
					ПараметрыОтбора.Номенклатура = Номенклатура;
					ПараметрыОтбора.Характеристика = Характеристика;
					ПараметрыОтбора.Партия = Партия;
					
					Если ТипДокумента = "ЗаказНаПроизводство" Тогда
						ПараметрыОтбора.ЗаказПокупателя = ЗаказПокупателя;
					КонецЕсли;
					
					СтруктурнаяЕдиница = СтрокаЗапасов[ИмяКолонкиСклада];
					ПараметрыОтбора[ИмяКолонкиСклада] = СтруктурнаяЕдиница;
					
					КоличествоВЕдиницахИзмеренияСтроки= ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
						"Резервировать", НомерВариантаКП, Коэффициент, ИмяТЧ, ТипДокумента, СостояниеВыполнения);
					
					Если Не КоличествоВЕдиницахИзмеренияСтроки > 0 Тогда Продолжить КонецЕсли;
					
					ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(КоличествоВЕдиницахИзмеренияСтроки, "ЧДЦ=0")),
						ДлинаЧисла);
					КоличествоТовара = СформироватьПредставлениеКоличества(КоличествоВЕдиницахИзмеренияСтроки,
						ДлинаЧисла);
					
					ПредставлениеДокумента = СтрШаблон("%1 %2. %3; <текущий документ>", КоличествоТовара,
						Строка(ЕдиницаИзмерения), Строка(СтруктурнаяЕдиница));
					
					СписокВозврата.Добавить(Объект.Ссылка, ПредставлениеДокумента);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Количество) Или (Выборка.Регистратор = Объект.Ссылка) Тогда
				Продолжить
			КонецЕсли;
			
			ПредставлениеДокумента = "";
			
			Количество = Окр(Выборка.Количество / Коэффициент, 3);
			
			Если Количество = 0 Тогда
				Продолжить
			КонецЕсли;
			
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ПредставлениеДокумента = СтрШаблон("%1 %2. %3; %4", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Строка(Выборка.Склад), Строка(Выборка.Регистратор));
			СписокВозврата.Добавить(Выборка.Регистратор, ПредставлениеДокумента);
			
		КонецЦикла;
		
	ИначеЕсли ТипОперации = "ОстатокПоРезервамРН" Тогда
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Партия", Партия);
		
		Запрос.Текст = ТекстЗапросаОстаток();
		
		Если Склад = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Запасы.СтруктурнаяЕдиница = &Склад", "");
		Иначе
			Запрос.УстановитьПараметр("Склад", Склад);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура");
		ПараметрыОтбора.Вставить("Характеристика");
		ПараметрыОтбора.Вставить("Партия");
		
		Если КакВРасходнойНакладной Тогда
			ПараметрыОтбора.Вставить("СтруктурнаяЕдиницаРезерв");
		Иначе
			ПараметрыОтбора.Вставить("СтруктурнаяЕдиница");
		КонецЕсли;
		
		ПараметрыОтбораБезСклада = Новый Структура("Номенклатура, Характеристика, Партия");
		
		Если ЗначениеЗаполнено(Склад) Тогда
			
			ПараметрыОтбора.Номенклатура = Номенклатура;
			ПараметрыОтбора.Характеристика = Характеристика;
			ПараметрыОтбора.Партия = Партия;
			ПараметрыОтбора.СтруктурнаяЕдиницаРезерв = Склад;
			
			КоличествоВЕдиницахИзмеренияСтроки= ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
				"Резервировать", НомерВариантаКП, Коэффициент, ИмяТЧ,ТипДокумента, СостояниеВыполнения);
			
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(КоличествоВЕдиницахИзмеренияСтроки, "ЧДЦ=0")),
				ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(КоличествоВЕдиницахИзмеренияСтроки, ДлинаЧисла);
			
			ПредставлениеДокумента = СтрШаблон("%1 %2. %3; <текущий документ>", КоличествоТовара,
				Строка(ЕдиницаИзмерения), Строка(Склад));
			СписокВозврата.Добавить(Объект.Ссылка, ПредставлениеДокумента);
			
		Иначе
			
			ПараметрыОтбораБезСклада.Номенклатура = Номенклатура;
			ПараметрыОтбораБезСклада.Характеристика = Характеристика;
			ПараметрыОтбораБезСклада.Партия = Партия;
			
			СтрокиПоНоменклатуре = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбораБезСклада);
			
			ТаблицаСкладов = Объект[ИмяТЧ].Выгрузить(СтрокиПоНоменклатуре,"СтруктурнаяЕдиницаРезерв");
			ТаблицаСкладов.Свернуть("СтруктурнаяЕдиницаРезерв");
			
			Для Каждого СтрокаЗапасов Из ТаблицаСкладов Цикл
				
				ПараметрыОтбора.Номенклатура = Номенклатура;
				ПараметрыОтбора.Характеристика = Характеристика;
				ПараметрыОтбора.Партия = Партия;
				ПараметрыОтбора.СтруктурнаяЕдиницаРезерв = СтрокаЗапасов.СтруктурнаяЕдиницаРезерв;
				
				КоличествоВЕдиницахИзмеренияСтроки= ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора,
					"Резервировать", НомерВариантаКП, Коэффициент, ИмяТЧ,ТипДокумента, СостояниеВыполнения);
				
				Если Не КоличествоВЕдиницахИзмеренияСтроки > 0 Тогда
					Продолжить
				КонецЕсли;
				
				ДлинаЧисла =
					?(ДлинаЧисла = 0, СтрДлина(Формат(КоличествоВЕдиницахИзмеренияСтроки, "ЧДЦ=0")), ДлинаЧисла);
				КоличествоТовара = СформироватьПредставлениеКоличества(КоличествоВЕдиницахИзмеренияСтроки,
					ДлинаЧисла);
				
				ПредставлениеДокумента = СтрШаблон("%1 %2. %3; <текущий документ>", КоличествоТовара,
					Строка(ЕдиницаИзмерения), Строка(СтрокаЗапасов.СтруктурнаяЕдиницаРезерв));
				СписокВозврата.Добавить(Объект.Ссылка, ПредставлениеДокумента);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Количество) Или Выборка.Регистратор = Объект.Ссылка Тогда
				Продолжить
			КонецЕсли;
			
			ПредставлениеДокумента = "";
			
			Количество = Окр(Выборка.Количество/Коэффициент,3);
			
			Если Количество = 0 Тогда
				Продолжить
			КонецЕсли;
			
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ПредставлениеДокумента = СтрШаблон("%1 %2. %3; %4", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Строка(Выборка.Склад), Строка(Выборка.Регистратор));				
			СписокВозврата.Добавить(Выборка.Регистратор, ПредставлениеДокумента);
			
		КонецЦикла;
		
	ИначеЕсли ТипОперации = "ЗапасыВРезервеПоСкладам" Тогда
		
		Запрос.УстановитьПараметр("Номенклатура",    Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",  Характеристика);
		Запрос.УстановитьПараметр("Организация",     Организация);
		Запрос.УстановитьПараметр("Партия",          Партия);
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		
		Запрос.Текст = ТекстЗапросаЗапасыВРезервеПоСкладам();
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗначенийПоСкладу = Новый Структура("Склад, Количество");
			
			Количество = Окр(Выборка.Количество/Коэффициент,3);
			
			Если Количество = 0 Тогда Продолжить КонецЕсли;
			
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			СтруктураЗначенийПоСкладу.Склад = Выборка.Склад;
			СтруктураЗначенийПоСкладу.Количество = КоличествоТовара;
			
			ПредставлениеЗначения = СтрШаблон("%1 %2. %3", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Строка(Выборка.Склад));
			СписокВозврата.Добавить(СтруктураЗначенийПоСкладу, ПредставлениеЗначения);
			
		КонецЦикла;
		
	Иначе //ОстаткиОбщие
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия," + ИмяКолонкиСклада);
		
		ПараметрыОтбора.Номенклатура   = Номенклатура;
		ПараметрыОтбора.Характеристика = Характеристика;
		ПараметрыОтбора.Партия         = Партия;
		
		Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Организация",    Организация);
		Запрос.УстановитьПараметр("Партия",         Партия);
		Запрос.УстановитьПараметр("Ссылка",         Объект.Ссылка);
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если КакВЗаказеПокупателя Тогда
				Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
				Запрос.Текст = ТекстЗапросаОстаткиОбщие(Истина);
			Иначе
				Запрос.Текст = ТекстЗапросаОстаткиОбщие(Истина, Ложь);
			КонецЕсли;
		Иначе
			Запрос.Текст = ТекстЗапросаОстаткиОбщие();
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗначенийПоСкладу = Новый Структура("Склад, Количество");

			ПараметрыОтбора[ИмяКолонкиСклада]= Выборка.Склад;
			
			ИтогПоЗначениюВРезерв = 0;
			
			Если КакВЗаказеПокупателя Тогда
				ИтогПоЗначениюВРезерв = ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора, "Резервировать",
					НомерВариантаКП, , ИмяТЧ, ТипДокумента,СостояниеВыполнения);
			КонецЕсли;
			
			ДополнительноеКоличество = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство"),
					0, Выборка.ЗарезервированоЗаказом);
					
			Количество = Выборка.Количество - ИтогПоЗначениюВРезерв + ДополнительноеКоличество;
			
			Если Количество = 0 Тогда
				Продолжить
			КонецЕсли;
			
			Количество = Окр(Количество/Коэффициент,3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ПредставлениеЗначения = СтрШаблон("%1 %2. %3", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Строка(Выборка.Склад));
			
			СтруктураЗначенийПоСкладу.Склад = Выборка.Склад;
			СтруктураЗначенийПоСкладу.Количество = Количество;
			
			СписокВозврата.Добавить(СтруктураЗначенийПоСкладу, ПредставлениеЗначения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции

// Возвращает список документов по Заказу на перемещение
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект формы
//  ТипОперации - Строка - Тип операции формирования списка
//  СтруктураПараметров - Структура - Структура параметров для формирования списка
//  ИмяТЧ - Строка - Имя табличной части 
//
// Возвращаемое значение:
//  СписокЗначений из ЭлементСпискаЗначений - Список документов по Заказу на перемещение
//
Функция СписокДокументовПоПеремещению(Объект, ТипОперации, СтруктураПараметров, ИмяТЧ = "Запасы") Экспорт
	
	Номенклатура = СтруктураПараметров.Номенклатура;
	Характеристика = СтруктураПараметров.Характеристика;
	Партия = СтруктураПараметров.Партия;
	ЕдиницаИзмерения = СтруктураПараметров.ЕдиницаИзмерения;
	ЗаказПокупателя = СтруктураПараметров.ЗаказПокупателя;
	Получатель = СтруктураПараметров.Получатель;
	Отправитель = СтруктураПараметров.Отправитель;

	ЗаказПокупателя = ?(ЗначениеЗаполнено(ЗаказПокупателя), ЗаказПокупателя,
		Документы.ЗаказПокупателя.ПустаяСсылка());
	
	ОрганизацияОбъекта = СтруктураПараметров.Организация;
	
	Коэффициент = ?(ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения"),
		ЕдиницаИзмерения.Коэффициент, 1);
	Организация = Константы.УчетПоКомпании.Компания(ОрганизацияОбъекта);
	
	СписокВозврата = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	ДлинаЧисла = 0;
	
	Если ТипОперации = "Заказано" Тогда
		
		Запрос.УстановитьПараметр("Номенклатура",       Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",     Характеристика);
		Запрос.УстановитьПараметр("Организация",        Организация);
		Запрос.УстановитьПараметр("Получатель",         Получатель);
		Запрос.УстановитьПараметр("Отправитель",        Отправитель);
		Запрос.УстановитьПараметр("ЗаказНаПеремещение", Объект.Ссылка);
		
		Запрос.Текст = ТекстЗапросаЗаказаноЗаказНаПеремещение();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Количество = Окр(Выборка.Количество/Коэффициент, 3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ПредставлениеЗаказа = СтрШаблон("%1 %2. Поставка: %3. %4", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Формат(Выборка.ДатаПоступления,"ДЛФ=D"), Строка(Выборка.Ссылка));
			СписокВозврата.Добавить(Выборка.Ссылка, ПредставлениеЗаказа);
		КонецЦикла;
		
	ИначеЕсли ТипОперации = "ЗапасыПоступления" Тогда
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Отправитель", Отправитель);
		Запрос.УстановитьПараметр("УчетПотребностиПоСкладам",
			ПолучитьФункциональнуюОпцию("УчетПотребностиПоСкладам"));
		
		Запрос.Текст = ТекстЗапросаЗапасыПоступленияСвободныеПоПеремещению();

		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		ЕстьПравоПросмотраЗаказаПоставки =
			ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПоставщику, Пользователи.АвторизованныйПользователь())
			И ПравоДоступа("Чтение",
				Метаданные.Документы.ЗаказНаПроизводство, Пользователи.АвторизованныйПользователь());
		
		Пока Выборка.Следующий() Цикл
			
			Количество = Окр(Выборка.Количество/Коэффициент, 3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			Если ТипЗнч(Выборка.ДатаПоступления) = Тип("Дата") Тогда
				ДатаПоступления = Формат(Выборка.ДатаПоступления,"ДЛФ=ДД");
			Иначе
				ДатаПоступления = Строка(Выборка.ДатаПоступления) + ПредметИсчисления(
				Выборка.ДатаПоступления,
				НСтр("ru = 'дата'"),
				НСтр("ru = 'даты'"),
				НСтр("ru = 'дат'"),
				"м");
			КонецЕсли;
			
			ПредставлениеЗаказа = СтрШаблон("%1 %2. %3 %4. %5", КоличествоТовара, Строка(ЕдиницаИзмерения),
				НСтр("ru = 'поставка:'"), ДатаПоступления,
				?(ЕстьПравоПросмотраЗаказаПоставки, Строка(Выборка.Ссылка), ""));
			СписокВозврата.Добавить(Выборка.Ссылка, ПредставлениеЗаказа);
		КонецЦикла;
			
	Иначе //ОстаткиОбщие
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия");
		
		ПараметрыОтбора.Номенклатура = Номенклатура;
		ПараметрыОтбора.Характеристика = Характеристика;
		ПараметрыОтбора.Партия = Партия;
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Партия", Партия);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Запрос.Текст = ТекстЗапросаОстаткиОбщие();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗначенийПоСкладу = Новый Структура("Склад, Количество");
			
			Количество = Выборка.Количество;
			
			Если Количество = 0 Тогда Продолжить КонецЕсли;
			
			Количество = Окр(Количество/Коэффициент,3);
			ДлинаЧисла = ?(ДлинаЧисла = 0, СтрДлина(Формат(Количество, "ЧДЦ=0")), ДлинаЧисла);
			КоличествоТовара = СформироватьПредставлениеКоличества(Количество, ДлинаЧисла);
			
			ПредставлениеЗначения = СтрШаблон("%1 %2. %3", КоличествоТовара, Строка(ЕдиницаИзмерения),
				Строка(Выборка.Склад));
			
			СтруктураЗначенийПоСкладу.Склад      = Выборка.Склад;
			СтруктураЗначенийПоСкладу.Количество = Количество;
			
			СписокВозврата.Добавить(СтруктураЗначенийПоСкладу, ПредставлениеЗначения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции

// Формирует строковое значение количества в заданном формате формате
// 
// Параметры:
//  ОбрабатываемоеЧисло - Число - Обрабатываемое число
//  ДлинаЧисла - Число - Длина
// 
// Возвращаемое значение:
//  Строка - Представление количества
Функция СформироватьПредставлениеКоличества(ОбрабатываемоеЧисло, ДлинаЧисла) Экспорт
	
	СтрокаДляДополнения = Формат(ОбрабатываемоеЧисло, "ЧЦ=10; ЧДЦ=3");
	ДлинаТекЧисла = СтрДлина(Формат(ОбрабатываемоеЧисло, "ЧДЦ=0"));
	
	Если ДлинаТекЧисла = ДлинаЧисла Тогда
		Возврат СтрокаДляДополнения
	КонецЕсли;
	
	Для НомерПробела = ДлинаТекЧисла По ДлинаЧисла Цикл
		СтрокаДляДополнения = " " + СтрокаДляДополнения;
	КонецЦикла;
	
	Возврат СтрокаДляДополнения;
	
КонецФункции

// Возвращает преобразованное строковое значение Информации об отборе
// 
// Параметры:
//  НаименованиеМетки - Строка - Наименование метки
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока - Информация об отборе
Функция ИнформацияОбОтборе(НаименованиеМетки) Экспорт
	
	Цвет = ЦветаСтиля.ТекстВторостепеннойНадписи;
	Шрифт = ШрифтыСтиля.ШрифтПравойПанелиОтборов;
	
	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НаименованиеМетки + " ", Шрифт, Цвет));
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.Очистить, , , , "ДублиСтрок"));
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС);
	
КонецФункции

// Возвращает преобразованное строковое значение Информации об отборе для дублей строк
// 
// Параметры:
//  НомерСтрокиПредставление - Строка - Номер строки представление
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ИнформацияОбОтбореДубльСтроки(НомерСтрокиПредставление) Экспорт
	ТекстСообщения = НСтр("ru = 'Дубли строки '");
	Возврат ИнформацияОбОтборе(ТекстСообщения + НомерСтрокиПредставление);
КонецФункции

// Заполняет признак типа запас в табличной части
//
// Параметры:
//  Объект	 - ДанныеФормыСтруктура, ДокументОбъект	 - Заполняемый документ
//  ИмяТЧ	 - Строка								 - Имя табличной части
//
Процедура ЗаполнитьПризнакТипаЗапасНоменклатуры(Объект, ИмяТЧ = "Запасы") Экспорт
	
	Если ТипЗнч(Объект[ИмяТЧ]) = Тип("ДанныеФормыКоллекция") Тогда
		ИспользуемаяНоменклатура = Объект[ИмяТЧ].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Иначе
		ИспользуемаяНоменклатура = Объект[ИмяТЧ].ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	ИмяРеквизита = "ТипНоменклатуры";
	ЗначенияТипов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ИспользуемаяНоменклатура, ИмяРеквизита, Истина);
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
		ТипПодарочныйСертификат = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат; 
		СтрокаТабличнойЧасти.ТипНоменклатурыЗапас =
			ЗначенияТипов.Получить(СтрокаТабличнойЧасти.Номенклатура) = Перечисления.ТипыНоменклатуры.Запас
			Или ЗначенияТипов.Получить(СтрокаТабличнойЧасти.Номенклатура) = ТипПодарочныйСертификат;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет таблицу настроек формы выбора номенклатуры на основании вида документа
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ВидДокумента - Строка - Вид документа
//  НастройкиФормыВыбораНоменклатуры - ТаблицаЗначений - Настройки формы выбора номенклатуры:
//   * ИмяТабличнойЧасти - Строка 
//   * ТекущаяТабличнаяЧасть - Булево 
//   * ИмяНастройки - Строка
//   * ЗначениеНастройки - Произвольный
//  ТипСохраняемыхНастроек - Число - Тип сохраняемых настроек
//  Текущая - Булево
//  ИмяТабличнойЧасти - Строка - Имя табличной части
//  СтруктураНастроек - Структура - Неопределено - Структура настроек
Процедура ЗаполнитьТаблицуНастроекФормыВыбораНоменклатурыСервер(Форма, ВидДокумента, НастройкиФормыВыбораНоменклатуры,
	ТипСохраняемыхНастроек, Текущая = Истина, ИмяТабличнойЧасти = "Запасы", СтруктураНастроек = Неопределено) Экспорт
	
	ИмяСтруктурнойЕдиницыНаФорме = Неопределено;
	Если ВидДокумента = "ЧекККМ" Тогда
		ИмяСтруктурнойЕдиницыНаФорме = "СтруктурнаяЕдиницаККМ";
	ИначеЕсли Форма.Объект.Свойство("СтруктурнаяЕдиница") Тогда
		ИмяСтруктурнойЕдиницыНаФорме = "СтруктурнаяЕдиница";
	ИначеЕсли Форма.Объект.Свойство("СтруктурнаяЕдиницаРезерв") Тогда
		ИмяСтруктурнойЕдиницыНаФорме = "СтруктурнаяЕдиницаРезерв";
	КонецЕсли;
	
	Если ТипСохраняемыхНастроек = 1 Тогда
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборОрганизация";
		НоваяСтрока.ЗначениеНастройки = Форма.Объект.Организация;
		
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборСклад";
		
		Если ЗначениеЗаполнено(ИмяСтруктурнойЕдиницыНаФорме) И ВидДокумента = "ЧекККМ" Тогда
			НоваяСтрока.ЗначениеНастройки = Форма.СтруктурнаяЕдиницаККМ;
		ИначеЕсли ЗначениеЗаполнено(ИмяСтруктурнойЕдиницыНаФорме) Тогда
			Если Форма.Объект.Свойство("ПоложениеСклада") Тогда
				НоваяСтрока.ЗначениеНастройки =
				?(Форма.Объект.ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке")
				, Форма.Объект[ИмяСтруктурнойЕдиницыНаФорме],
				ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка"));
			Иначе 
				НоваяСтрока.ЗначениеНастройки = Форма.Объект[ИмяСтруктурнойЕдиницыНаФорме];
			КонецЕсли;
		Иначе
			НоваяСтрока.ЗначениеНастройки = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
		КонецЕсли;
		
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборВидЦен";
		
		Если Форма.Объект.Свойство("ВидЦен") Тогда
			НоваяСтрока.ЗначениеНастройки = Форма.Объект.ВидЦен;
		Иначе
			НоваяСтрока.ЗначениеНастройки = ПредопределенноеЗначение("Справочник.ВидыЦен.Учетная");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипСохраняемыхНастроек = 2 Тогда
		
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборВидЦен";
		
		Если Форма.Объект.Свойство("ВидЦен") Тогда
			НоваяСтрока.ЗначениеНастройки = Форма.Объект.ВидЦен;
		Иначе
			НоваяСтрока.ЗначениеНастройки = ПредопределенноеЗначение("Справочник.ВидыЦен.Учетная");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипСохраняемыхНастроек = 3 Тогда
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборОрганизация";
		НоваяСтрока.ЗначениеНастройки = Форма.Объект.Организация;
		
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборСклад";
		НоваяСтрока.ЗначениеНастройки = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
		
		НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
		НоваяСтрока.ИмяНастройки = "ОтборОстатки";
		НоваяСтрока.ЗначениеНастройки = 0;
	КонецЕсли;
	
	НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
	НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
	НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
	НоваяСтрока.ИмяНастройки = "КлючНазначенияДокумента";
	НоваяСтрока.ЗначениеНастройки = ТипСохраняемыхНастроек;
	
	Если ОграничиватьТипСклада(ВидДокумента) Тогда
		
		Если ВидДокумента = "ЧекККМ" Тогда
			НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
			НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
			НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
			НоваяСтрока.ИмяНастройки = "ТипСтруктурнойЕдиницы";
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
			МассивТипов.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
			
			МассивТиповСтруктурныхЕдиниц = Новый ФиксированныйМассив(МассивТипов);
			
			НоваяСтрока.ЗначениеНастройки = МассивТиповСтруктурныхЕдиниц;
		Иначе
			ИмяОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Форма.Объект.Ссылка));
			ИмяОбъектМетаданных = ?(Не ИмяОбъектМетаданных = Неопределено, ИмяОбъектМетаданных.Имя, "");
			
			Если ЗначениеЗаполнено(ИмяСтруктурнойЕдиницыНаФорме) И ЗначениеЗаполнено(ИмяОбъектМетаданных) Тогда
				
				ПараметрыВыбораСклад =
				Метаданные.Документы[ИмяОбъектМетаданных].Реквизиты[ИмяСтруктурнойЕдиницыНаФорме].ПараметрыВыбора;
				
				Для Каждого СтрокаПараметровВыбора Из ПараметрыВыбораСклад Цикл
					Если СтрокаПараметровВыбора.Имя = "Отбор.ТипСтруктурнойЕдиницы" Тогда
						НоваяСтрока = НастройкиФормыВыбораНоменклатуры.Добавить();
						НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
						НоваяСтрока.ТекущаяТабличнаяЧасть = Текущая;
						НоваяСтрока.ИмяНастройки = "ТипСтруктурнойЕдиницы";
						НоваяСтрока.ЗначениеНастройки = СтрокаПараметровВыбора.Значение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет настройки формы выбора номенклатуры в соответствии с изменением сохраняемым в настройках реквизитом формы
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ВидДокумента - Строка
//  ИмяТЧ - Строка
//  НастройкиФормыВыбораНоменклатуры - ТаблицаЗначений:
//   * ИмяТабличнойЧасти - Строка
//   * ТекущаяТабличнаяЧасть - Строка
//   * ИмяНастройки - Строка
//   * ЗначениеНастройки - Произвольный
//  ДополнениеНаименованияНоменклатуры - Строка
Процедура ОбновитьНастройкиФормыВыбораНоменклатурыПриИзмененииРеквизита(Форма, ВидДокумента, ИмяТЧ,
	НастройкиФормыВыбораНоменклатуры, ДополнениеНаименованияНоменклатуры = "") Экспорт

	ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти", ИмяТЧ);

	НайденныеСтроки = НастройкиФормыВыбораНоменклатуры.НайтиСтроки(ПараметрыОтбора);

	Если НайденныеСтроки.Количество() Тогда
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НастройкиФормыВыбораНоменклатуры.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;

	ТипСохраняемыхНастроек = НоменклатураВДокументахКлиентСервер.ТипСохраняемыхНастроек(ВидДокумента);
	ЗаполнитьТаблицуНастроекФормыВыбораНоменклатурыСервер(Форма, ВидДокумента, НастройкиФормыВыбораНоменклатуры,
		ТипСохраняемыхНастроек, , ИмяТЧ);
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(Форма, ИмяТЧ,
		ДополнениеНаименованияНоменклатуры);

КонецПроцедуры

// Проверяет положение склада в Объекте и при необходимости переопределяет его
// 
// Параметры:
//  Объект - ФормаКлиентскогоПриложения
//  ИмяТЧ - Строка - Имя ТЧ
//  ИмяКолонкиСклад - Строка
//  ИмяРеквизитаСклад - Строка
Процедура ПроверитьПереопределитьПоложениеСклада(Объект, ИмяТЧ = "Запасы", ИмяКолонкиСклад = "СтруктурнаяЕдиница",
	ИмяРеквизитаСклад = "СтруктурнаяЕдиница") Экспорт
	
	РазрешитьСкладыВТабличныхЧастях = ПолучитьФункциональнуюОпцию("РазрешитьСкладыВТабличныхЧастях");
	
	РеквизитОбъектаСуществует = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПоложениеСклада", Объект.Метаданные());
	
	Если Не РеквизитОбъектаСуществует
		Или Объект.ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда 
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ИмяКолонкиСклад = "СтруктурнаяЕдиницаРезерв";
		ИмяРеквизитаСклад = "СтруктурнаяЕдиницаРезерв";
	КонецЕсли;
	
	УчетПоЯчейкам = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам")
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Ячейка", Объект.Метаданные());
	
	КоличествоСтрок = Объект[ИмяТЧ].Количество();
	
	Если Не КоличествоСтрок Тогда Возврат КонецЕсли;
	
	Если РазрешитьСкладыВТабличныхЧастях Тогда
		
		ЗначениеСклада = Неопределено;
		
		Если Не УчетПоЯчейкам Тогда
			
			Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
				
				Если ЗначениеСклада = Неопределено Тогда
					
					ЗначениеСклада = СтрокаТабличнойЧасти[ИмяКолонкиСклад];
					
					Если ЗначениеЗаполнено(ЗначениеСклада) Тогда
						Объект[ИмяРеквизитаСклад] = ЗначениеСклада;
					КонецЕсли;
					
					Продолжить
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти[ИмяКолонкиСклад])
					И НЕ СтрокаТабличнойЧасти[ИмяКолонкиСклад] = ЗначениеСклада Тогда
					Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
					Возврат;
				КонецЕсли;
				
				ЗначениеСклада = СтрокаТабличнойЧасти[ИмяКолонкиСклад];
			КонецЦикла;
			
			Возврат;
			
		КонецЕсли;
		
		Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
			
			Если ЗначениеСклада = Неопределено Тогда
				
				ЗначениеСклада = СтрокаТабличнойЧасти[ИмяКолонкиСклад];
				
				Если ЗначениеЗаполнено(ЗначениеСклада) Тогда
					Объект[ИмяРеквизитаСклад] = ЗначениеСклада;
					Объект.Ячейка = СтрокаТабличнойЧасти.Ячейка;
				КонецЕсли;
				
				Продолжить
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти[ИмяКолонкиСклад])
				И Не СтрокаТабличнойЧасти[ИмяКолонкиСклад] = ЗначениеСклада
				Или Не СтрокаТабличнойЧасти.Ячейка = Объект.Ячейка Тогда
				
				Объект.Ячейка = Справочники.Ячейки.ПустаяСсылка();
				Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
				Возврат;
				
			КонецЕсли;
			
			ЗначениеСклада = СтрокаТабличнойЧасти[ИмяКолонкиСклад];
			
		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект[ИмяТЧ][0][ИмяКолонкиСклад]) Тогда
			Объект[ИмяРеквизитаСклад] = Объект[ИмяТЧ][0][ИмяКолонкиСклад];
			
			Если УчетПоЯчейкам Тогда
				Объект.Ячейка = Объект[ИмяТЧ][0].Ячейка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет тип номенклатуры в табличной части
//
// Параметры:
//  Объект	 - ДанныеФормыСтруктура, ДокументОбъект	 - Заполняемый документ
//  ИмяТЧ	 - Строка								 - Имя табличной части
//
Процедура ЗаполнитьТипНоменклатурыВТабличнойЧасти(Объект, ИмяТЧ = "Запасы") Экспорт
	
	Если ТипЗнч(Объект[ИмяТЧ]) = Тип("ДанныеФормыКоллекция") Тогда
		ИспользуемаяНоменклатура = Объект[ИмяТЧ].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Иначе
		ИспользуемаяНоменклатура = Объект[ИмяТЧ].ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	ИмяРеквизита = "ТипНоменклатуры";
	ЗначенияТипов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ИспользуемаяНоменклатура, ИмяРеквизита, Истина);
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
		СтрокаТабличнойЧасти.ТипНоменклатуры = ЗначенияТипов.Получить(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает Массив номенклатуры с указанным типом, присутствующей в табличной части с указанным типом.
//
// Параметры:
//  Объект			 - ДанныеФормыСтруктура, ДокументОбъект	 - Обрабатываемый документ
//  ТипНоменклатуры	 - ПеречислениеСсылка.ТипыНоменклатуры	 - Искомый тип номенклатуры
//  ИмяТЧ			 - Строка								 - Имя табличной части 
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.Номенклатура 
//
Функция НоменклатураТабличнойЧастиПоТипу(Объект, ТипНоменклатуры, ИмяТЧ = "Запасы") Экспорт
	
	ТабличнаяЧасть = Объект[ИмяТЧ];
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры);
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ДанныеФормыКоллекция") Тогда
		Запрос.УстановитьПараметр("Номенклатура", ТабличнаяЧасть.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Иначе
		Запрос.УстановитьПараметр("Номенклатура", ТабличнаяЧасть.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли; 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)
	|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область ОбновлениеОстатков

// Обновление остатков номенклатуры в фоне
Процедура ОбновитьОстаткиНоменклатурыВФоне() Экспорт
	
	ВнешняяТранзакция = ТранзакцияАктивна();
	Если НЕ ВнешняяТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	// Тут будут ждать другие фоновые задания.
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	// Запрос возвращает разницу между регистром сведений ОстаткиТоваров и регистром накопления ЗапасыНаСкладах.
	// В запросе нельзя использовать ПОЛНОЕ СОЕДИНЕНИЕ из-за ограничений при работе на СУБД Postgresql.
	// Запрос корректно отрабатывает номенклатуру, которой нет в остатках РН, но есть в регистре сведений.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	| ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	| СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК Количество
	|ИЗ
	| (ВЫБРАТЬ
	|  ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|  ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|  0 КАК Количество
	| ИЗ
	|  РегистрНакопления.ЗапасыНаСкладах.Остатки КАК ЗапасыНаСкладахОстатки
	| 
	| ОБЪЕДИНИТЬ ВСЕ
	| 
	| ВЫБРАТЬ
	|  ОстаткиТоваров.Номенклатура,
	|  0,
	|  ОстаткиТоваров.Количество
	| ИЗ
	|  РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	| ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	| СУММА(ВложенныйЗапрос.КоличествоОстаток) <> СУММА(ВложенныйЗапрос.Количество)"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Номенклатура = Выборка.Номенклатура;
		Запись.Количество = Выборка.Количество;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Если НЕ ВнешняяТранзакция Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МассивТиповДокументовДляПроверкиКомиссииСНДС()
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЧекККМ"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
	
	Возврат МассивТипов;
	
КонецФункции

Функция МассивТиповОбрабатываемыхДокументовСкладскойУчет()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктОРасхождениях"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктОРасхожденияхПолученный"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	
	Возврат МассивТипов;
	
КонецФункции

Функция МассивТиповДокументовПоИмениТабличнойЧасти(ИмяТабличнойЧасти)
	
	МассивТипов = Новый Массив;
	
	Если ИмяТабличнойЧасти = "Расходы" Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
		МассивТипов.Добавить(Тип("ДокументСсылка.АктОРасхождениях"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ДополнительныеРасходы"));
		МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "Продукция" Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПроизводство"));
		МассивТипов.Добавить(Тип("ДокументСсылка.СборкаЗапасов"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетПереработчика"));
		МассивТипов.Добавить(Тип("ДокументСсылка.РаспределениеЗатрат"));
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "Отходы" Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.СборкаЗапасов"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетПереработчика"));
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "РаспределениеЗапасов" Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.СборкаЗапасов"));
		МассивТипов.Добавить(Тип("ДокументСсылка.РаспределениеЗатрат"));
	КонецЕсли;
	
	Возврат МассивТипов;
	
КонецФункции

// Заполняет колонку "ОстатокОбщий" в документе Установка цен значениями по остаткам
//   
// Параметры:
//  СтрокиОбхода 	- ТаблицаЗначений, ДанныеФормыКоллекция - Строки для обхода
//  ТаблицаОстатков - ТаблицаЗначений 
Процедура ЗаполнитьКолонкуОстатокОбщийУстановкаЦен(СтрокиОбхода, ТаблицаОстатков)
	
	ОбходСУчетомХарактеристик = ПолучитьПризнакОбходаСтрокПоХарактеристикамУстановкаЦен(СтрокиОбхода);
	
	Если НЕ ОбходСУчетомХарактеристик Тогда
		ПараметрыОтбора = Новый Структура("Номенклатура");  
	Иначе
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика"); 
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СтрокиОбхода Цикл  
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмеренияШаблон) 
			Или ТипЗнч(СтрокаТаблицы.ЕдиницаИзмеренияШаблон) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТаблицы.ЕдиницаИзмеренияШаблон.Коэффициент;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) 
			Или ТипЗнч(СтрокаТаблицы.Номенклатура) = Тип("Строка") Тогда 
			Продолжить; 
		КонецЕсли;
		
		ПараметрыОтбора.Номенклатура = СтрокаТаблицы.Номенклатура;
		
		Если ОбходСУчетомХарактеристик Тогда
			ПараметрыОтбора.Характеристика = СтрокаТаблицы.Характеристика;
		КонецЕсли;
		
		НайденныеСтрокиОстатки = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора); 	
		Если НайденныеСтрокиОстатки.Количество() > 0 Тогда
			СтрокаОстатка = НайденныеСтрокиОстатки[0]; 
		Иначе
			СтрокаОстатка = Неопределено;
		КонецЕсли; 
		
		Если СтрокаОстатка = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ОстатокОбщийСКоэффициентом = Окр(СтрокаОстатка.ОстатокОбщий / КоэффициентЕдиницыИзмерения, 3); 
		
		СтрокаТаблицы.ОстатокОбщий = ОстатокОбщийСКоэффициентом; 
	КонецЦикла;    

КонецПроцедуры

// Возвращает признак необходимости обхода строк по характеристикам.
//
// Параметры:
//  СтрокиОбхода - ТаблицаЗначений, ДанныеФормыКоллекция - Строки для обхода
Функция ПолучитьПризнакОбходаСтрокПоХарактеристикамУстановкаЦен(СтрокиОбхода) 
	
	ИмяКолонкиПоиска = "Характеристика"; 
	
	Если ТипЗнч(СтрокиОбхода) = Тип("ДанныеФормыКоллекция") Тогда			
		ПризнакОбходаСтрок = СтрокиОбхода.Выгрузить().Колонки.Найти(ИмяКолонкиПоиска) <> Неопределено;		
	Иначе  	
	    ПризнакОбходаСтрок = СтрокиОбхода.Колонки.Найти(ИмяКолонкиПоиска) <> Неопределено; 		
	КонецЕсли;
	
	Возврат ПризнакОбходаСтрок;	
КонецФункции

// Возвращает массив строк для копирования
//
// Параметры:
//  ТаблицаПоискаСтрок 	- ТаблицаЗначений.
//  НоменклатураОтбора 	- Массив из СправочникСсылка.Номенклатура 
//
// Возвращаемое значение:
// 	Массив из СтрокаТаблицыЗначений
Функция СформироватьМассивСтрокДляКопированияУстановкаЦен(ТаблицаПоискаСтрок, НоменклатураОтбора) 
	
	МассивСтрокКопировать = Новый Массив; 
	
	Для Каждого ЭлементМассива Из НоменклатураОтбора Цикл 
		
		МассивНайденныхСтрок = ТаблицаПоискаСтрок.НайтиСтроки(Новый Структура("Номенклатура", ЭлементМассива));
		Если МассивНайденныхСтрок.Количество() > 0 Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрокКопировать, МассивНайденныхСтрок);
		КонецЕсли;  
		
	КонецЦикла;   
		
	Возврат МассивСтрокКопировать;
КонецФункции

Функция МассивСкладовСДоступнымиЯчейками()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	СтруктурныеЕдиницы.ОрдерныйСклад КАК ОрдерныйСклад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ОрдерныйСклад
	|	И СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)";

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТекстЗапросаОстаткиУстановкаЦенНоменклатуры(ТекстЗапросаСХарактеристиками)
	
	Если ТекстЗапросаСХарактеристиками Тогда 
		
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК ОстатокОбщий
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &НоменклатураОтбора
		|				И Характеристика В (&МассивХарактеристик)
		|				И СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))) КАК ЗапасыНаСкладахОстатки"; 
		
	Иначе 
		
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешняяТаблица.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК ОстатокОбщий
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))) КАК ЗапасыНаСкладахОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНоменклатура КАК ВтНоменклатура
		|		ПО ЗапасыНаСкладахОстатки.Номенклатура = ВтНоменклатура.Номенклатура";
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции   

Функция ТекстЗапросаСписокСкладовОстаткиУстановкаЦенНоменклатуры(ИмяТаблицыДанныхФормы) 
		
	Если ИмяТаблицыДанныхФормы = "ТЧНоменклатура" Тогда 
		
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК Склад,
		|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))) КАК ЗапасыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница";    
		
	Иначе 
		
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК Склад,
		|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика
		|				И СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))) КАК ЗапасыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница"; 
			
	КонецЕсли;
		
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаОстаткиИРезервыЗаказНаПеремещение()
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиНаСкладеВсего
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)) КАК ЗапасыОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВТНоменклатура.Партия = ЗапасыОстатки.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) КАК КПоступлению,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ЗаказаноОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Отправитель
	|				И Номенклатура В (&Номенклатура)
	|				И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	&УчетПотребностиПоСкладам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Характеристика,
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Номенклатура,
	|	ЗаказыНаПроизводствоОстатки.Характеристика,
	|	СУММА(ЕСТЬNULL(ЗаказыНаПроизводствоОстатки.КоличествоОстаток, 0)),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство)
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Отправитель
	|				И Номенклатура В (&Номенклатура)
	|				И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|ГДЕ
	|	&УчетПотребностиПоСкладам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаПроизводствоОстатки.Номенклатура,
	|	ЗаказыНаПроизводствоОстатки.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыНаПеремещениеОстатки.Номенклатура,
	|	ЗаказыНаПеремещениеОстатки.Характеристика,
	|	СУММА(ЕСТЬNULL(ЗаказыНаПеремещениеОстатки.КоличествоОстаток, 0)),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение)
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Отправитель
	|				И Номенклатура В (&Номенклатура)
	|				И Характеристика В (&Характеристика)
	|				И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)
	|				И НЕ ЗаказНаПеремещение = &Ссылка) КАК ЗаказыНаПеремещениеОстатки
	|ГДЕ
	|	&УчетПотребностиПоСкладам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаПеремещениеОстатки.Номенклатура,
	|	ЗаказыНаПеремещениеОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказаноОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказаноОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказаноОстатки.КоличествоДокументов) КАК КоличествоДокументов,
	|	СУММА(ЗаказаноОстатки.КПоступлению) КАК КПоступлению
	|ПОМЕСТИТЬ ЗаказаноОстаткиИтог
	|ИЗ
	|	ЗаказаноОстатки КАК ЗаказаноОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноОстатки.Номенклатура,
	|	ЗаказаноОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗаказыНаПеремещениеОстатки.КоличествоОстаток, 0)) КАК НеОтгружено
	|ПОМЕСТИТЬ НеОтгруженоПоПеремещению
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|				,
	|				ЗаказНаПеремещение = &Ссылка
	|					И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)) КАК ЗаказыНаПеремещениеОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗаказыНаПеремещениеОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗаказыНаПеремещениеОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|	МИНИМУМ(ГрафикДвиженияЗапасов.Период) КАК ДатаПоступления
	|ПОМЕСТИТЬ ЗаказаноПоПериодам
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Отправитель
	|				И Номенклатура В (&Номенклатура)
	|				И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикДвиженияЗапасов КАК ГрафикДвиженияЗапасов
	|		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ГрафикДвиженияЗапасов.Заказ
	|			И ЗаказыПоставщикамОстатки.Номенклатура = ГрафикДвиженияЗапасов.Номенклатура
	|			И ЗаказыПоставщикамОстатки.Характеристика = ГрафикДвиженияЗапасов.Характеристика
	|			И ЗаказыПоставщикамОстатки.Организация = ГрафикДвиженияЗапасов.Организация
	|ГДЕ
	|	&УчетПотребностиПоСкладам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Характеристика,
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Номенклатура,
	|	ЗаказыНаПроизводствоОстатки.Характеристика,
	|	МИНИМУМ(ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш)
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Отправитель
	|				И Номенклатура В (&Номенклатура)
	|				И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|ГДЕ
	|	&УчетПотребностиПоСкладам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаПроизводствоОстатки.Характеристика,
	|	ЗаказыНаПроизводствоОстатки.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыНаПеремещениеОстатки.Номенклатура,
	|	ЗаказыНаПеремещениеОстатки.Характеристика,
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.ДатаПеремещения
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Отправитель
	|				И Номенклатура В (&Номенклатура)
	|				И Характеристика В (&Характеристика)
	|				И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)) КАК ЗаказыНаПеремещениеОстатки
	|ГДЕ
	|	&УчетПотребностиПоСкладам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаПеремещениеОстатки.Характеристика,
	|	ЗаказыНаПеремещениеОстатки.Номенклатура,
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.ДатаПеремещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказаноПоПериодам.Номенклатура КАК Номенклатура,
	|	ЗаказаноПоПериодам.Характеристика КАК Характеристика,
	|	МИНИМУМ(ЗаказаноПоПериодам.ДатаПоступления) КАК ДатаПоступления
	|ПОМЕСТИТЬ ЗаказаноПоПериодамИтог
	|ИЗ
	|	ЗаказаноПоПериодам КАК ЗаказаноПоПериодам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноПоПериодам.Номенклатура,
	|	ЗаказаноПоПериодам.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказаноОстаткиИтог.Номенклатура КАК Номенклатура,
	|	ЗаказаноОстаткиИтог.Характеристика КАК Характеристика,
	|	СУММА(ЗаказаноОстаткиИтог.КоличествоДокументов) КАК КоличествоДокументов,
	|	МИНИМУМ(ЗаказаноПоПериодамИтог.ДатаПоступления) КАК ДатаПоступления,
	|	СУММА(ЗаказаноОстаткиИтог.КПоступлению) КАК КПоступлению
	|ПОМЕСТИТЬ ЗаказаноИтог
	|ИЗ
	|	ЗаказаноОстаткиИтог КАК ЗаказаноОстаткиИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказаноПоПериодамИтог КАК ЗаказаноПоПериодамИтог
	|		ПО ЗаказаноОстаткиИтог.Номенклатура = ЗаказаноПоПериодамИтог.Номенклатура
	|			И ЗаказаноОстаткиИтог.Характеристика = ЗаказаноПоПериодамИтог.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноОстаткиИтог.Характеристика,
	|	ЗаказаноОстаткиИтог.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	0 КАК ОстатокПолучатель,
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокОтправитель
	|ПОМЕСТИТЬ ОстаткиНаСкладеОтправительИПолучатель
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И СтруктурнаяЕдиница = &Отправитель) КАК ЗапасыОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВТНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВТНоменклатура.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.Партия,
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0),
	|	0
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И СтруктурнаяЕдиница = &Получатель) КАК ЗапасыОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВТНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВТНоменклатура.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиНаСкладеОтправительИПолучатель.Номенклатура КАК Номенклатура,
	|	ОстаткиНаСкладеОтправительИПолучатель.Характеристика КАК Характеристика,
	|	ОстаткиНаСкладеОтправительИПолучатель.Партия КАК Партия,
	|	СУММА(ОстаткиНаСкладеОтправительИПолучатель.ОстатокПолучатель) КАК ОстатокПолучатель,
	|	СУММА(ОстаткиНаСкладеОтправительИПолучатель.ОстатокОтправитель) КАК ОстатокОтправитель
	|ПОМЕСТИТЬ ОстаткиНаСкладеОтправительИПолучательИтог
	|ИЗ
	|	ОстаткиНаСкладеОтправительИПолучатель КАК ОстаткиНаСкладеОтправительИПолучатель
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаСкладеОтправительИПолучатель.Характеристика,
	|	ОстаткиНаСкладеОтправительИПолучатель.Партия,
	|	ОстаткиНаСкладеОтправительИПолучатель.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗаказыНаПеремещениеОстатки.КоличествоОстаток, 0)) КАК КоличествоДвижение
	|ПОМЕСТИТЬ ОстатокПоЗаказамОтправитель
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|				,
	|				ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)
	|					И Организация = &Организация
	|					И Склад = &Отправитель) КАК ЗаказыНаПеремещениеОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗаказыНаПеремещениеОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗаказыНаПеремещениеОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗаказыНаПеремещениеОстатки.КоличествоОстаток, 0)) КАК КоличествоДвижение
	|ПОМЕСТИТЬ ОстатокПоЗаказамПолучатель
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|				,
	|				ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)
	|					И Организация = &Организация
	|					И Склад = &Получатель
	|					И НЕ ЗаказНаПеремещение = &Ссылка) КАК ЗаказыНаПеремещениеОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗаказыНаПеремещениеОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗаказыНаПеремещениеОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗаказыНаПеремещение.Количество, 0)) КАК КоличествоДвижение
	|ПОМЕСТИТЬ ДвижениеДокумента
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение КАК ЗаказыНаПеремещение
	|		ПО ВТНоменклатура.Номенклатура = ЗаказыНаПеремещение.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗаказыНаПеремещение.Характеристика
	|ГДЕ
	|	ЗаказыНаПеремещение.Регистратор = &Ссылка
	|	И ЗаказыНаПеремещение.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Отгрузка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	УправлениеЗапасами.МинимальныйУровеньЗапаса КАК МинимальныйУровеньЗапаса,
	|	УправлениеЗапасами.МаксимальныйУровеньЗапаса КАК МаксимальныйУровеньЗапаса
	|ПОМЕСТИТЬ УправлениеЗапасами
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УправлениеЗапасами КАК УправлениеЗапасами
	|		ПО ВТНоменклатура.Номенклатура = УправлениеЗапасами.Номенклатура
	|			И ВТНоменклатура.Характеристика = УправлениеЗапасами.Характеристика
	|ГДЕ
	|	УправлениеЗапасами.Организация = &Организация
	|	И УправлениеЗапасами.Склад = &Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиНаСкладеОтправительИПолучательИтог.ОстатокОтправитель, 0) КАК СвободноОтправитель,
	|	ЕСТЬNULL(ОстаткиНаСкладеОтправительИПолучательИтог.ОстатокПолучатель, 0) КАК СвободноПолучатель,
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	ЕСТЬNULL(ОстаткиНаСкладеВсего.КоличествоОстаток, 0) КАК ОстатокВсего,
	|	ЗаказаноИтог.ДатаПоступления КАК ДатаПоступления,
	|	ЕСТЬNULL(ЗаказаноИтог.КоличествоДокументов, 0) КАК КоличествоДокументов,
	|	ВТНоменклатура.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЕСТЬNULL(УправлениеЗапасами.МаксимальныйУровеньЗапаса, 0) КАК МаксимальныйОстаток,
	|	ЕСТЬNULL(УправлениеЗапасами.МинимальныйУровеньЗапаса, 0) КАК МинимальныйОстаток,
	|	ЕСТЬNULL(ЗаказаноИтог.КПоступлению, 0) КАК КПоступлению,
	|	ЕСТЬNULL(НеОтгруженоПоПеремещению.НеОтгружено, 0) КАК НеОтгружено,
	|	ЕСТЬNULL(ОстатокПоЗаказамПолучатель.КоличествоДвижение, 0) КАК Заказано
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНаСкладеОтправительИПолучательИтог КАК ОстаткиНаСкладеОтправительИПолучательИтог
	|		ПО ВТНоменклатура.Номенклатура = ОстаткиНаСкладеОтправительИПолучательИтог.Номенклатура
	|			И ВТНоменклатура.Характеристика = ОстаткиНаСкладеОтправительИПолучательИтог.Характеристика
	|			И ВТНоменклатура.Партия = ОстаткиНаСкладеОтправительИПолучательИтог.Партия
	|			И ВТНоменклатура.Номенклатура = ОстаткиНаСкладеОтправительИПолучательИтог.Номенклатура
	|			И ВТНоменклатура.Характеристика = ОстаткиНаСкладеОтправительИПолучательИтог.Характеристика
	|			И ВТНоменклатура.Партия = ОстаткиНаСкладеОтправительИПолучательИтог.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказаноИтог КАК ЗаказаноИтог
	|		ПО ВТНоменклатура.Номенклатура = ЗаказаноИтог.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗаказаноИтог.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстатокПоЗаказамОтправитель КАК ОстатокПоЗаказамОтправитель
	|		ПО ВТНоменклатура.Номенклатура = ОстатокПоЗаказамОтправитель.Номенклатура
	|			И ВТНоменклатура.Характеристика = ОстатокПоЗаказамОтправитель.Характеристика
	|			И ВТНоменклатура.Партия = ОстатокПоЗаказамОтправитель.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстатокПоЗаказамПолучатель КАК ОстатокПоЗаказамПолучатель
	|		ПО ВТНоменклатура.Номенклатура = ОстатокПоЗаказамПолучатель.Номенклатура
	|			И ВТНоменклатура.Характеристика = ОстатокПоЗаказамПолучатель.Характеристика
	|			И ВТНоменклатура.Партия = ОстатокПоЗаказамПолучатель.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНаСкладеВсего КАК ОстаткиНаСкладеВсего
	|		ПО ВТНоменклатура.Номенклатура = ОстаткиНаСкладеВсего.Номенклатура
	|			И ВТНоменклатура.Характеристика = ОстаткиНаСкладеВсего.Характеристика
	|			И ВТНоменклатура.Партия = ОстаткиНаСкладеВсего.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеОтгруженоПоПеремещению КАК НеОтгруженоПоПеремещению
	|		ПО ВТНоменклатура.Номенклатура = НеОтгруженоПоПеремещению.Номенклатура
	|			И ВТНоменклатура.Характеристика = НеОтгруженоПоПеремещению.Характеристика
	|			И ВТНоменклатура.Партия = НеОтгруженоПоПеремещению.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ УправлениеЗапасами КАК УправлениеЗапасами
	|		ПО ВТНоменклатура.Номенклатура = УправлениеЗапасами.Номенклатура
	|			И ВТНоменклатура.Характеристика = УправлениеЗапасами.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеДокумента КАК ДвижениеДокумента
	|		ПО ВТНоменклатура.Номенклатура = ДвижениеДокумента.Номенклатура
	|			И ВТНоменклатура.Характеристика = ДвижениеДокумента.Характеристика";
	
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТаблицаЗначенийРеквизитовНоменклатурыТабличнойЧасти(ТабличнаяЧасть)
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить(,"НомерСтроки, Номенклатура"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабличнаяЧасть.Номенклатура КАК НоменклатураТабЧасти,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерСтроки КАК НомерСтроки,
	|	Итог.НоменклатураТабЧасти КАК Номенклатура,
	|	ЕСТЬNULL(Номенклатура.ЭтоГруппа, ЛОЖЬ) КАК ЭтоГруппа,
	|	ЕСТЬNULL(Номенклатура.ПроверятьЗаполнениеХарактеристики, ЛОЖЬ) КАК ПроверятьЗаполнениеХарактеристики,
	|	ЕСТЬNULL(Номенклатура.ПроверятьЗаполнениеПартий, ЛОЖЬ) КАК ПроверятьЗаполнениеПартий,
	|	ЕСТЬNULL(Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) КАК ТипНоменклатуры
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Итог.НоменклатураТабЧасти = Номенклатура.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаЗначенийРеквизитовНоменклатурыТабличнойЧастиПересортица(ТабличнаяЧасть)
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить(,"НомерСтроки, Номенклатура, НоменклатураОприходование"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабличнаяЧасть.Номенклатура КАК НоменклатураТабЧасти,
	|	ТабличнаяЧасть.НоменклатураОприходование КАК НоменклатураОприходованиеТабЧасти,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Итог.НомерСтроки КАК НомерСтроки,
	|	Итог.НоменклатураТабЧасти КАК Номенклатура,
	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	ЕСТЬNULL(Номенклатура.ПроверятьЗаполнениеХарактеристики, ЛОЖЬ) КАК ПроверятьЗаполнениеХарактеристики,
	|	ЕСТЬNULL(Номенклатура.ПроверятьЗаполнениеПартий, ЛОЖЬ) КАК ПроверятьЗаполнениеПартий,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Итог.НоменклатураОприходованиеТабЧасти КАК НоменклатураОприходование,
	|	ЕСТЬNULL(НоменклатураОприходование.ПроверятьЗаполнениеПартий, ЛОЖЬ) КАК ПроверятьЗаполнениеПартийОприходование,
	|	ЕСТЬNULL(НоменклатураОприходование.ПроверятьЗаполнениеХарактеристики, ЛОЖЬ) КАК ПроверятьЗаполнениеХарактеристикиОприходование
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Итог.НоменклатураТабЧасти = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураОприходование
	|		ПО Итог.НоменклатураОприходованиеТабЧасти = НоменклатураОприходование.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОграничиватьТипСклада(ВидДокумента)
	
	Результат = ВидДокумента <> "ЗаказПоставщику";
	Возврат Результат;

КонецФункции

Функция ТекстЗапросаРезервПоОстаткамЗаказПокупателяБезРазбиения()
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиНаСкладе
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&Организации)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|		ПО ВТНоменклатура.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВТНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВТНоменклатура.СтруктурнаяЕдиницаРезерв = ЗапасыОстатки.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв,
	|	ВТНоменклатура.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ) КАК КоличествоДвижение
	|ПОМЕСТИТЬ ДвижениеДокумента
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|		ПО ВТНоменклатура.Номенклатура = ДвиженияДокументаЗапасы.Номенклатура
	|			И ВТНоменклатура.Характеристика = ДвиженияДокументаЗапасы.Характеристика
	|			И ВТНоменклатура.Партия = ДвиженияДокументаЗапасы.Партия
	|			И ВТНоменклатура.СтруктурнаяЕдиницаРезерв = ДвиженияДокументаЗапасы.СтруктурнаяЕдиница
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		КОНЕЦ
	|	И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв,
	|	ВТНоменклатура.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Запасы.Период КАК Период,
	|	Запасы.Регистратор КАК Регистратор,
	|	Запасы.НомерСтроки КАК НомерСтроки,
	|	Запасы.Активность КАК Активность,
	|	Запасы.ВидДвижения КАК ВидДвижения,
	|	Запасы.Организация КАК Организация,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Запасы.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Запасы.Количество КАК Количество,
	|	Запасы.Сумма КАК Сумма
	|ПОМЕСТИТЬ ДвиженияДокументаЗапасы
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА Запасы.ЗаказПокупателя = &Ссылка
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НЕ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА НЕ Запасы.Регистратор = &Ссылка
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ) КАК КоличествоДвижение
	|ПОМЕСТИТЬ ДвижениеРезервовДругимиДокументами
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияДокументаЗапасы КАК ДвиженияДокументаЗапасы
	|		ПО ВТНоменклатура.Номенклатура = ДвиженияДокументаЗапасы.Номенклатура
	|			И ВТНоменклатура.Характеристика = ДвиженияДокументаЗапасы.Характеристика
	|			И ВТНоменклатура.Партия = ДвиженияДокументаЗапасы.Партия
	|			И ВТНоменклатура.СтруктурнаяЕдиницаРезерв = ДвиженияДокументаЗапасы.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Партия,
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв,
	|	ВТНоменклатура.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Характеристика КАК Характеристика,
	|	ВТНоменклатура.Партия КАК Партия,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	СУММА(ЕСТЬNULL(ДвижениеДокумента.КоличествоДвижение, 0) + ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ДвижениеРезервовДругимиДокументами.КоличествоДвижение, 0) КАК РезервДругимиДокументами
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНаСкладе КАК ОстаткиНаСкладе
	|		ПО ВТНоменклатура.Номенклатура = ОстаткиНаСкладе.Номенклатура
	|			И ВТНоменклатура.Характеристика = ОстаткиНаСкладе.Характеристика
	|			И ВТНоменклатура.Партия = ОстаткиНаСкладе.Партия
	|			И ВТНоменклатура.СтруктурнаяЕдиницаРезерв = ОстаткиНаСкладе.СтруктурнаяЕдиницаРезерв
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеДокумента КАК ДвижениеДокумента
	|		ПО ВТНоменклатура.Номенклатура = ДвижениеДокумента.Номенклатура
	|			И ВТНоменклатура.Характеристика = ДвижениеДокумента.Характеристика
	|			И ВТНоменклатура.Партия = ДвижениеДокумента.Партия
	|			И ВТНоменклатура.СтруктурнаяЕдиницаРезерв = ДвижениеДокумента.СтруктурнаяЕдиницаРезерв
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеРезервовДругимиДокументами КАК ДвижениеРезервовДругимиДокументами
	|		ПО ВТНоменклатура.Номенклатура = ДвижениеРезервовДругимиДокументами.Номенклатура
	|			И ВТНоменклатура.Характеристика = ДвижениеРезервовДругимиДокументами.Характеристика
	|			И ВТНоменклатура.Партия = ДвижениеРезервовДругимиДокументами.Партия
	|			И ВТНоменклатура.СтруктурнаяЕдиницаРезерв = ДвижениеРезервовДругимиДокументами.СтруктурнаяЕдиницаРезерв
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатура.Характеристика,
	|	ВТНоменклатура.СтруктурнаяЕдиницаРезерв,
	|	ВТНоменклатура.Номенклатура,
	|	ВТНоменклатура.Партия,
	|	ЕСТЬNULL(ДвижениеРезервовДругимиДокументами.КоличествоДвижение, 0)";
	
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаЗаполнитьРезервПоОстаткамЗаказНаПроизводство()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	0 КАК ВРезервеТекСклад,
	|	0 КАК РезервТекДокумент,
	|	0 КАК РасходПоРезерву,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ЗапасыОстатки
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			(Организация, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	|				(ВЫБРАТЬ
	|					&Организация,
	|					ТаблицаЗапасы.Номенклатура,
	|					ТаблицаЗапасы.Характеристика,
	|					ТаблицаЗапасы.Партия,
	|					ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|				ИЗ
	|					ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияДокументаЗапасы.Организация,
	|	ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|	ДвиженияДокументаЗапасы.Номенклатура,
	|	ДвиженияДокументаЗапасы.Характеристика,
	|	ДвиженияДокументаЗапасы.Партия,
	|	0,
	|	0,
	|	ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0),
	|	0,
	|	ДвиженияДокументаЗапасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЗаказыЕсть
	|				ТОГДА ДвиженияДокументаЗапасы.ЗаказПокупателя В (&Ссылка)
	|		КОНЕЦ
	|	И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДвиженияДокументаЗапасы.Регистратор = &СсылкаТекДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияДокументаЗапасы.Организация,
	|	ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|	ДвиженияДокументаЗапасы.Номенклатура,
	|	ДвиженияДокументаЗапасы.Характеристика,
	|	ДвиженияДокументаЗапасы.Партия,
	|	0,
	|	-1 * ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0),
	|	0,
	|	0,
	|	ДвиженияДокументаЗапасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЗаказыЕсть
	|				ТОГДА ДвиженияДокументаЗапасы.ЗаказПокупателя В (&Ссылка)
	|		КОНЕЦ
	|	И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ ТИПЗНАЧЕНИЯ(ДвиженияДокументаЗапасы.Регистратор) = ТИП(Документ.ЗаказНаПроизводство)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	0,
	|	Запасы.Количество,
	|	0,
	|	0,
	|	Запасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ВЫБОР
	|			КОГДА &ЗаказыЕсть
	|				ТОГДА Запасы.ЗаказПокупателя В (&Ссылка)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	0,
	|	0,
	|	0,
	|	Запасы.Количество,
	|	Запасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВЫБОР
	|			КОГДА &ЗаказыЕсть
	|				ТОГДА Запасы.ЗаказПокупателя В (&Ссылка)
	|		КОНЕЦ
	|	И ТИПЗНАЧЕНИЯ(Запасы.Регистратор) = ТИП(Документ.СборкаЗапасов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ЗапасыОстатки.СтруктурнаяЕдиница = &ПриоритетныйСклад
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗапасыОстатки.ВРезервеТекСклад, 0) < 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ЗапасыОстатки.ВРезервеТекСклад, 0)
	|		КОНЕЦ) КАК ВРезервеТекСклад,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.РезервТекДокумент, 0)) КАК РезервТекДокумент,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.РасходПоРезерву, 0)) КАК РасходПоРезерву,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВтИтог
	|ИЗ
	|	ЗапасыОстатки КАК ЗапасыОстатки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЗапасыОстатки.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ЗапасыОстатки.СтруктурнаяЕдиница = &ПриоритетныйСклад
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.Организация КАК Организация,
	|	ВтИтог.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтИтог.Номенклатура КАК Номенклатура,
	|	ВтИтог.Характеристика КАК Характеристика,
	|	ВтИтог.Партия КАК Партия,
	|	ВтИтог.КоличествоОстаток + (ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент) - ВтИтог.РасходПоРезерву КАК КоличествоОстаток,
	|	ВтИтог.Приоритет КАК Приоритет,
	|	ВтИтог.ВРезервеТекСклад КАК ВРезервеТекСклад,
	|	ВтИтог.РезервТекДокумент КАК РезервТекДокумент,
	|	ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент КАК РезервПоДругимДокументам,
	|	ВЫБОР
	|		КОГДА ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент >= ВтИтог.РасходПоРезерву
	|			ТОГДА 0
	|		ИНАЧЕ ВтИтог.РасходПоРезерву - (ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент)
	|	КОНЕЦ КАК НеотъемлемыйРезервТекДокумент,
	|	ВтИтог.РасходПоРезерву КАК РасходПоРезерву,
	|	ВтИтог.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ВтИтог.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СвободныйОстаток
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеотъемлемыйРезервТекДокумент УБЫВ,
	|	Приоритет";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьРезервПоОстаткам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	0 КАК ВРезервеТекСклад,
	|	0 КАК РезервТекДокумент,
	|	0 КАК РасходПоРезерву,
	|	ЗапасыОстатки.ЗаказПокупателя
	|ПОМЕСТИТЬ ЗапасыОстатки
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(, (Организация, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	|		(ВЫБРАТЬ
	|			&Организация,
	|			ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|			ТаблицаЗапасы.Номенклатура,
	|			ТаблицаЗапасы.Характеристика,
	|			ТаблицаЗапасы.Партия,
	|			ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|		ИЗ
	|			ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияДокументаЗапасы.Организация,
	|	ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|	ДвиженияДокументаЗапасы.СчетУчета,
	|	ДвиженияДокументаЗапасы.Номенклатура,
	|	ДвиженияДокументаЗапасы.Характеристика,
	|	ДвиженияДокументаЗапасы.Партия,
	|	ВЫБОР
	|		КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ДвиженияДокументаЗапасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|ГДЕ
	|	ВЫБОР
	|		КОГДА НЕ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|	КОНЕЦ
	|	И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	0,
	|	Запасы.Количество,
	|	0,
	|	0,
	|	Запасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ВЫБОР
	|		КОГДА НЕ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА Запасы.ЗаказПокупателя = &Ссылка
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	0,
	|	0,
	|	0,
	|	Запасы.Количество,
	|	Запасы.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВЫБОР
	|		КОГДА НЕ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА Запасы.ЗаказПокупателя = &Ссылка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ЗапасыОстатки.СтруктурнаяЕдиница = &ПриоритетныйСклад
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.ВРезервеТекСклад, 0)) КАК ВРезервеТекСклад,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.РезервТекДокумент, 0)) КАК РезервТекДокумент,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.РасходПоРезерву, 0)) КАК РасходПоРезерву
	|ПОМЕСТИТЬ ВтИтог
	|ИЗ
	|	ЗапасыОстатки КАК ЗапасыОстатки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЗапасыОстатки.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗапасыОстатки.СтруктурнаяЕдиница = &ПриоритетныйСклад
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.Организация КАК Организация,
	|	ВтИтог.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтИтог.СчетУчета КАК СчетУчета,
	|	ВтИтог.Номенклатура КАК Номенклатура,
	|	ВтИтог.Характеристика КАК Характеристика,
	|	ВтИтог.Партия КАК Партия,
	|	ВтИтог.КоличествоОстаток + (ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент) - ВтИтог.РасходПоРезерву КАК
	|		КоличествоОстаток,
	|	ВтИтог.Приоритет КАК Приоритет,
	|	ВтИтог.ВРезервеТекСклад КАК ВРезервеТекСклад,
	|	ВтИтог.РезервТекДокумент КАК РезервТекДокумент,
	|	ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент КАК РезервПоДругимДокументам,
	|	ВЫБОР
	|		КОГДА ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент >= ВтИтог.РасходПоРезерву
	|			ТОГДА 0
	|		ИНАЧЕ ВтИтог.РасходПоРезерву - (ВтИтог.ВРезервеТекСклад - ВтИтог.РезервТекДокумент)
	|	КОНЕЦ КАК НеотъемлемыйРезервТекДокумент,
	|	ВтИтог.РасходПоРезерву КАК РасходПоРезерву
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВтИтог.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеотъемлемыйРезервТекДокумент УБЫВ,
	|	Приоритет";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьКоличествоПоОстаткамИРезервам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &ЗаказВШапке
	|			ТОГДА &Заказ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|						И ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					ТОГДА ТаблицаЗапасы.Заказ
	|				ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВтНоменклатураВыбор
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатурыЗапас
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатураВыбор.Номенклатура КАК Номенклатура,
	|	ВтНоменклатураВыбор.Характеристика КАК Характеристика,
	|	ВтНоменклатураВыбор.Партия КАК Партия,
	|	ВтНоменклатураВыбор.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТДекартовоПроизведениеНоменклатурыИСклада
	|ИЗ
	|	ВтНоменклатураВыбор КАК ВтНоменклатураВыбор,
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
	|					И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура КАК Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика КАК Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия КАК Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ОстаткиНаСкладе
	|ИЗ
	|	ВТДекартовоПроизведениеНоменклатурыИСклада КАК ВТДекартовоПроизведениеНоменклатурыИСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&Организации)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И Номенклатура В (&МассивНоменклатуры)
	|					И (НЕ &ОтборПоСкладам
	|						ИЛИ СтруктурнаяЕдиница В (&СписокДоступныхСкладов))) КАК ЗапасыОстатки
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ЗапасыОстатки.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура КАК Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика КАК Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия КАК Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ОстаткиРезервов
	|ИЗ
	|	ВТДекартовоПроизведениеНоменклатурыИСклада КАК ВТДекартовоПроизведениеНоменклатурыИСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&Организации)
	|					И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И Номенклатура В (&МассивНоменклатуры)
	|					И (НЕ &ОтборПоСкладам
	|						ИЛИ СтруктурнаяЕдиница В (&СписокДоступныхСкладов))) КАК ЗапасыОстатки
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ЗапасыОстатки.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ) КАК ОтгруженоБезРезерва,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура КАК Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика КАК Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия КАК Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя КАК ЗаказПокупателя1
	|ПОМЕСТИТЬ ДвижениеДокументаБезРезерва
	|ИЗ
	|	ВТДекартовоПроизведениеНоменклатурыИСклада КАК ВТДекартовоПроизведениеНоменклатурыИСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ДвиженияДокументаЗапасы.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ДвиженияДокументаЗапасы.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ДвиженияДокументаЗапасы.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ДвиженияДокументаЗапасы.СтруктурнаяЕдиница
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя = ДвиженияДокументаЗапасы.ЗаказПокупателя
	|ГДЕ
	|	ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|	И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДвиженияДокументаЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ) КАК ОтгруженоРезерва,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура КАК Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика КАК Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия КАК Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя КАК ЗаказПокупателя1
	|ПОМЕСТИТЬ ДвижениеДокументаПоРезерву
	|ИЗ
	|	ВТДекартовоПроизведениеНоменклатурыИСклада КАК ВТДекартовоПроизведениеНоменклатурыИСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ДвиженияДокументаЗапасы.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ДвиженияДокументаЗапасы.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ДвиженияДокументаЗапасы.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ДвиженияДокументаЗапасы.СтруктурнаяЕдиница
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя = ДвиженияДокументаЗапасы.ЗаказПокупателя
	|ГДЕ
	|	ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|	И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ ДвиженияДокументаЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ОстаткиРезервов.КоличествоОстаток, 0) КАК Зарезервировано,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура КАК Номенклатура,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика КАК Характеристика,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.Партия КАК Партия,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя КАК Заказ,
	|	ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = &ПриоритетныйСклад
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет,
	|	ЕСТЬNULL(ДвижениеДокументаПоРезерву.ОтгруженоРезерва, 0) КАК ОтгруженоРезерва,
	|	ЕСТЬNULL(ДвижениеДокумента.ОтгруженоБезРезерва, 0) КАК ОтгруженоБезРезерва,
	|	ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0) + ЕСТЬNULL(ОстаткиРезервов.КоличествоОстаток, 0) + ЕСТЬNULL(ДвижениеДокументаПоРезерву.ОтгруженоРезерва, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ДвижениеДокументаПоРезерву.ОтгруженоРезерва, 0) + ЕСТЬNULL(ОстаткиРезервов.КоличествоОстаток, 0) КАК ВсегоРезерва,
	|	ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0) + ЕСТЬNULL(ОстаткиРезервов.КоличествоОстаток, 0) + ЕСТЬNULL(ДвижениеДокументаПоРезерву.ОтгруженоРезерва, 0) КАК ОстатокСУчетомДвижения,
	|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка
	|ИЗ
	|	ВТДекартовоПроизведениеНоменклатурыИСклада КАК ВТДекартовоПроизведениеНоменклатурыИСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНаСкладе КАК ОстаткиНаСкладе
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ОстаткиНаСкладе.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ОстаткиНаСкладе.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ОстаткиНаСкладе.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ОстаткиНаСкладе.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеДокументаБезРезерва КАК ДвижениеДокумента
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ДвижениеДокумента.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ДвижениеДокумента.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ДвижениеДокумента.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя = ДвижениеДокумента.ЗаказПокупателя1
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ДвижениеДокумента.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиРезервов КАК ОстаткиРезервов
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ОстаткиРезервов.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя = ОстаткиРезервов.ЗаказПокупателя
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ОстаткиРезервов.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ОстаткиРезервов.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ОстаткиРезервов.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеДокументаПоРезерву КАК ДвижениеДокументаПоРезерву
	|		ПО ВТДекартовоПроизведениеНоменклатурыИСклада.Номенклатура = ДвижениеДокументаПоРезерву.Номенклатура
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Характеристика = ДвижениеДокументаПоРезерву.Характеристика
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.Партия = ДвижениеДокументаПоРезерву.Партия
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.ЗаказПокупателя = ДвижениеДокументаПоРезерву.ЗаказПокупателя1
	|			И ВТДекартовоПроизведениеНоменклатурыИСклада.СтруктурнаяЕдиница = ДвижениеДокументаПоРезерву.СтруктурнаяЕдиница
	|ГДЕ
	|	(НЕ ЕСТЬNULL(ОстаткиРезервов.КоличествоОстаток, 0) = 0
	|			ИЛИ НЕ ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0) = 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ,
	|	Приоритет,
	|	Зарезервировано";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаОстаткиИРезервы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатура.Номенклатура КАК НоменклатураЗапасов,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Партия КАК Партия,
	|	ТаблицаНоменклатура.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ ВтНоменклатураБезСклада
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(ЗапасыОстаткиРезервы.КоличествоОстаток, 0)) КАК РезервНаСкладах,
	|	СУММА(ЕСТЬNULL(ЗапасыОстаткиОбщие.КоличествоОстаток, 0)) КАК ОстатокОбщий,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ЕСТЬNULL(ЗапасыОстаткиРезервы.КоличествоОстаток, 0)) КАК РезервНаСкладахИтог
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ВЫБОР
	|					КОГДА НЕ &ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						ТОГДА ЗаказПокупателя = &ЗаказПокупателя
	|				КОНЕЦ) КАК ЗапасыОстаткиРезервы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиРезервы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиРезервы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиРезервы.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)) КАК ЗапасыОстаткиОбщие
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиОбщие.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиОбщие.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиОбщие.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК ОстатокТекСклад,
	|	СУММА(ЕСТЬNULL(ЗапасыОстаткиРезервТекСклад.КоличествоОстаток, 0)) КАК РезервТекСклад
	|ПОМЕСТИТЬ ОстаткиВРазрезеСкладов
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ВЫБОР
	|					КОГДА НЕ &ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						ТОГДА ЗаказПокупателя = &ЗаказПокупателя
	|				КОНЕЦ) КАК ЗапасыОстаткиРезервТекСклад
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстаткиРезервТекСклад.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстаткиРезервТекСклад.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстаткиРезервТекСклад.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстаткиРезервТекСклад.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ РезервСделанныйЗаказом
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|ГДЕ
	|	Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|	И Запасы.Регистратор = &ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.СтруктурнаяЕдиница,
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия
	|ПОМЕСТИТЬ РезервСделанныйЗаказомПоВсемСкладам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|ГДЕ
	|	Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|	И Запасы.Регистратор = &ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОстаткиДокументы.ЗаказПоставщикуДатаПоступления КАК ДатаПоступления,
	|	ЗаказаноНоменклатуры.ЗаказаноБезРезерва КАК ЗаказаноБезРезерва,
	|	ЗаказаноНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЗаказаноНоменклатуры.Характеристика КАК Характеристика,
	|	ЗаказаноНоменклатуры.Организация КАК Организация,
	|	ЗаказаноНоменклатуры.КоличествоДокументовЗаказано КАК КоличествоДокументовЗаказано
	|ПОМЕСТИТЬ Заказано
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВложенныйЗапрос.ЗаказаноБезРезерва) КАК ЗаказаноБезРезерва,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.Характеристика КАК Характеристика,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.КоличествоДокументовЗаказано) КАК КоличествоДокументовЗаказано
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)) КАК ЗаказаноБезРезерва,
	|			ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|			ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|			ЗаказыПоставщикамОстатки.Организация КАК Организация,
	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК КоличествоДокументовЗаказано
	|		ИЗ
	|			РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыПоставщикамОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|					И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыПоставщикамОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|		ГДЕ
	|			ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыПоставщикамОстатки.Характеристика,
	|			ЗаказыПоставщикамОстатки.Организация,
	|			ЗаказыПоставщикамОстатки.Номенклатура,
	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)),
	|			ЗаказыНаПроизводствоОстатки.Номенклатура,
	|			ЗаказыНаПроизводствоОстатки.Характеристика,
	|			ЗаказыНаПроизводствоОстатки.Организация,
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство
	|		ИЗ
	|			РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыНаПроизводствоОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|					И ЗаказыНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыНаПроизводствоОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|		ГДЕ
	|			ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство,
	|			ЗаказыНаПроизводствоОстатки.Номенклатура,
	|			ЗаказыНаПроизводствоОстатки.Характеристика,
	|			ЗаказыНаПроизводствоОстатки.Организация) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.Характеристика,
	|		ВложенныйЗапрос.Организация) КАК ЗаказаноНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(ВложенныйЗапрос.ЗаказПоставщикуДатаПоступления) КАК ЗаказПоставщикуДатаПоступления,
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|			ВложенныйЗапрос.Характеристика КАК Характеристика
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГрафикДвиженияЗапасов.Период КАК ЗаказПоставщикуДатаПоступления,
	|				ЗаказыПоставщикамОстатки.Организация КАК Организация,
	|				ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|				ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика
	|			ИЗ
	|				РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикДвиженияЗапасов КАК ГрафикДвиженияЗапасов
	|					ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ГрафикДвиженияЗапасов.Заказ
	|						И ЗаказыПоставщикамОстатки.Номенклатура = ГрафикДвиженияЗапасов.Номенклатура
	|						И ЗаказыПоставщикамОстатки.Характеристика = ГрафикДвиженияЗапасов.Характеристика
	|						И ЗаказыПоставщикамОстатки.Организация = ГрафикДвиженияЗапасов.Организация
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|							,
	|							Организация = &Организация
	|								И Номенклатура В (&Номенклатура)
	|								И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|					ПО ЗаказыПоставщикамОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|						И ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|						И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|						И ЗаказыПоставщикамОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|			ГДЕ
	|				ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш,
	|				ЗаказыНаПроизводствоОстатки.Организация,
	|				ЗаказыНаПроизводствоОстатки.Номенклатура,
	|				ЗаказыНаПроизводствоОстатки.Характеристика
	|			ИЗ
	|				РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|							,
	|							Организация = &Организация
	|								И Номенклатура В (&Номенклатура)
	|								И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|					ПО ЗаказыНаПроизводствоОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|						И ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|						И ЗаказыНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|						И ЗаказыНаПроизводствоОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|			ГДЕ
	|				ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.Характеристика,
	|			ВложенныйЗапрос.Номенклатура) КАК ЗаказыПоставщикамОстаткиДокументы
	|		ПО ЗаказаноНоменклатуры.Номенклатура = ЗаказыПоставщикамОстаткиДокументы.Номенклатура
	|			И ЗаказаноНоменклатуры.Характеристика = ЗаказыПоставщикамОстаткиДокументы.Характеристика
	|			И ЗаказаноНоменклатуры.Организация = ЗаказыПоставщикамОстаткиДокументы.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстаткиДокументы.ЗаказПоставщикуДатаПоступления,
	|	ЗаказаноНоменклатуры.ЗаказаноБезРезерва,
	|	ЗаказаноНоменклатуры.Номенклатура,
	|	ЗаказаноНоменклатуры.Характеристика,
	|	ЗаказаноНоменклатуры.Организация,
	|	ЗаказаноНоменклатуры.КоличествоДокументовЗаказано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(РазмещениеЗаказовОстатки.КоличествоОстаток) КАК РезервЗаказано,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(РазмещениеЗаказовОстатки.КоличествоОстаток) КАК РезервЗаказаноИтог
	|ПОМЕСТИТЬ Размещено
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ВЫБОР
	|						КОГДА НЕ &ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|							ТОГДА ЗаказПокупателя = &ЗаказПокупателя
	|					КОНЕЦ
	|					И НЕ ТИПЗНАЧЕНИЯ(ИсточникОбеспечения) = ТИП(Документ.ЗаказНаПеремещение)) КАК РазмещениеЗаказовОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = РазмещениеЗаказовОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(Запасы.Количество) КАК ОтгрузкаРезерва,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия
	|ПОМЕСТИТЬ ОтгрузкаПоРезервам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|ГДЕ
	|	Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ ТИПЗНАЧЕНИЯ(Запасы.Регистратор) = ТИП(Документ.резервированиеЗапасов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(Заказано.ДатаПоступления, 0) КАК ДатаПоступления,
	|	ЕСТЬNULL(Заказано.КоличествоДокументовЗаказано, 0) КАК КоличествоДокументовЗаказано,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.НоменклатураЗапасов КАК Номенклатура,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаРезерв,
	|	ЕСТЬNULL(Размещено.РезервЗаказано, 0) КАК РезервЗаказано,
	|	ЕСТЬNULL(Заказано.ЗаказаноБезРезерва, 0) КАК ЗаказаноБезРезерва,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ОстатокТекСклад,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщий,
	|	ЕСТЬNULL(Остатки.РезервНаСкладахИтог, 0) КАК РезервНаСкладахИтог,
	|	ЕСТЬNULL(Размещено.РезервЗаказаноИтог, 0) КАК РезервЗаказаноИтог,
	|	ЛОЖЬ КАК СтрокаОбработана,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ОстатокТекСкладПослеРаспределения,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) + ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК МожноОтгрузитьПроведенныйДокумент,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщийПослеРаспределения,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) - ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК РезервТекСклад,
	|	ЕСТЬNULL(Остатки.РезервНаСкладах, 0) - ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК РезервНаСкладах,
	|	ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказом,
	|	ОстаткиВРазрезеСкладов.РезервТекСклад КАК РезервТекСкладОбщий,
	|	ЕСТЬNULL(ОтгрузкаПоРезервам.ОтгрузкаРезерва, 0) КАК ОтгрузкаРезерва,
	|	ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказомВсеСклады
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Заказано КАК Заказано
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Заказано.Номенклатура
	|			И ВтНоменклатура.Характеристика = Заказано.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВРазрезеСкладов КАК ОстаткиВРазрезеСкладов
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиВРазрезеСкладов.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОстаткиВРазрезеСкладов.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиВРазрезеСкладов.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОстаткиВРазрезеСкладов.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ Размещено КАК Размещено
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Размещено.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Размещено.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказом.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказом.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказом.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтгрузкаПоРезервам КАК ОтгрузкаПоРезервам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОтгрузкаПоРезервам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОтгрузкаПоРезервам.Характеристика
	|			И ВтНоменклатура.Партия = ОтгрузкаПоРезервам.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказомПоВсемСкладам КАК РезервСделанныйЗаказомПоВсемСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказомПоВсемСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказомПоВсемСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказомПоВсемСкладам.Партия";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиИРезервыВРазрезеЗаказов()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатура.Номенклатура КАК НоменклатураЗапасов,
	|	ТаблицаНоменклатура.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Партия КАК Партия,
	|	ТаблицаНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ ВтНоменклатураБезСклада
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(ЗапасыОстаткиОбщие.КоличествоОстаток, 0)) КАК ОстатокОбщий,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И ВЫБОР
	|						КОГДА НЕ ТИПЗНАЧЕНИЯ(&Регистратор) = ТИП(Документ.СборкаЗапасов)
	|								И НЕ ТИПЗНАЧЕНИЯ(&Регистратор) = ТИП(Документ.ЗаказНаПроизводство)
	|							ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ЗапасыОстаткиОбщие
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиОбщие.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиОбщие.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиОбщие.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК РезервНаСкладах,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК РезервНаСкладахИтог
	|ПОМЕСТИТЬ ОстаткиРезервыОбщие
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			ВЫБОР
	|				КОГДА &ЕстьЗаказы
	|					ТОГДА ЗаказПокупателя В (&ЗаказПокупателя)
	|			КОНЕЦ) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК ОстатокТекСклад,
	|	СУММА(ЕСТЬNULL(ЗапасыОстаткиРезервТекСклад.КоличествоОстаток, 0)) КАК РезервТекСклад,
	|	ВтНоменклатура.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ОстаткиВРазрезеСкладов
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ВЫБОР
	|					КОГДА &ЕстьЗаказы
	|						ТОГДА ЗаказПокупателя В (&ЗаказПокупателя)
	|				КОНЕЦ) КАК ЗапасыОстаткиРезервТекСклад
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстаткиРезервТекСклад.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстаткиРезервТекСклад.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстаткиРезервТекСклад.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстаткиРезервТекСклад.СтруктурнаяЕдиница
	|			И ВтНоменклатура.ЗаказПокупателя = ЗапасыОстаткиРезервТекСклад.ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ РезервСделанныйЗаказом
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.ЗаказПокупателя = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&ЗаказПокупателя)
	|	И Запасы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.СтруктурнаяЕдиница,
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия
	|ПОМЕСТИТЬ РезервСделанныйЗаказомПоВсемСкладам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&ЗаказПокупателя)
	|	И Запасы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&ЗаказПокупателя)
	|	И Запасы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	Запасы.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОстаткиДокументы.ЗаказПоставщикуДатаПоступления КАК ДатаПоступления,
	|	ЗаказаноНоменклатуры.ЗаказаноБезРезерва КАК ЗаказаноБезРезерва,
	|	ЗаказаноНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЗаказаноНоменклатуры.Характеристика КАК Характеристика,
	|	ЗаказаноНоменклатуры.Организация КАК Организация,
	|	ЗаказаноНоменклатуры.КоличествоДокументовЗаказано КАК КоличествоДокументовЗаказано
	|ПОМЕСТИТЬ Заказано
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВложенныйЗапрос.ЗаказаноБезРезерва) КАК ЗаказаноБезРезерва,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.Характеристика КАК Характеристика,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.КоличествоДокументовЗаказано) КАК КоличествоДокументовЗаказано
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)) КАК ЗаказаноБезРезерва,
	|			ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|			ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|			ЗаказыПоставщикамОстатки.Организация КАК Организация,
	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК КоличествоДокументовЗаказано
	|		ИЗ
	|			РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыПоставщикамОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыПоставщикамОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|					И ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыПоставщикамОстатки.Характеристика,
	|			ЗаказыПоставщикамОстатки.Организация,
	|			ЗаказыПоставщикамОстатки.Номенклатура,
	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)),
	|			ЗаказыНаПроизводствоОстатки.Номенклатура,
	|			ЗаказыНаПроизводствоОстатки.Характеристика,
	|			ЗаказыНаПроизводствоОстатки.Организация,
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство
	|		ИЗ
	|			РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыНаПроизводствоОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыНаПроизводствоОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|					И ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство,
	|			ЗаказыНаПроизводствоОстатки.Номенклатура,
	|			ЗаказыНаПроизводствоОстатки.Характеристика,
	|			ЗаказыНаПроизводствоОстатки.Организация) КАК ВложенныйЗапрос
	|	ГДЕ
	|		ВложенныйЗапрос.ЗаказаноБезРезерва > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.Характеристика,
	|		ВложенныйЗапрос.Организация) КАК ЗаказаноНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВложенныйЗапрос.ЗаказПоставщикуДатаПоступления) КАК ЗаказПоставщикуДатаПоступления,
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|			ВложенныйЗапрос.Характеристика КАК Характеристика
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГрафикДвиженияЗапасов.Период КАК ЗаказПоставщикуДатаПоступления,
	|				ЗаказыПоставщикамОстатки.Организация КАК Организация,
	|				ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|				ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика
	|			ИЗ
	|				РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикДвиженияЗапасов КАК ГрафикДвиженияЗапасов
	|					ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ГрафикДвиженияЗапасов.Заказ
	|						И ЗаказыПоставщикамОстатки.Номенклатура = ГрафикДвиженияЗапасов.Номенклатура
	|						И ЗаказыПоставщикамОстатки.Характеристика = ГрафикДвиженияЗапасов.Характеристика
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|							,
	|							Организация = &Организация
	|								И Номенклатура В (&Номенклатура)
	|								И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|					ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|						И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|						И ЗаказыПоставщикамОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|			ГДЕ
	|				ГрафикДвиженияЗапасов.Организация = &Организация
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикДвиженияЗапасов.Период,
	|				ЗаказыПоставщикамОстатки.Организация,
	|				ЗаказыПоставщикамОстатки.Номенклатура,
	|				ЗаказыПоставщикамОстатки.Характеристика
	|			
	|			ИМЕЮЩИЕ
	|				СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)) > 0
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш,
	|				ЗаказыНаПроизводствоОстатки.Организация,
	|				ЗаказыНаПроизводствоОстатки.Номенклатура,
	|				ЗаказыНаПроизводствоОстатки.Характеристика
	|			ИЗ
	|				РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|							,
	|							Организация = &Организация
	|								И Номенклатура В (&Номенклатура)
	|								И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|					ПО ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|						И ЗаказыНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|						И ЗаказыНаПроизводствоОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш,
	|				ЗаказыНаПроизводствоОстатки.Организация,
	|				ЗаказыНаПроизводствоОстатки.Номенклатура,
	|				ЗаказыНаПроизводствоОстатки.Характеристика
	|			
	|			ИМЕЮЩИЕ
	|				СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток - РазмещениеЗаказовОстатки.КоличествоОстаток) > 0) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.Характеристика,
	|			ВложенныйЗапрос.Номенклатура) КАК ЗаказыПоставщикамОстаткиДокументы
	|		ПО ЗаказаноНоменклатуры.Номенклатура = ЗаказыПоставщикамОстаткиДокументы.Номенклатура
	|			И ЗаказаноНоменклатуры.Характеристика = ЗаказыПоставщикамОстаткиДокументы.Характеристика
	|			И ЗаказаноНоменклатуры.Организация = ЗаказыПоставщикамОстаткиДокументы.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстаткиДокументы.ЗаказПоставщикуДатаПоступления,
	|	ЗаказаноНоменклатуры.ЗаказаноБезРезерва,
	|	ЗаказаноНоменклатуры.Номенклатура,
	|	ЗаказаноНоменклатуры.Характеристика,
	|	ЗаказаноНоменклатуры.Организация,
	|	ЗаказаноНоменклатуры.КоличествоДокументовЗаказано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(РазмещениеЗаказовОстатки.КоличествоОстаток) КАК РезервЗаказано,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(РазмещениеЗаказовОстатки.КоличествоОстаток) КАК РезервЗаказаноИтог,
	|	РазмещениеЗаказовОстатки.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ Размещено
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ВЫБОР
	|					КОГДА &ЕстьЗаказы
	|						ТОГДА ЗаказПокупателя В (&ЗаказПокупателя)
	|				КОНЕЦ) КАК РазмещениеЗаказовОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = РазмещениеЗаказовОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	РазмещениеЗаказовОстатки.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(Запасы.Количество) КАК ОтгрузкаРезерва,
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ОтгрузкаПоРезервам
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.ЗаказПокупателя = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&ЗаказПокупателя)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.ЗаказПокупателя,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(Заказано.ДатаПоступления, 0) КАК ДатаПоступления,
	|	ЕСТЬNULL(Заказано.КоличествоДокументовЗаказано, 0) КАК КоличествоДокументовЗаказано,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.НоменклатураЗапасов КАК Номенклатура,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(Размещено.РезервЗаказано, 0) КАК РезервЗаказано,
	|	ЕСТЬNULL(Заказано.ЗаказаноБезРезерва, 0) КАК ЗаказаноБезРезерва,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ОстатокТекСклад,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщий,
	|	ЕСТЬNULL(ОстаткиРезервыОбщие.РезервНаСкладахИтог, 0) КАК РезервНаСкладахИтог,
	|	ЕСТЬNULL(Размещено.РезервЗаказаноИтог, 0) КАК РезервЗаказаноИтог,
	|	ЛОЖЬ КАК СтрокаОбработана,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ОстатокТекСкладПослеРаспределения,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) + ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК МожноОтгрузитьПроведенныйДокумент,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщийПослеРаспределения,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСклад,
	|	ЕСТЬNULL(ОстаткиРезервыОбщие.РезервНаСкладах, 0) - ЕСТЬNULL(РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам.ЗарезервированоЗаказом, 0) КАК РезервНаСкладах,
	|	ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказом,
	|	ОстаткиВРазрезеСкладов.РезервТекСклад КАК РезервТекСкладОбщий,
	|	ЕСТЬNULL(ОтгрузкаПоРезервам.ОтгрузкаРезерва, 0) КАК ОтгрузкаРезерва,
	|	ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказомВсеСклады,
	|	ВтНоменклатура.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Заказано КАК Заказано
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Заказано.Номенклатура
	|			И ВтНоменклатура.Характеристика = Заказано.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВРазрезеСкладов КАК ОстаткиВРазрезеСкладов
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиВРазрезеСкладов.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОстаткиВРазрезеСкладов.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиВРазрезеСкладов.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОстаткиВРазрезеСкладов.СтруктурнаяЕдиница
	|			И ВтНоменклатура.ЗаказПокупателя = ОстаткиВРазрезеСкладов.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Размещено КАК Размещено
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Размещено.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Размещено.Характеристика
	|			И ВтНоменклатура.ЗаказПокупателя = Размещено.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказом.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказом.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказом.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
	|			И ВтНоменклатура.ЗаказПокупателя = РезервСделанныйЗаказом.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтгрузкаПоРезервам КАК ОтгрузкаПоРезервам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОтгрузкаПоРезервам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОтгрузкаПоРезервам.Характеристика
	|			И ВтНоменклатура.Партия = ОтгрузкаПоРезервам.Партия
	|			И ВтНоменклатура.ЗаказПокупателя = ОтгрузкаПоРезервам.ЗаказПокупателя
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОтгрузкаПоРезервам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказомПоВсемСкладам КАК РезервСделанныйЗаказомПоВсемСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказомПоВсемСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказомПоВсемСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказомПоВсемСкладам.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиРезервыОбщие КАК ОстаткиРезервыОбщие
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиРезервыОбщие.Номенклатура
	|			И ВтНоменклатура.Характеристика = ОстаткиРезервыОбщие.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиРезервыОбщие.Партия
	|			И ВтНоменклатура.ЗаказПокупателя = ОстаткиРезервыОбщие.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам КАК РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.ЗаказПокупателя = РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам.ЗаказПокупателя
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказомВРазрезеЗаказовПоСкладам.Партия";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиИРезервыРасходнаяНакладная()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатура.Номенклатура КАК НоменклатураЗапасов,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Партия КАК Партия,
	|	ТаблицаНоменклатура.Заказ КАК Заказ,
	|	ТаблицаНоменклатура.ЯчейкаДоступна КАК ЯчейкаДоступна,
	|	ТаблицаНоменклатура.Ячейка КАК Ячейка,
	|	ТаблицаНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ ВтНоменклатураБезСклада
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладах,
	|	СУММА(ЗапасыОстаткиОбщие.КоличествоОстаток) КАК ОстатокОбщий,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладахИтог,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокОбщийЯчеистоеХранение
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиРезервы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиРезервы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиРезервы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = ЗапасыОстаткиРезервы.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)
	|					И ВЫБОР
	|						КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
	|								И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
	|							ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ЗапасыОстаткиОбщие
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиОбщие.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиОбщие.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиОбщие.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)
	|					И СтруктурнаяЕдиница.ОрдерныйСклад = ЛОЖЬ
	|					И ВЫБОР
	|						КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
	|								И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
	|							ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыНаСкладахОстатки.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОстатокТекСклад,
	|	СУММА(ЗапасыОстаткиРезервТекСклад.КоличествоОстаток) КАК РезервТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокТекЯчейка
	|ПОМЕСТИТЬ ОстаткиВРазрезеСкладов
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервТекСклад
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстаткиРезервТекСклад.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстаткиРезервТекСклад.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстаткиРезервТекСклад.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстаткиРезервТекСклад.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ЗапасыОстаткиРезервТекСклад.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыНаСкладахОстатки.Партия
	|			И ВтНоменклатура.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказом
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.СтруктурнаяЕдиница,
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказомПоВсемСкладам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество
	|			ИНАЧЕ Запасы.Количество * -1
	|		КОНЕЦ) КАК СписаноРезерваНакладной,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РасходРезерваПоНакладной
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество
	|			ИНАЧЕ Запасы.Количество * -1
	|		КОНЕЦ) КАК СписаноРезерваНакладной,
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ВтНоменклатура.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ РасходРезерваПоНакладнойПоСкладам
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|			И ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Заказ,
	|	ВтНоменклатура.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойПоСкладам
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойВсего
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыНаСкладах.Количество) КАК СписаноНакладной,
	|	ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыНаСкладах.Ячейка КАК Ячейка,
	|	ЗапасыНаСкладах.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоЯчейкам
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	ЗапасыНаСкладах.Регистратор = &Ссылка
	|	И ЗапасыНаСкладах.Номенклатура В(&Номенклатура)
	|	И ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладах.Номенклатура,
	|	ЗапасыНаСкладах.Характеристика,
	|	ЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ЗапасыНаСкладах.Ячейка,
	|	ЗапасыНаСкладах.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыНаСкладах.Количество) КАК СписаноНакладной,
	|	ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладах.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоЯчейкамВсего
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	ЗапасыНаСкладах.Регистратор = &Ссылка
	|	И ЗапасыНаСкладах.Номенклатура В(&Номенклатура)
	|	И ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладах.Номенклатура,
	|	ЗапасыНаСкладах.Характеристика,
	|	ЗапасыНаСкладах.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОбщийРезерв
	|ПОМЕСТИТЬ ОбщийРезервПоНоменклатуре
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Организация В (&ОрганизацииПередачи)
	|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|				И Номенклатура В (&Номенклатура)
	|				И ВЫБОР
	|					КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
	|							И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
	|						ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.НоменклатураЗапасов КАК Номенклатура,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойВсего.СписаноНакладной, 0) КАК ОстатокОбщий,
	|	ЕСТЬNULL(Остатки.РезервНаСкладахИтог, 0) КАК РезервНаСкладахИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) - ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК РезервТекСклад,
	|	ЕСТЬNULL(Остатки.РезервНаСкладах, 0) - ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК РезервНаСкладах,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладОбщий,
	|	ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказомВсеСклады,
	|	ЕСТЬNULL(РасходРезерваПоНакладной.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладной,
	|	ЕСТЬNULL(РасходРезерваПоНакладнойПоСкладам.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладнойТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной, 0) КАК ОстатокТекСклад,
	|	ВтНоменклатура.Ячейка КАК Ячейка,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщийОрдерныеСклады,
	|	ЕСТЬNULL(Остатки.ОстатокОбщийЯчеистоеХранение, 0) КАК ОстатокОбщийЯчеистыеСклады,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ТекущийОстатокПоСкладу,
	|	0 КАК КоличествоСтрок,
	|	0 КАК КоличествоПроходов,
	|	РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной КАК РасходОрдерныеСклады,
	|	РасходБезРезерваПоЯчейкам.СписаноНакладной КАК РасходЯчеистыеСклады,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекЯчейка, 0) + ЕСТЬNULL(РасходБезРезерваПоЯчейкам.СписаноНакладной, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокВЯчейке
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВРазрезеСкладов КАК ОстаткиВРазрезеСкладов
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиВРазрезеСкладов.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОстаткиВРазрезеСкладов.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиВРазрезеСкладов.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОстаткиВРазрезеСкладов.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ОстаткиВРазрезеСкладов.Заказ
	|			И ВтНоменклатура.Ячейка = ОстаткиВРазрезеСкладов.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|			И ВтНоменклатура.Заказ = Остатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказом.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказом.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказом.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказом.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказомПоВсемСкладам КАК РезервСделанныйЗаказомПоВсемСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказомПоВсемСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказомПоВсемСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказомПоВсемСкладам.Партия
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказомПоВсемСкладам.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладной КАК РасходРезерваПоНакладной
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладной.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладной.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладной.Партия
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладной.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладнойПоСкладам КАК РасходРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладнойПоСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладнойПоСкладам.Заказ
	|			И ВтНоменклатура.Ячейка = РасходРезерваПоНакладнойПоСкладам.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойПоСкладам КАК РасходБезРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойПоСкладам.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходБезРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщийРезервПоНоменклатуре КАК ОбщийРезервПоНоменклатуре
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОбщийРезервПоНоменклатуре.Номенклатура
	|			И ВтНоменклатура.Характеристика = ОбщийРезервПоНоменклатуре.Характеристика
	|			И ВтНоменклатура.Партия = ОбщийРезервПоНоменклатуре.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоЯчейкам КАК РасходБезРезерваПоЯчейкам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоЯчейкам.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоЯчейкам.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоЯчейкам.Партия
	|			И ВтНоменклатура.Ячейка = РасходБезРезерваПоЯчейкам.Ячейка
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходБезРезерваПоЯчейкам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоЯчейкамВсего КАК РасходБезРезерваПоЯчейкамВсего
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоЯчейкамВсего.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоЯчейкамВсего.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоЯчейкамВсего.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойВсего КАК РасходБезРезерваПоНакладнойВсего
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойВсего.Номенклатура
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойВсего.Партия
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойВсего.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиИРезервыЗаказНаряд()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатура.Номенклатура КАК НоменклатураЗапасов,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Партия КАК Партия,
	|	ТаблицаНоменклатура.Заказ КАК Заказ,
	|	ТаблицаНоменклатура.ЯчейкаДоступна КАК ЯчейкаДоступна,
	|	ТаблицаНоменклатура.Ячейка КАК Ячейка,
	|	ТаблицаНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ ВтНоменклатураБезСклада
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладах,
	|	СУММА(ЗапасыОстаткиОбщие.КоличествоОстаток) КАК ОстатокОбщий,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладахИтог,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокОбщийЯчеистоеХранение
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиРезервы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиРезервы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиРезервы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = ЗапасыОстаткиРезервы.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиОбщие
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиОбщие.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиОбщие.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиОбщие.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)
	|					И СтруктурнаяЕдиница.ОрдерныйСклад = ЛОЖЬ) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыНаСкладахОстатки.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОстатокТекСклад,
	|	СУММА(ЗапасыОстаткиРезервТекСклад.КоличествоОстаток) КАК РезервТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокТекЯчейка
	|ПОМЕСТИТЬ ОстаткиВРазрезеСкладов
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервТекСклад
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстаткиРезервТекСклад.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстаткиРезервТекСклад.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстаткиРезервТекСклад.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстаткиРезервТекСклад.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ЗапасыОстаткиРезервТекСклад.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыНаСкладахОстатки.Партия
	|			И ВтНоменклатура.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказом
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.СтруктурнаяЕдиница,
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказомПоВсемСкладам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество
	|			ИНАЧЕ Запасы.Количество * -1
	|		КОНЕЦ) КАК СписаноРезерваНакладной,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РасходРезерваПоНакладной
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноРезерваНакладной,
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ВтНоменклатура.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ РасходРезерваПоНакладнойПоСкладам
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|			И ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Заказ,
	|	ВтНоменклатура.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойПоСкладам
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойВсего
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыНаСкладах.Количество) КАК СписаноНакладной,
	|	ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыНаСкладах.Ячейка КАК Ячейка,
	|	ЗапасыНаСкладах.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоЯчейкам
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	ЗапасыНаСкладах.Регистратор = &Ссылка
	|	И ЗапасыНаСкладах.Номенклатура В(&Номенклатура)
	|	И ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладах.Номенклатура,
	|	ЗапасыНаСкладах.Характеристика,
	|	ЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ЗапасыНаСкладах.Ячейка,
	|	ЗапасыНаСкладах.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыНаСкладах.Количество) КАК СписаноНакладной,
	|	ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладах.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоЯчейкамВсего
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	ЗапасыНаСкладах.Регистратор = &Ссылка
	|	И ЗапасыНаСкладах.Номенклатура В(&Номенклатура)
	|	И ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладах.Номенклатура,
	|	ЗапасыНаСкладах.Характеристика,
	|	ЗапасыНаСкладах.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОбщийРезерв
	|ПОМЕСТИТЬ ОбщийРезервПоНоменклатуре
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Организация В (&ОрганизацииПередачи)
	|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|				И Номенклатура В (&Номенклатура)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.НоменклатураЗапасов КАК Номенклатура,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойВсего.СписаноНакладной, 0) КАК ОстатокОбщий,
	|	ЕСТЬNULL(Остатки.РезервНаСкладахИтог, 0) КАК РезервНаСкладахИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) - ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК РезервТекСклад,
	|	ЕСТЬNULL(Остатки.РезервНаСкладах, 0) - ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК РезервНаСкладах,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладОбщий,
	|	ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказомВсеСклады,
	|	ЕСТЬNULL(РасходРезерваПоНакладной.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладной,
	|	ЕСТЬNULL(РасходРезерваПоНакладнойПоСкладам.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладнойТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной, 0) КАК ОстатокТекСклад,
	|	ВтНоменклатура.Ячейка КАК Ячейка,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщийОрдерныеСклады,
	|	ЕСТЬNULL(Остатки.ОстатокОбщийЯчеистоеХранение, 0) КАК ОстатокОбщийЯчеистыеСклады,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ТекущийОстатокПоСкладу,
	|	0 КАК КоличествоСтрок,
	|	0 КАК КоличествоПроходов,
	|	РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной КАК РасходОрдерныеСклады,
	|	РасходБезРезерваПоЯчейкам.СписаноНакладной КАК РасходЯчеистыеСклады,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекЯчейка, 0) + ЕСТЬNULL(РасходБезРезерваПоЯчейкам.СписаноНакладной, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокВЯчейке
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВРазрезеСкладов КАК ОстаткиВРазрезеСкладов
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиВРазрезеСкладов.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОстаткиВРазрезеСкладов.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиВРазрезеСкладов.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОстаткиВРазрезеСкладов.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ОстаткиВРазрезеСкладов.Заказ
	|			И ВтНоменклатура.Ячейка = ОстаткиВРазрезеСкладов.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|			И ВтНоменклатура.Заказ = Остатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказом.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказом.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказом.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказом.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказомПоВсемСкладам КАК РезервСделанныйЗаказомПоВсемСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказомПоВсемСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказомПоВсемСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказомПоВсемСкладам.Партия
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказомПоВсемСкладам.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладной КАК РасходРезерваПоНакладной
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладной.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладной.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладной.Партия
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладной.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладнойПоСкладам КАК РасходРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладнойПоСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладнойПоСкладам.Заказ
	|			И ВтНоменклатура.Ячейка = РасходРезерваПоНакладнойПоСкладам.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойПоСкладам КАК РасходБезРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойПоСкладам.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходБезРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщийРезервПоНоменклатуре КАК ОбщийРезервПоНоменклатуре
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОбщийРезервПоНоменклатуре.Номенклатура
	|			И ВтНоменклатура.Характеристика = ОбщийРезервПоНоменклатуре.Характеристика
	|			И ВтНоменклатура.Партия = ОбщийРезервПоНоменклатуре.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоЯчейкам КАК РасходБезРезерваПоЯчейкам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоЯчейкам.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоЯчейкам.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоЯчейкам.Партия
	|			И ВтНоменклатура.Ячейка = РасходБезРезерваПоЯчейкам.Ячейка
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходБезРезерваПоЯчейкам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоЯчейкамВсего КАК РасходБезРезерваПоЯчейкамВсего
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоЯчейкамВсего.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоЯчейкамВсего.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоЯчейкамВсего.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойВсего КАК РасходБезРезерваПоНакладнойВсего
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойВсего.Номенклатура
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойВсего.Партия
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойВсего.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиИРезервыЧекККМ()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатура.Номенклатура КАК НоменклатураЗапасов,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Партия КАК Партия,
	|	ТаблицаНоменклатура.Заказ КАК Заказ,
	|	ТаблицаНоменклатура.ЯчейкаДоступна КАК ЯчейкаДоступна,
	|	ТаблицаНоменклатура.Ячейка КАК Ячейка,
	|	ТаблицаНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ ВтНоменклатураБезСклада
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладах,
	|	СУММА(ЗапасыОстаткиОбщие.КоличествоОстаток) КАК ОстатокОбщий,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладахИтог,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокОбщийЯчеистоеХранение
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиРезервы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиРезервы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиРезервы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = ЗапасыОстаткиРезервы.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиОбщие
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиОбщие.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиОбщие.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиОбщие.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)
	|					И СтруктурнаяЕдиница.ОрдерныйСклад = ЛОЖЬ) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыНаСкладахОстатки.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОстатокТекСклад,
	|	СУММА(ЗапасыОстаткиРезервТекСклад.КоличествоОстаток) КАК РезервТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокТекЯчейка
	|ПОМЕСТИТЬ ОстаткиВРазрезеСкладов
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервТекСклад
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстаткиРезервТекСклад.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстаткиРезервТекСклад.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстаткиРезервТекСклад.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстаткиРезервТекСклад.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ЗапасыОстаткиРезервТекСклад.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыНаСкладахОстатки.Партия
	|			И ВтНоменклатура.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказом
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Регистратор В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.СтруктурнаяЕдиница,
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказомПоВсемСкладам
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.Регистратор В(&МассивЗаказов)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(Запасы.Количество) КАК СписаноРезерваНакладной,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РасходРезерваПоНакладной
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноРезерваНакладной,
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Заказ КАК Заказ
	|ПОМЕСТИТЬ РасходРезерваПоНакладнойПоСкладам
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|			И ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя В(&МассивЗаказов)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойПоСкладам
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойВсего
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОбщийРезерв
	|ПОМЕСТИТЬ ОбщийРезервПоНоменклатуре
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Организация В (&ОрганизацииПередачи)
	|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|				И Номенклатура В (&Номенклатура)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.НоменклатураЗапасов КАК Номенклатура,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойВсего.СписаноНакладной, 0) КАК ОстатокОбщий,
	|	ЕСТЬNULL(Остатки.РезервНаСкладахИтог, 0) КАК РезервНаСкладахИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) - ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК РезервТекСклад,
	|	ЕСТЬNULL(Остатки.РезервНаСкладах, 0) - ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК РезервНаСкладах,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладОбщий,
	|	ЕСТЬNULL(РезервСделанныйЗаказомПоВсемСкладам.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказомВсеСклады,
	|	ЕСТЬNULL(РасходРезерваПоНакладной.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладной,
	|	ЕСТЬNULL(РасходРезерваПоНакладнойПоСкладам.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладнойТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной, 0) КАК ОстатокТекСклад,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщийОрдерныеСклады,
	|	ЕСТЬNULL(Остатки.ОстатокОбщийЯчеистоеХранение, 0) КАК ОстатокОбщийЯчеистыеСклады,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ТекущийОстатокПоСкладу,
	|	0 КАК КоличествоСтрок,
	|	0 КАК КоличествоПроходов,
	|	РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной КАК РасходОрдерныеСклады,
	|	ВтНоменклатура.Ячейка КАК Ячейка
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВРазрезеСкладов КАК ОстаткиВРазрезеСкладов
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиВРазрезеСкладов.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОстаткиВРазрезеСкладов.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиВРазрезеСкладов.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОстаткиВРазрезеСкладов.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ОстаткиВРазрезеСкладов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|			И ВтНоменклатура.Заказ = Остатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказом.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказом.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказом.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказом.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказомПоВсемСкладам КАК РезервСделанныйЗаказомПоВсемСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказомПоВсемСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказомПоВсемСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказомПоВсемСкладам.Партия
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказомПоВсемСкладам.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладной КАК РасходРезерваПоНакладной
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладной.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладной.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладной.Партия
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладной.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладнойПоСкладам КАК РасходРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладнойПоСкладам.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладнойПоСкладам.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойПоСкладам КАК РасходБезРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойПоСкладам.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходБезРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщийРезервПоНоменклатуре КАК ОбщийРезервПоНоменклатуре
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОбщийРезервПоНоменклатуре.Номенклатура
	|			И ВтНоменклатура.Характеристика = ОбщийРезервПоНоменклатуре.Характеристика
	|			И ВтНоменклатура.Партия = ОбщийРезервПоНоменклатуре.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойВсего КАК РасходБезРезерваПоНакладнойВсего
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойВсего.Номенклатура
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойВсего.Партия
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойВсего.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиИРезервыЧекККМ_РМК()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатура.Номенклатура КАК НоменклатураЗапасов,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Партия КАК Партия,
	|	ТаблицаНоменклатура.Заказ КАК Заказ,
	|	ТаблицаНоменклатура.ЯчейкаДоступна КАК ЯчейкаДоступна,
	|	ТаблицаНоменклатура.Ячейка КАК Ячейка,
	|	ТаблицаНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ВтНоменклатура.Партия КАК Партия
	|ПОМЕСТИТЬ ВтНоменклатураБезСклада
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладах,
	|	СУММА(ЗапасыОстаткиОбщие.КоличествоОстаток) КАК ОстатокОбщий,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(ЗапасыОстаткиРезервы.КоличествоОстаток) КАК РезервНаСкладахИтог,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокОбщийЯчеистоеХранение
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ЗаказПокупателя
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиРезервы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиРезервы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиРезервы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = ЗапасыОстаткиРезервы.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиОбщие
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыОстаткиОбщие.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыОстаткиОбщие.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыОстаткиОбщие.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					И Номенклатура В (&Номенклатура)
	|					И СтруктурнаяЕдиница.ОрдерныйСклад = ЛОЖЬ) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = ЗапасыНаСкладахОстатки.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК ОстатокТекСклад,
	|	СУММА(ЗапасыОстаткиРезервТекСклад.КоличествоОстаток) КАК РезервТекСклад,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокТекЯчейка
	|ПОМЕСТИТЬ ОстаткиВРазрезеСкладов
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстатки.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ЗаказПокупателя
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыОстаткиРезервТекСклад
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыОстаткиРезервТекСклад.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыОстаткиРезервТекСклад.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыОстаткиРезервТекСклад.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыОстаткиРезервТекСклад.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ЗапасыОстаткиРезервТекСклад.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ЗапасыНаСкладахОстатки.Номенклатура
	|			И ВтНоменклатура.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
	|			И ВтНоменклатура.Партия = ЗапасыНаСкладахОстатки.Партия
	|			И ВтНоменклатура.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ,
	|	ЗапасыНаСкладахОстатки.Ячейка,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.ЯчейкаДоступна
	|			ТОГДА ЗапасыНаСкладахОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК ЗарезервированоЗаказом,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.Заказ КАК Заказ
	|ПОМЕСТИТЬ РезервСделанныйЗаказом
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатура.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатура.Партия = Запасы.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = Запасы.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|	И Запасы.Регистратор = &ЗаказПокупателя
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.СтруктурнаяЕдиница,
	|	ВтНоменклатура.НоменклатураЗапасов,
	|	ВтНоменклатура.СтруктурнаяЕдиница,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов КАК НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика КАК Характеристика,
	|	ВтНоменклатураБезСклада.Партия КАК Партия,
	|	СУММА(Запасы.Количество) КАК СписаноРезерваНакладной,
	|	ВтНоменклатураБезСклада.Заказ КАК Заказ
	|ПОМЕСТИТЬ РасходРезерваПоНакладной
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = Запасы.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = Запасы.Характеристика
	|			И ВтНоменклатураБезСклада.Партия = Запасы.Партия
	|			И ВтНоменклатураБезСклада.Заказ = Запасы.ЗаказПокупателя
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|	И НЕ Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтНоменклатураБезСклада.НоменклатураЗапасов,
	|	ВтНоменклатураБезСклада.Характеристика,
	|	ВтНоменклатураБезСклада.Партия,
	|	ВтНоменклатураБезСклада.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойПоСкладам
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Запасы.Количество) КАК СписаноНакладной,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия
	|ПОМЕСТИТЬ РасходБезРезерваПоНакладнойВсего
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Ссылка
	|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(РазмещениеЗаказовОстатки.КоличествоОстаток) КАК РазмещеноРезерва,
	|	РазмещениеЗаказовОстатки.Номенклатура КАК Номенклатура,
	|	РазмещениеЗаказовОстатки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ Размещено
	|ИЗ
	|	ВтНоменклатураБезСклада КАК ВтНоменклатураБезСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ВЫБОР
	|					КОГДА НЕ &ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						ТОГДА Организация В (&ОрганизацииПередачи)
	|								И ЗаказПокупателя = &ЗаказПокупателя
	|				КОНЕЦ) КАК РазмещениеЗаказовОстатки
	|		ПО ВтНоменклатураБезСклада.НоменклатураЗапасов = РазмещениеЗаказовОстатки.Номенклатура
	|			И ВтНоменклатураБезСклада.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаказовОстатки.Характеристика,
	|	РазмещениеЗаказовОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ Заказано
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыПоставщикамОстатки.Организация КАК Организация,
	|		ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|		ЗаказыПоставщикамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И Номенклатура В (&Номенклатура)
	|					И Характеристика В (&Характеристика)
	|					И НЕ ЗаказПоставщику В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								РазмещениеЗаказовОстатки.ИсточникОбеспечения КАК ИсточникОбеспечения
	|							ИЗ
	|								РегистрНакопления.РазмещениеЗаказов.Остатки(, Номенклатура В (&Номенклатура)
	|									И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки)) КАК ЗаказыПоставщикамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыНаПроизводствоОстатки.Организация,
	|		ЗаказыНаПроизводствоОстатки.Номенклатура,
	|		ЗаказыНаПроизводствоОстатки.Характеристика,
	|		СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток)
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|				,
	|				Организация В (&ОрганизацииПередачи)
	|					И Номенклатура В (&Номенклатура)
	|					И Характеристика В (&Характеристика)
	|					И НЕ ЗаказНаПроизводство В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								РазмещениеЗаказовОстатки.ИсточникОбеспечения КАК ИсточникОбеспечения
	|							ИЗ
	|								РегистрНакопления.РазмещениеЗаказов.Остатки(, Номенклатура В (&Номенклатура)
	|									И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки)) КАК ЗаказыНаПроизводствоОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказыНаПроизводствоОстатки.Номенклатура,
	|		ЗаказыНаПроизводствоОстатки.Организация,
	|		ЗаказыНаПроизводствоОстатки.Характеристика) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтНоменклатура.Характеристика КАК Характеристика,
	|	ВтНоменклатура.НоменклатураЗапасов КАК Номенклатура,
	|	ВтНоменклатура.Партия КАК Партия,
	|	ВтНоменклатура.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойВсего.СписаноНакладной, 0) КАК ОстатокОбщий,
	|	ЕСТЬNULL(Остатки.РезервНаСкладахИтог, 0) КАК РезервНаСкладахИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладИтог,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) - ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК РезервТекСклад,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.РезервТекСклад, 0) КАК РезервТекСкладОбщий,
	|	ЕСТЬNULL(РасходРезерваПоНакладной.СписаноРезерваНакладной, 0) КАК СписаноРезерваНакладной,
	|	ВтНоменклатура.Заказ КАК Заказ,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) + ЕСТЬNULL(РасходБезРезерваПоНакладнойПоСкладам.СписаноНакладной, 0) КАК ОстатокТекСклад,
	|	ЕСТЬNULL(Остатки.ОстатокОбщий, 0) КАК ОстатокОбщийОрдерныеСклады,
	|	ЕСТЬNULL(Остатки.ОстатокОбщийЯчеистоеХранение, 0) КАК ОстатокОбщийЯчеистыеСклады,
	|	ЕСТЬNULL(ОстаткиВРазрезеСкладов.ОстатокТекСклад, 0) КАК ТекущийОстатокПоСкладу,
	|	0 КАК КоличествоСтрок,
	|	0 КАК КоличествоПроходов,
	|	ЕСТЬNULL(Заказано.КоличествоОстаток, 0) + ЕСТЬNULL(Размещено.РазмещеноРезерва, 0) КАК КПоступлению,
	|	ВтНоменклатура.Ячейка КАК Ячейка
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВРазрезеСкладов КАК ОстаткиВРазрезеСкладов
	|		ПО ВтНоменклатура.НоменклатураЗапасов = ОстаткиВРазрезеСкладов.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = ОстаткиВРазрезеСкладов.Характеристика
	|			И ВтНоменклатура.Партия = ОстаткиВРазрезеСкладов.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = ОстаткиВРазрезеСкладов.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = ОстаткиВРазрезеСкладов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|			И ВтНоменклатура.Заказ = Остатки.Заказ
	|			И ВтНоменклатура.НоменклатураЗапасов = Остатки.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = Остатки.Характеристика
	|			И ВтНоменклатура.Партия = Остатки.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РезервСделанныйЗаказом.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РезервСделанныйЗаказом.Характеристика
	|			И ВтНоменклатура.Партия = РезервСделанныйЗаказом.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
	|			И ВтНоменклатура.Заказ = РезервСделанныйЗаказом.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходРезерваПоНакладной КАК РасходРезерваПоНакладной
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходРезерваПоНакладной.НоменклатураЗапасов
	|			И ВтНоменклатура.Характеристика = РасходРезерваПоНакладной.Характеристика
	|			И ВтНоменклатура.Партия = РасходРезерваПоНакладной.Партия
	|			И ВтНоменклатура.Заказ = РасходРезерваПоНакладной.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойПоСкладам КАК РасходБезРезерваПоНакладнойПоСкладам
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойПоСкладам.Номенклатура
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойПоСкладам.Характеристика
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойПоСкладам.Партия
	|			И ВтНоменклатура.СтруктурнаяЕдиница = РасходБезРезерваПоНакладнойПоСкладам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходБезРезерваПоНакладнойВсего КАК РасходБезРезерваПоНакладнойВсего
	|		ПО ВтНоменклатура.НоменклатураЗапасов = РасходБезРезерваПоНакладнойВсего.Номенклатура
	|			И ВтНоменклатура.Партия = РасходБезРезерваПоНакладнойВсего.Партия
	|			И ВтНоменклатура.Характеристика = РасходБезРезерваПоНакладнойВсего.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Размещено КАК Размещено
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Размещено.Номенклатура
	|			И ВтНоменклатура.Характеристика = Размещено.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Заказано КАК Заказано
	|		ПО ВтНоменклатура.НоменклатураЗапасов = Заказано.Номенклатура
	|			И ВтНоменклатура.Характеристика = Заказано.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаказано()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеЗаказовОстатки.ИсточникОбеспечения КАК Ссылка,
	|	СУММА(РазмещениеЗаказовОстатки.КоличествоОстаток) КАК Количество,
	|	ТИПЗНАЧЕНИЯ(РазмещениеЗаказовОстатки.ИсточникОбеспечения) КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РазмещениеЗаказовОстатки.ИсточникОбеспечения) = ТИП(Документ.ЗаказНаПроизводство)
	|			ТОГДА РазмещениеЗаказовОстатки.ИсточникОбеспечения.Финиш
	|		ИНАЧЕ РазмещениеЗаказовОстатки.ИсточникОбеспечения.ДатаПоступления
	|	КОНЕЦ КАК ДатаПоступления
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказов.Остатки(
	|			,
	|			ЗаказПокупателя = &ЗаказПокупателя
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК РазмещениеЗаказовОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаказовОстатки.ИсточникОбеспечения,
	|	ТИПЗНАЧЕНИЯ(РазмещениеЗаказовОстатки.ИсточникОбеспечения),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РазмещениеЗаказовОстатки.ИсточникОбеспечения) = ТИП(Документ.ЗаказНаПроизводство)
	|			ТОГДА РазмещениеЗаказовОстатки.ИсточникОбеспечения.Финиш
	|		ИНАЧЕ РазмещениеЗаказовОстатки.ИсточникОбеспечения.ДатаПоступления
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ,
	|	ТипДокумента,
	|	Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаказаноЗаказНаПеремещение()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТИПЗНАЧЕНИЯ(ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение) КАК ТипДокумента,
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.ДатаПеремещения КАК ДатаПоступления,
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение КАК Ссылка,
	|	ЗаказыНаПеремещениеОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|			,
	|			Организация = &Организация
	|				И Склад = &Получатель
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)
	|				И НЕ ЗаказНаПеремещение = &ЗаказНаПеремещение) КАК ЗаказыНаПеремещениеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение,
	|	ТИПЗНАЧЕНИЯ(ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение),
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.ДатаПеремещения,
	|	ЗаказыНаПеремещениеОстатки.КоличествоОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДокумента";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗапасыПоступленияСвободные()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоПериодов > 1
	|			ТОГДА ВложенныйЗапрос.КоличествоПериодов
	|		ИНАЧЕ ВложенныйЗапрос.ДатаПоступления
	|	КОНЕЦ КАК ДатаПоступления,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос1.ДатаПоступления) КАК КоличествоПериодов,
	|		ВложенныйЗапрос1.Количество КАК Количество,
	|		ВложенныйЗапрос1.Ссылка КАК Ссылка,
	|		МИНИМУМ(ВложенныйЗапрос1.ДатаПоступления) КАК ДатаПоступления
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГрафикДвиженияЗапасов.Период КАК ДатаПоступления,
	|			ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) КАК Количество,
	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Ссылка
	|		ИЗ
	|			РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)) КАК ЗаказыПоставщикамОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикДвиженияЗапасов КАК ГрафикДвиженияЗапасов
	|				ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ГрафикДвиженияЗапасов.Заказ
	|					И ЗаказыПоставщикамОстатки.Номенклатура = ГрафикДвиженияЗапасов.Номенклатура
	|					И ЗаказыПоставщикамОстатки.Характеристика = ГрафикДвиженияЗапасов.Характеристика
	|					И ЗаказыПоставщикамОстатки.Организация = ГрафикДвиженияЗапасов.Организация
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыПоставщикамОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|					И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыПоставщикамОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|		ГДЕ
	|			ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш,
	|			СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)),
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство
	|		ИЗ
	|			РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)) КАК ЗаказыНаПроизводствоОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыНаПроизводствоОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|					И ЗаказыНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыНаПроизводствоОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|		ГДЕ
	|			ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство,
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш) КАК ВложенныйЗапрос1
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос1.Количество,
	|		ВложенныйЗапрос1.Ссылка) КАК ВложенныйЗапрос";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗапасыПоступленияСвободныеПоПеремещению()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоПериодов > 1
	|			ТОГДА ВложенныйЗапрос.КоличествоПериодов
	|		ИНАЧЕ ВложенныйЗапрос.ДатаПоступления
	|	КОНЕЦ КАК ДатаПоступления,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос1.ДатаПоступления) КАК КоличествоПериодов,
	|		ВложенныйЗапрос1.Количество КАК Количество,
	|		ВложенныйЗапрос1.Ссылка КАК Ссылка,
	|		МИНИМУМ(ВложенныйЗапрос1.ДатаПоступления) КАК ДатаПоступления
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГрафикДвиженияЗапасов.Период КАК ДатаПоступления,
	|			ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) КАК Количество,
	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Ссылка
	|		ИЗ
	|			РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)
	|						И Склад = &Отправитель) КАК ЗаказыПоставщикамОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикДвиженияЗапасов КАК ГрафикДвиженияЗапасов
	|				ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ГрафикДвиженияЗапасов.Заказ
	|					И ЗаказыПоставщикамОстатки.Номенклатура = ГрафикДвиженияЗапасов.Номенклатура
	|					И ЗаказыПоставщикамОстатки.Характеристика = ГрафикДвиженияЗапасов.Характеристика
	|					И ЗаказыПоставщикамОстатки.Организация = ГрафикДвиженияЗапасов.Организация
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыПоставщикамОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|					И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыПоставщикамОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|		ГДЕ
	|			ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|			И ГрафикДвиженияЗапасов.Склад = &Отправитель
	|			И &УчетПотребностиПоСкладам
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш,
	|			СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0)),
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство
	|		ИЗ
	|			РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)
	|						И Склад = &Отправитель) КАК ЗаказыНаПроизводствоОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
	|						,
	|						Организация = &Организация
	|							И Номенклатура В (&Номенклатура)
	|							И Характеристика В (&Характеристика)) КАК РазмещениеЗаказовОстатки
	|				ПО ЗаказыНаПроизводствоОстатки.Организация = РазмещениеЗаказовОстатки.Организация
	|					И ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовОстатки.ИсточникОбеспечения
	|					И ЗаказыНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
	|					И ЗаказыНаПроизводствоОстатки.Характеристика = РазмещениеЗаказовОстатки.Характеристика
	|		ГДЕ
	|			ЗаказыНаПроизводствоОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) > 0
	|			И &УчетПотребностиПоСкладам
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство,
	|			ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.ДатаПеремещения,
	|			ЗаказыНаПеремещениеОстатки.КоличествоОстаток,
	|			ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение
	|		ИЗ
	|			РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|					,
	|					Организация = &Организация
	|						И Номенклатура В (&Номенклатура)
	|						И Характеристика В (&Характеристика)
	|						И Склад = &Отправитель
	|						И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)) КАК ЗаказыНаПеремещениеОстатки) КАК ВложенныйЗапрос1
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос1.Количество,
	|		ВложенныйЗапрос1.Ссылка) КАК ВложенныйЗапрос";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗапасыПоступленияСвободныеИПоЗаказу()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК Количество,
	|		ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Ссылка,
	|		ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				Организация = &Организация
	|					И Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика
	|					И НЕ ЗаказПоставщику В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								РазмещениеЗаказовОстатки.ИсточникОбеспечения КАК ИсточникОбеспечения
	|							ИЗ
	|								РегистрНакопления.РазмещениеЗаказов.Остатки(, Номенклатура = &Номенклатура
	|									И Характеристика = &Характеристика) КАК РазмещениеЗаказовОстатки)) КАК ЗаказыПоставщикамОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ЗаказыНаПроизводствоОстатки.КоличествоОстаток),
	|		ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство,
	|		ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаПроизводство.Остатки(
	|				,
	|				Организация = &Организация
	|					И Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика
	|					И НЕ ЗаказНаПроизводство В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								РазмещениеЗаказовОстатки.ИсточникОбеспечения КАК ИсточникОбеспечения
	|							ИЗ
	|								РегистрНакопления.РазмещениеЗаказов.Остатки(, Номенклатура = &Номенклатура
	|									И Характеристика = &Характеристика) КАК РазмещениеЗаказовОстатки)) КАК ЗаказыНаПроизводствоОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство,
	|		ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство.Финиш
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РазмещениеЗаказовОстатки.КоличествоОстаток,
	|		РазмещениеЗаказовОстатки.ИсточникОбеспечения,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(РазмещениеЗаказовОстатки.ИсточникОбеспечения) = ТИП(Документ.ЗаказНаПроизводство)
	|				ТОГДА РазмещениеЗаказовОстатки.ИсточникОбеспечения.Финиш
	|			КОГДА ТИПЗНАЧЕНИЯ(РазмещениеЗаказовОстатки.ИсточникОбеспечения) = ТИП(Документ.ЗаказПоставщику)
	|				ТОГДА РазмещениеЗаказовОстатки.ИсточникОбеспечения.ДатаПоступления
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				Организация = &Организация
	|					И Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика
	|					И ЗаказПокупателя = &ЗаказПокупателя) КАК РазмещениеЗаказовОстатки) КАК ВложенныйЗапрос";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаток()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Запасы.Регистратор КАК Регистратор,
	|	СУММА(ВЫБОР
	|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Запасы.Количество * -1
	|			ИНАЧЕ Запасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	Запасы.СтруктурнаяЕдиница КАК Склад
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|	И Запасы.Номенклатура = &Номенклатура
	|	И Запасы.Характеристика = &Характеристика
	|	И Запасы.Партия = &Партия
	|	И Запасы.СтруктурнаяЕдиница = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Регистратор,
	|	Запасы.СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ,
	|	Регистратор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗапасыВРезервеПоСкладам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК Количество,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И ЗаказПокупателя = &ЗаказПокупателя
	|				И Организация = &Организация
	|				И Характеристика = &Характеристика
	|				И Партия = &Партия) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиОбщие(ЕстьСсылка = Ложь, ЭтоЗаказ = Истина)
	
	Если ЕстьСсылка Тогда
		
		Если ЭтоЗаказ Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница
			|ПОМЕСТИТЬ Склады
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
			|					И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
			|				ТОГДА СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК Количество,
			|	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад
			|ПОМЕСТИТЬ Остатки
			|ИЗ
			|	РегистрНакопления.Запасы.Остатки(
			|			,
			|			Организация = &Организация
			|				И Номенклатура = &Номенклатура
			|				И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			|				И Организация = &Организация
			|				И Характеристика = &Характеристика
			|				И Партия = &Партия
			|				И ВЫБОР
			|					КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
			|							И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
			|						ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ) КАК ЗапасыОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗапасыОстатки.СтруктурнаяЕдиница
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	СУММА(ВЫБОР
			|			КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА Запасы.Количество * -1
			|			ИНАЧЕ Запасы.Количество
			|		КОНЕЦ) КАК ЗарезервированоЗаказом
			|ПОМЕСТИТЬ РезервСделанныйЗаказом
			|ИЗ
			|	РегистрНакопления.Запасы КАК Запасы
			|ГДЕ
			|	Запасы.Регистратор = &ЗаказПокупателя
			|	И Запасы.ЗаказПокупателя = &ЗаказПокупателя
			|	И Запасы.Номенклатура = &Номенклатура
			|	И Запасы.Характеристика = &Характеристика
			|	И Запасы.Партия = &Партия
			|
			|СГРУППИРОВАТЬ ПО
			|	Запасы.СтруктурнаяЕдиница
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(Остатки.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказом,
			|	Склады.СтруктурнаяЕдиница КАК Склад
			|ИЗ
			|	Склады КАК Склады
			|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
			|		ПО Склады.СтруктурнаяЕдиница = Остатки.Склад
			|		ЛЕВОЕ СОЕДИНЕНИЕ РезервСделанныйЗаказом КАК РезервСделанныйЗаказом
			|		ПО Склады.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница";
			
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница
			|ПОМЕСТИТЬ Склады
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
			|					И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
			|				ТОГДА СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК Количество,
			|	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад
			|ПОМЕСТИТЬ Остатки
			|ИЗ
			|	РегистрНакопления.Запасы.Остатки(
			|			,
			|			Организация = &Организация
			|				И Номенклатура = &Номенклатура
			|				И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			|				И Характеристика = &Характеристика
			|				И Партия = &Партия
			|				И ВЫБОР
			|					КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
			|							И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
			|						ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ) КАК ЗапасыОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗапасыОстатки.СтруктурнаяЕдиница
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	СУММА(Запасы.Количество) КАК ЗарезервированоЗаказом
			|ПОМЕСТИТЬ ДвижениеПоНакладнойБезРезерва
			|ИЗ
			|	РегистрНакопления.Запасы КАК Запасы
			|ГДЕ
			|	Запасы.Регистратор = &Ссылка
			|	И Запасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			|	И Запасы.Номенклатура = &Номенклатура
			|	И Запасы.Характеристика = &Характеристика
			|	И Запасы.Партия = &Партия
			|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|
			|СГРУППИРОВАТЬ ПО
			|	Запасы.СтруктурнаяЕдиница
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(Остатки.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(РезервСделанныйЗаказом.ЗарезервированоЗаказом, 0) КАК ЗарезервированоЗаказом,
			|	Склады.СтруктурнаяЕдиница КАК Склад
			|ИЗ
			|	Склады КАК Склады
			|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
			|		ПО Склады.СтруктурнаяЕдиница = Остатки.Склад
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеПоНакладнойБезРезерва КАК РезервСделанныйЗаказом
			|		ПО Склады.СтруктурнаяЕдиница = РезервСделанныйЗаказом.СтруктурнаяЕдиница
			|
			|УПОРЯДОЧИТЬ ПО
			|	Склад,
			|	Количество УБЫВ";
			
			
			
		КонецЕсли;
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК Количество,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад,
		|	0 КАК ЗарезервированоЗаказом
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			Организация = &Организация
		|				И Номенклатура = &Номенклатура
		|				И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И Организация = &Организация
		|				И Характеристика = &Характеристика
		|				И Партия = &Партия
		|				И ВЫБОР
		|					КОГДА НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СборкаЗапасов)
		|							И НЕ ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.ЗаказНаПроизводство)
		|						ТОГДА СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.СтруктурнаяЕдиница
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";
		
	КонецЕсли;
	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция НайденаСтрокаСТакимЖеСкладомОбработанаТекущаяИУдаленаЗаказНаПроизводство(СтрокиКУдалению, СтрокаЗапасы, МассивОбработанныхСтрок)
	
	ИмяКолонкиРезерв = ?(СтрокаЗапасы.Свойство("СтруктурнаяЕдиницаРезерв"),
		"СтруктурнаяЕдиницаРезерв", "СтруктурнаяЕдиница");
	
	Для Каждого СтрокаМассива Из МассивОбработанныхСтрок Цикл
		
		Если СтрокаЗапасы[ИмяКолонкиРезерв] = СтрокаМассива[ИмяКолонкиРезерв]
			И СтрокаЗапасы.ЗаказПокупателя = СтрокаМассива.ЗаказПокупателя Тогда
			
			СтрокаМассива.Количество = СтрокаМассива.Количество + СтрокаЗапасы.Количество;
			СтрокаМассива.Резерв = СтрокаМассива.Резерв + СтрокаЗапасы.Резерв;
			
			СтрокиКУдалению.Добавить(СтрокаЗапасы);
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция НайденаСтрокаСТакимЖеСкладомОбработанаТекущаяИУдалена(СтрокиКУдалению, СтрокаЗапасы, МассивОбработанныхСтрок)
	
	ИмяКолонкиРезерв = ?(СтрокаЗапасы.Свойство("СтруктурнаяЕдиницаРезерв"),
		"СтруктурнаяЕдиницаРезерв", "СтруктурнаяЕдиница");
	
	Для Каждого СтрокаМассива Из МассивОбработанныхСтрок Цикл
		
		Если СтрокаЗапасы[ИмяКолонкиРезерв] = СтрокаМассива[ИмяКолонкиРезерв]
			И СтрокаЗапасы.Цена = СтрокаМассива.Цена Тогда
			
			СтрокаМассива.Количество = СтрокаМассива.Количество + СтрокаЗапасы.Количество;
			СтрокаМассива.Резерв = СтрокаМассива.Резерв + СтрокаЗапасы.Резерв;
			
			СтрокиКУдалению.Добавить(СтрокаЗапасы);
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//@skip-check method-too-many-params
Функция НайденИУдаленДубльТекущейСтроки(СтрокиКУдалению, СтрокаЗапасы, МассивОбработанныхСтрок,
	УчитыватьЯчейку = Ложь, ИмяКолонки =  "СтруктурнаяЕдиница", ИмяТЧ = "Запасы", ТипДокумента = "ЗаказПокупателя")
	
	ЕстьЦена = Не (ИмяТЧ = "Материалы" Или ТипДокумента = "Производство");
	
	Если Не УчитыватьЯчейку Тогда
		
		Для Каждого СтрокаМассива Из МассивОбработанныхСтрок Цикл
			
			Если СтрокаЗапасы[ИмяКолонки] = СтрокаМассива[ИмяКолонки]
				И СтрокаЗапасы.ЕдиницаИзмерения = СтрокаМассива.ЕдиницаИзмерения Тогда
				
				Если ЕстьЦена И СтрокаЗапасы.Цена = СтрокаМассива.Цена Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				ИначеЕсли Не ЕстьЦена Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				КонецЕсли;
				
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаМассива Из МассивОбработанныхСтрок Цикл
			
			Если СтрокаЗапасы[ИмяКолонки] = СтрокаМассива[ИмяКолонки]
				И СтрокаЗапасы["Ячейка"] = СтрокаМассива["Ячейка"]
				И СтрокаЗапасы.ЕдиницаИзмерения = СтрокаМассива.ЕдиницаИзмерения Тогда
				
				Если ЕстьЦена И СтрокаЗапасы.Цена = СтрокаМассива.Цена Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				ИначеЕсли Не ЕстьЦена Тогда
					СтрокиКУдалению.Добавить(СтрокаЗапасы);
				КонецЕсли;
				
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПодготовитьТаблицуСогласноПриоритетам(ТаблицаОстатков, СтруктурнаяЕдиницаОтгрузки)
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиницаОтгрузки) Тогда 
		
		ТаблицаОстатков.Сортировать("КоличествоОстаток Убыв");
		Возврат 
	КонецЕсли;
	
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл
		СтрокаОстатка.Приоритет = ?(СтрокаОстатка.СтруктурнаяЕдиница = СтруктурнаяЕдиницаОтгрузки,
			0, СтрокаОстатка.Приоритет);
	КонецЦикла;
	
	ТаблицаОстатков.Сортировать("Приоритет Возр");
	
КонецПроцедуры

Процедура ОчиститьПриоритеты(ТаблицаОстатков)
	
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл
		СтрокаОстатка.Приоритет = ?(Не СтрокаОстатка.Приоритет = 1, 2, СтрокаОстатка.Приоритет);
	КонецЦикла;
	
КонецПроцедуры

Функция ОстаткиПоЯчейкам(СтруктураПараметров, ТаблицаЗапасы, ИмяКолонкиЗаказ = "Заказ")
	
	Заказы = ТаблицаЗапасы.Скопировать(,ИмяКолонкиЗаказ);
	Заказы.Свернуть(ИмяКолонкиЗаказ);
	
	ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
	ТаблицаНоменклатуры.Свернуть("Номенклатура, Характеристика, Партия");
	
	ТаблицаЗапасы.Свернуть("Номенклатура, Характеристика, Партия");
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(СтруктураПараметров.Организация) = Тип("Массив") Тогда
		Организации = СтруктураПараметров.Организация;
	Иначе
		Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураПараметров.Организация);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организации",   Организации);
	Запрос.УстановитьПараметр("Номенклатура",  СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("Регистратор",   СтруктураПараметров.Регистратор);
	Запрос.УстановитьПараметр("Заказы",        Заказы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаЗапасы.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(ТаблицаЗапасы.Партия, ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)) КАК Партия
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ РезервПоСкладу
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Организация В (&Организации)
	|				И Номенклатура В (&Номенклатура)
	|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				И НЕ ЗаказПокупателя В (&Заказы)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ОрдерныйСклад
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗапасыНаСкладахОстатки.Ячейка
	|	КОНЕЦ КАК Ячейка,
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиПоЯчейкам
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			,
	|			Организация В (&Организации)
	|				И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладахОстатки.Партия,
	|	ЗапасыНаСкладахОстатки.Характеристика,
	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница,
	|	ЗапасыНаСкладахОстатки.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ОрдерныйСклад
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗапасыНаСкладахОстатки.Ячейка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладах.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ЗапасыНаСкладах.СтруктурнаяЕдиница.ОрдерныйСклад
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗапасыНаСкладах.Ячейка
	|	КОНЕЦ КАК Ячейка,
	|	СУММА(ЗапасыНаСкладах.Количество) КАК Количество,
	|	ЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ РасходПоЯчейкам
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	ЗапасыНаСкладах.Регистратор = &Регистратор
	|	И ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладах.Партия,
	|	ЗапасыНаСкладах.Характеристика,
	|	ЗапасыНаСкладах.Номенклатура,
	|	ЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ЗапасыНаСкладах.СтруктурнаяЕдиница.ОрдерныйСклад
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗапасыНаСкладах.Ячейка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиПоЯчейкам.Номенклатура КАК Номенклатура,
	|	ОстаткиПоЯчейкам.Характеристика КАК Характеристика,
	|	ОстаткиПоЯчейкам.Партия КАК Партия,
	|	ОстаткиПоЯчейкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОстаткиПоЯчейкам.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ Ячейки
	|ИЗ
	|	ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходПоЯчейкам.Номенклатура,
	|	РасходПоЯчейкам.Характеристика,
	|	РасходПоЯчейкам.Партия,
	|	РасходПоЯчейкам.СтруктурнаяЕдиница,
	|	РасходПоЯчейкам.Ячейка
	|ИЗ
	|	РасходПоЯчейкам КАК РасходПоЯчейкам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатков.Характеристика КАК Характеристика,
	|	ТаблицаОстатков.Партия КАК Партия,
	|	Ячейки.Ячейка КАК Ячейка,
	|	Ячейки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ НоменклатураПоЯчейкам
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ячейки КАК Ячейки
	|		ПО ТаблицаОстатков.Номенклатура = Ячейки.Номенклатура
	|			И ТаблицаОстатков.Характеристика = Ячейки.Характеристика
	|			И ТаблицаОстатков.Партия = Ячейки.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураПоЯчейкам.Номенклатура КАК Номенклатура,
	|	НоменклатураПоЯчейкам.Характеристика КАК Характеристика,
	|	НоменклатураПоЯчейкам.Партия КАК Партия,
	|	НоменклатураПоЯчейкам.Ячейка КАК Ячейка,
	|	НоменклатураПоЯчейкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОстаткиПоЯчейкам.КоличествоОстаток КАК ОстатокВЯчейке,
	|	РасходПоЯчейкам.Количество КАК ДвижениеПоЯчейке,
	|	ЕСТЬNULL(ОстаткиПоЯчейкам.КоличествоОстаток, 0) + ЕСТЬNULL(РасходПоЯчейкам.Количество, 0) КАК ОстатокСУчетомДвижения,
	|	ЕСТЬNULL(РезервПоСкладу.КоличествоОстаток, 0) КАК РезервПоСкладуБезТекЗаказов
	|ИЗ
	|	НоменклатураПоЯчейкам КАК НоменклатураПоЯчейкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам
	|		ПО НоменклатураПоЯчейкам.Номенклатура = ОстаткиПоЯчейкам.Номенклатура
	|			И НоменклатураПоЯчейкам.Характеристика = ОстаткиПоЯчейкам.Характеристика
	|			И НоменклатураПоЯчейкам.Партия = ОстаткиПоЯчейкам.Партия
	|			И НоменклатураПоЯчейкам.Ячейка = ОстаткиПоЯчейкам.Ячейка
	|			И НоменклатураПоЯчейкам.СтруктурнаяЕдиница = ОстаткиПоЯчейкам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходПоЯчейкам КАК РасходПоЯчейкам
	|		ПО НоменклатураПоЯчейкам.Номенклатура = РасходПоЯчейкам.Номенклатура
	|			И НоменклатураПоЯчейкам.Характеристика = РасходПоЯчейкам.Характеристика
	|			И НоменклатураПоЯчейкам.Партия = РасходПоЯчейкам.Партия
	|			И НоменклатураПоЯчейкам.Ячейка = РасходПоЯчейкам.Ячейка
	|			И НоменклатураПоЯчейкам.СтруктурнаяЕдиница = РасходПоЯчейкам.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервПоСкладу КАК РезервПоСкладу
	|		ПО НоменклатураПоЯчейкам.Номенклатура = РезервПоСкладу.Номенклатура
	|			И НоменклатураПоЯчейкам.Характеристика = РезервПоСкладу.Характеристика
	|			И НоменклатураПоЯчейкам.Партия = РезервПоСкладу.Партия
	|			И НоменклатураПоЯчейкам.СтруктурнаяЕдиница = РезервПоСкладу.СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстатокСУчетомДвижения,
	|	Ячейка";
	
	ТаблицаПоЯчейкам = Запрос.Выполнить().Выгрузить();
	
	МассивСтрокКУдалению = Новый Массив;
	
	ТаблицаСкладов = ТаблицаПоЯчейкам.Скопировать(,"СтруктурнаяЕдиница");
	ТаблицаСкладов.Свернуть("СтруктурнаяЕдиница");
	
	Для Каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
		
		Для Каждого СкладСОстатками Из ТаблицаСкладов Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура",       СтрокаТаблицы.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика",     СтрокаТаблицы.Характеристика);
			ПараметрыОтбора.Вставить("Партия",             СтрокаТаблицы.Партия);
			ПараметрыОтбора.Вставить("СтруктурнаяЕдиница", СкладСОстатками.СтруктурнаяЕдиница);
			
			СтрокиПоЯчейкам = ТаблицаПоЯчейкам.НайтиСтроки(ПараметрыОтбора);
			
			ПерваяИтерация = Истина;
			РезервПоСкладуБезТекЗаказов = 0;
			
			Для Каждого СтрокаПоЯчейке Из СтрокиПоЯчейкам Цикл
				
				РезервПоСкладуБезТекЗаказов = ?(ПерваяИтерация,
					СтрокаПоЯчейке.РезервПоСкладуБезТекЗаказов, РезервПоСкладуБезТекЗаказов);
				ПерваяИтерация = Ложь;
				
				Если РезервПоСкладуБезТекЗаказов <= 0 Тогда
					Прервать
				КонецЕсли;
				
				Если РезервПоСкладуБезТекЗаказов > СтрокаПоЯчейке.ОстатокСУчетомДвижения Тогда
					РезервПоСкладуБезТекЗаказов = РезервПоСкладуБезТекЗаказов
						- СтрокаПоЯчейке.ОстатокСУчетомДвижения;
					СтрокаПоЯчейке.ОстатокСУчетомДвижения = 0;
					МассивСтрокКУдалению.Добавить(СтрокаПоЯчейке);
				Иначе
					СтрокаПоЯчейке.ОстатокСУчетомДвижения = СтрокаПоЯчейке.ОстатокСУчетомДвижения
						- РезервПоСкладуБезТекЗаказов;
					РезервПоСкладуБезТекЗаказов = 0;
				КонецЕсли;
				
				СтрокаПоЯчейке.РезервПоСкладуБезТекЗаказов = РезервПоСкладуБезТекЗаказов;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
		ТаблицаПоЯчейкам.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	Возврат ТаблицаПоЯчейкам;
	
КонецФункции

Процедура ЗаполнитьСтруктурнуюЕдиницуРезерваВТЧ(Объект, ИмяТЧ = "Запасы")
	
	Если Объект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктурнаяЕдиницаРезерв = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство"),
		"СтруктурнаяЕдиница", "СтруктурнаяЕдиницаРезерв");
	
	Для каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			ИЛИ ТипЗнч(СтрокаТабличнойЧасти.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти.Свойство("ТипНоменклатурыЗапас")
			И Не СтрокаТабличнойЧасти.ТипНоменклатурыЗапас Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаТабличнойЧасти[СтруктурнаяЕдиницаРезерв] = Объект.СтруктурнаяЕдиницаРезерв;
		
		Если Объект.Свойство("Ячейка") Тогда
			СтрокаТабличнойЧасти.Ячейка = Объект.Ячейка;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Свойство("Объект") Тогда
		Для каждого СтрокаТабличнойЧасти Из Объект.Материалы Цикл
			СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = Объект.СтруктурнаяЕдиницаРезерв;
			СтрокаТабличнойЧасти.Ячейка = Объект.Ячейка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьКоличествоПоСтрокамСогласноКоэффициентам(ТаблицаНоменклатуры)
	
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения;
		
	КонецЦикла;
	
КонецПроцедуры

//@skip-check method-too-many-params
Функция ПолучитьСуммуПоТабличнойЧасти(Объект, ПараметрыОтбора, ВидСуммы = "Резерв", НомерВариантаКП = 0,
	КоэффициентТекЕдиницы = 1, ИмяТЧ = "Запасы", ТипДокумента = Неопределено, СостояниеВыполнения = "")
	
	ЭтоЗаказПокупателя = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя"), Истина, Ложь);
	
	Если ЭтоЗаказПокупателя И ИмяТЧ = "Запасы" Тогда
		ПараметрыОтбора.Вставить("НомерВариантаКП", НомерВариантаКП);
		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
		ПараметрыОтбора.Удалить("НомерВариантаКП");
	Иначе
		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
	КонецЕсли;
	
	СуммаПоСтрокам = 0;
	
	Если ВидСуммы = "Резервировать" Тогда
		ИмяКолонки = ?(ТипДокумента = "ЗаказНаряд" И СостояниеВыполнения = "Отгрузка", "РезервОтгрузка", "Резерв");
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			КоэффициентЕдиницыИзмерения = КоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТабличнойЧасти[ИмяКолонки]*КоэффициентЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидСуммы = "ВРезерве" Тогда 
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			КоэффициентЕдиницыИзмерения = КоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТабличнойЧасти.ВРезерве*КоэффициентЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидСуммы = "Количество" Тогда 
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			КоэффициентЕдиницыИзмерения = КоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидСуммы = "Отгружено" Тогда 
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			КоэффициентЕдиницыИзмерения = КоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТабличнойЧасти.Отгружено*КоэффициентЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидСуммы = "НеОтгружено" Тогда 
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			КоэффициентЕдиницыИзмерения = КоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТабличнойЧасти.НеОтгружено*КоэффициентЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидСуммы = "Свободно" Тогда 
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			КоэффициентЕдиницыИзмерения = КоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТабличнойЧасти.ОстатокСвободно*КоэффициентЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	СуммаПоСтрокам = СуммаПоСтрокам / КоэффициентТекЕдиницы;
	
	Возврат СуммаПоСтрокам;
	
КонецФункции

// Возвращает коэффициент единицы измерения.
//
// Параметры:
//  ЕдиницаИзмерения - СправочникСсылка.ЕдиницыИзмерения - Единица измерения, для которой необходимо получить коэффициент.
//
// Возвращаемое значение:
//  Число - Коэффициент единицы измерения. Если единица измерения не заполнена или имеет неправильный тип, возвращается 1.
//
Функция КоэффициентЕдиницыИзмерения(ЕдиницаИзмерения)
	
	Если Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		Возврат 1;
	КонецЕсли;

	Если ТипЗнч(ЕдиницаИзмерения) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		Возврат 1;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Коэффициент");
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредметИсчисления(Число, ПараметрыПредметаИсчисления1, ПараметрыПредметаИсчисления2,
	ПараметрыПредметаИсчисления3, Род)
	
	ФорматнаяСтрока = "Л = ru_RU";
	
	ПараметрыПредметаИсчисления = "%1,%2,%3,%4,,,,,0";
	ПараметрыПредметаИсчисления = СтрШаблон(
		ПараметрыПредметаИсчисления,
		ПараметрыПредметаИсчисления1,
		ПараметрыПредметаИсчисления2,
		ПараметрыПредметаИсчисления3,
		Род);
	
	ЧислоСтрокойИПредметИсчисления = НРег(ЧислоПрописью(Число, ФорматнаяСтрока, ПараметрыПредметаИсчисления));
	
	ЧислоПрописью = НРег(СокрЛП(СтрЗаменить(ЧислоПрописью(Число), "00", "")));
	
	ПредметИсчисления = СтрЗаменить(ЧислоСтрокойИПредметИсчисления, ЧислоПрописью, "");
	
	Возврат ПредметИсчисления;
	
КонецФункции

Процедура СообщитьЧтоВыборПартииНевозможен(Объект, ОперацияДокумента)
	ТекстСообщения = СтрШаблон(НСтр(
		"ru = 'Для операции документа - %1, не найден статус партии. Выбор партии не возможен.'"),
		ОперацияДокумента);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект);
КонецПроцедуры

// Предварительно заполняет колонки табличной части документа Заказ на производство значениями по остаткам и резервам
//
Процедура ЗаполнитьНачальныеДанныеДляОбработкиТабличнойЧастиЗаказНаПроизводство(Объект, МассивЗаказов,
	СтрокиОбходаЗапасов, ТаблицаНоменклатуры, СтруктураПараметровОтбора)
	
	ЕстьЗаказ = (МассивЗаказов.Количество()>0 ИЛИ НЕ Объект.Ссылка.Пустая());
	ИспользоватьРезервирование = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	ДокументСохранен = ЗначениеЗаполнено(Объект.Ссылка);
	
	ПараметрыОтбораБезСклада = СтруктураПараметровОтбора.БезСклада;
	ПараметрыОтбора = СтруктураПараметровОтбора.ССкладом;
	ПараметрыОтбораБезСкладаБезПартииСЗаказом = СтруктураПараметровОтбора.БезСкладаСЗаказом;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", МассивЗаказов);
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЕстьЗаказы", ИспользоватьРезервирование И ЕстьЗаказ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВЗапасах.Номенклатура КАК Номенклатура,
	|	ПотребностьВЗапасах.Характеристика КАК Характеристика,
	|	СУММА(ПотребностьВЗапасах.Количество) КАК Количество,
	|	СУММА(ПотребностьВЗапасах.Количество) КАК ОтгруженоИтог,
	|	ПотребностьВЗапасах.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПотребностьВЗапасах.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ИЗ
	|	РегистрНакопления.ПотребностьВЗапасах КАК ПотребностьВЗапасах
	|ГДЕ
	|	ПотребностьВЗапасах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВЫБОР
	|			КОГДА &ЕстьЗаказы
	|				ТОГДА ПотребностьВЗапасах.ЗаказПокупателя В (&ЗаказПокупателя)
	|						ИЛИ ПотребностьВЗапасах.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВЗапасах.ЗаказПокупателя,
	|	ПотребностьВЗапасах.ЗаказНаПроизводство,
	|	ПотребностьВЗапасах.Характеристика,
	|	ПотребностьВЗапасах.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	СУММА(Запасы.Количество) КАК Количество,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(Запасы.Количество) КАК ОтгруженоИтог,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВЫБОР
	|			КОГДА &ЕстьЗаказы
	|				ТОГДА Запасы.ЗаказПокупателя В (&ЗаказПокупателя)
	|		КОНЕЦ
	|	И Запасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|	И Запасы.СчетУчета = Запасы.Номенклатура.СчетУчетаЗапасов
	|	И НЕ ТИПЗНАЧЕНИЯ(Запасы.Регистратор) = ТИП(Документ.РезервированиеЗапасов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Партия,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.ЗаказПокупателя";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаОтгрузкаПоЗаказу = ПакетЗапросов[0].Выгрузить();
	ТаблицаОтгрузкаРезервовПоСкладам = ПакетЗапросов[1].Выгрузить();
	
	ПараметрыОтбораБезСкладаБезПартииСЗаказами = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтбораБезСкладаБезПартииСЗаказом);
	ПараметрыОтбораБезСкладаБезПартииСЗаказами.Вставить("ЗаказНаПроизводство", Объект.Ссылка);
	
	// Заполним по отгрузкам резервов
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
		
		СтрокаТабличнойЧасти.НеОтгружено = 0;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		КоличествоСКоэффициентом = СтрокаТабличнойЧасти.Количество * КоэффициентЕдиницыИзмерения;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
		ПараметрыОтбора.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораБезСклада.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ПараметрыОтбораБезСкладаБезПартииСЗаказами.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСкладаБезПартииСЗаказами.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСкладаБезПартииСЗаказами.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ОтгруженоВБазовыхЕд = 0;
		Отгружено = 0;
		ОтгруженоИтог = 0;
		
		СтрокиПоНоменклатуре = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбораБезСклада);
		СуммаПоСтрокам = СтрокиПоНоменклатуре[0].Количество;
		СуммаПоСтрокамСТекКоэффициентом = СуммаПоСтрокам / КоэффициентЕдиницыИзмерения;
		
		Если Не ДокументСохранен Тогда 
			СтрокаТабличнойЧасти.НеОтгружено = СтрокаТабличнойЧасти.Количество;
			СтрокаТабличнойЧасти.Отгружено = 0;
			СтрокаТабличнойЧасти.ПредставлениеНеОтгружено = "";
		Иначе
			
			НайденныеСтрокиОтгруженоПоСкладам = ТаблицаОтгрузкаРезервовПоСкладам.НайтиСтроки(ПараметрыОтбора);
			НайденныеСтрокиОтгружено = ТаблицаОтгрузкаПоЗаказу.НайтиСтроки(ПараметрыОтбораБезСкладаБезПартииСЗаказом);
			
			Если НайденныеСтрокиОтгруженоПоСкладам.Количество() Тогда
				ОтгруженоВБазовыхЕд = ?(НайденныеСтрокиОтгруженоПоСкладам.Количество(), НайденныеСтрокиОтгруженоПоСкладам[0].Количество, 0);
				Отгружено = Окр(ОтгруженоВБазовыхЕд/КоэффициентЕдиницыИзмерения,3);
			КонецЕсли;
			
			Если Отгружено > 0 И НайденныеСтрокиОтгружено.Количество() Тогда
				
				Если СтрокаТабличнойЧасти.Количество >= Отгружено Тогда
					СтрокаТабличнойЧасти.Отгружено = Отгружено;
					НайденныеСтрокиОтгруженоПоСкладам[0].Количество = 0;
					СтрокаТабличнойЧасти.НеОтгружено = ?(СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Отгружено<0, 0, СтрокаТабличнойЧасти.Количество - Отгружено);
				Иначе
					СтрокаТабличнойЧасти.Отгружено = СтрокаТабличнойЧасти.Количество;
					НайденныеСтрокиОтгруженоПоСкладам[0].Количество = ОтгруженоВБазовыхЕд - СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения;
					СтрокаТабличнойЧасти.НеОтгружено = 0;
				КонецЕсли;
				
				Если НайденныеСтрокиОтгружено[0].ОтгруженоИтог > СуммаПоСтрокам Тогда
					НайденныеСтрокиОтгружено[0].Количество = СуммаПоСтрокам;
					НайденныеСтрокиОтгружено[0].ОтгруженоИтог = СуммаПоСтрокам;
				КонецЕсли;
				
				НайденныеСтрокиОтгружено[0].Количество = НайденныеСтрокиОтгружено[0].Количество - СтрокаТабличнойЧасти.Отгружено;
				
			Иначе
				СтрокаТабличнойЧасти.Отгружено = 0;
				СтрокаТабличнойЧасти.НеОтгружено = СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
	
		КонецЕсли;

		СтрокаТабличнойЧасти.СрокПополнения = СтрокаТабличнойЧасти.Номенклатура.СрокПополнения;
		
	КонецЦикла;
	
	// Дополним по отгрузкам без резервов
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
			
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		КоличествоСКоэффициентом = СтрокаТабличнойЧасти.Количество*КоэффициентЕдиницыИзмерения;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбораБезСклада.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ПараметрыОтбораБезСкладаБезПартииСЗаказами.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСкладаБезПартииСЗаказами.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСкладаБезПартииСЗаказами.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		
		ОтгруженоВБазовыхЕд = 0;
		Отгружено = 0;
		НеОтгруженоИтог = 0;
		ОтгруженоИтог = 0;
		
		СтрокиПоНоменклатуре = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбораБезСклада);
		СуммаПоСтрокам = СтрокиПоНоменклатуре[0].Количество;
		СуммаПоСтрокамСТекКоэффициентом = СуммаПоСтрокам / КоэффициентЕдиницыИзмерения;
		
		НайденныеСтрокиОтгружено = ТаблицаОтгрузкаПоЗаказу.НайтиСтроки(ПараметрыОтбораБезСкладаБезПартииСЗаказом);
		
		Если НайденныеСтрокиОтгружено.Количество() Тогда
			Отгружено = СтрокаТабличнойЧасти.Отгружено
				+ Окр(НайденныеСтрокиОтгружено[0].Количество / КоэффициентЕдиницыИзмерения, 3);
			ОтгруженоИтог = Окр(НайденныеСтрокиОтгружено[0].ОтгруженоИтог/КоэффициентЕдиницыИзмерения, 3,
				РежимОкругления.Окр15как20);
			ОтгруженоВБазовыхЕд = НайденныеСтрокиОтгружено[0].Количество;
		КонецЕсли;
		
		НеОтгруженоИтог = СуммаПоСтрокамСТекКоэффициентом - ОтгруженоИтог;
		
		Если Не Отгружено = 0 Тогда
			
			Если СтрокаТабличнойЧасти.Количество >= Отгружено Тогда
				
				СтрокаТабличнойЧасти.Отгружено = Отгружено;
				НайденныеСтрокиОтгружено[0].Количество = 0;
				СтрокаТабличнойЧасти.НеОтгружено =
					?(СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Отгружено < 0,
						0, СтрокаТабличнойЧасти.Количество - Отгружено);
			Иначе
				НайденныеСтрокиОтгружено[0].Количество = ОтгруженоВБазовыхЕд
					- (СтрокаТабличнойЧасти.Количество-СтрокаТабличнойЧасти.Отгружено) * КоэффициентЕдиницыИзмерения;
				СтрокаТабличнойЧасти.Отгружено = СтрокаТабличнойЧасти.Количество;
				СтрокаТабличнойЧасти.НеОтгружено = 0;
			КонецЕсли
			
		Иначе
			СтрокаТабличнойЧасти.Отгружено = 0;
			СтрокаТабличнойЧасти.НеОтгружено = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		
		ЭтоДубльСтроки = Ложь;
		СтрокаТабличнойЧасти.ПредставлениеНеОтгружено = "";
		
		Если Не СтрокаТабличнойЧасти.НеОтгружено = НеОтгруженоИтог Тогда
			Если Не СтрокаТабличнойЧасти.НеОтгружено = 0 Тогда
				СтрокаТабличнойЧасти.ПредставлениеНеОтгружено =
					СтрШаблон("%1 / %2", Формат(СтрокаТабличнойЧасти.НеОтгружено, "ЧДЦ = 3"),
						Формат(НеОтгруженоИтог, "ЧДЦ = 3")); 
			КонецЕсли;
			ЭтоДубльСтроки = Истина;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ЭтоДубльСтроки = ЭтоДубльСтроки;
		СтрокаТабличнойЧасти.НеОтгруженоВсего = НеОтгруженоИтог;
		
		Если КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = СтрШаблон("%1 / %2",
				Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3"), Формат(СуммаПоСтрокам, "ЧДЦ=3"));
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = СтрШаблон("%1 / %2",
				Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3"), Формат(СуммаПоСтрокамСТекКоэффициентом, "ЧДЦ=3"));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Предварительно заполняет колонки табличной части документа Заказ покупателя значениями по остаткам и резервам
//
Процедура ЗаполнитьНачальныеДанныеДляОбработкиТабличнойЧасти(Объект, СтрокиОбходаЗапасов, ТаблицаНоменклатуры, СтруктураПараметровОтбора)
	
	ДокументСохранен = ЗначениеЗаполнено(Объект.Ссылка);
	
	ПараметрыОтбораБезСклада = СтруктураПараметровОтбора.БезСклада;
	ПараметрыОтбора = СтруктураПараметровОтбора.ССкладом;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Характеристика КАК Характеристика,
	|	Продажи.Партия КАК Партия,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Количество) КАК ОтгруженоИтог
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА Продажи.ЗаказПокупателя = &ЗаказПокупателя
	|		КОНЕЦ
	|	И Продажи.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	СУММА(Запасы.Количество) КАК Количество,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаРезерв,
	|	СУММА(Запасы.Количество) КАК ОтгруженоИтог
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВЫБОР
	|			КОГДА НЕ &ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА Запасы.ЗаказПокупателя = &ЗаказПокупателя
	|		КОНЕЦ
	|	И НЕ ТИПЗНАЧЕНИЯ(Запасы.Регистратор) = ТИП(Документ.РезервированиеЗапасов)
	|	И НЕ ТИПЗНАЧЕНИЯ(Запасы.Регистратор) = ТИП(Документ.СборкаЗапасов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Партия,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СтруктурнаяЕдиница";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаОтгрузкаПоЗаказу = ПакетЗапросов[0].Выгрузить();
	ТаблицаОтгрузкаРезервовПоСкладам = ПакетЗапросов[1].Выгрузить();
	
	// Заполним по отгрузкам резервов
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
		
		СтрокаТабличнойЧасти.НеОтгружено = 0;
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		КоличествоСКоэффициентом = СтрокаТабличнойЧасти.Количество * КоэффициентЕдиницыИзмерения;
		
		ПараметрыОтбора.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбора.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбора.Партия = СтрокаТабличнойЧасти.Партия;
		ПараметрыОтбора.СтруктурнаяЕдиницаРезерв = СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		
		ОтгруженоВБазовыхЕд = 0;
		Отгружено = 0;
		ОтгруженоИтог = 0;
		
		СтрокиПоНоменклатуре = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбораБезСклада);
		СуммаПоСтрокам = СтрокиПоНоменклатуре[0].Количество;
		СуммаПоСтрокамСТекКоэффициентом = СуммаПоСтрокам / КоэффициентЕдиницыИзмерения;
		
		Если Не ДокументСохранен Тогда 
			СтрокаТабличнойЧасти.НеОтгружено = СтрокаТабличнойЧасти.Количество;
			СтрокаТабличнойЧасти.Отгружено = 0;
			СтрокаТабличнойЧасти.ПредставлениеНеОтгружено = "";
		Иначе
			
			НайденныеСтрокиОтгруженоПоСкладам = ТаблицаОтгрузкаРезервовПоСкладам.НайтиСтроки(ПараметрыОтбора);
			НайденныеСтрокиОтгружено = ТаблицаОтгрузкаПоЗаказу.НайтиСтроки(ПараметрыОтбораБезСклада);
			
			Если НайденныеСтрокиОтгруженоПоСкладам.Количество() Тогда
				ОтгруженоВБазовыхЕд = ?(НайденныеСтрокиОтгруженоПоСкладам.Количество(),
					НайденныеСтрокиОтгруженоПоСкладам[0].Количество, 0);
				Отгружено = Окр(ОтгруженоВБазовыхЕд/КоэффициентЕдиницыИзмерения, 3);
			КонецЕсли;
			
			Если Отгружено > 0 И НайденныеСтрокиОтгружено.Количество() Тогда
				
				Если СтрокаТабличнойЧасти.Количество >= Отгружено Тогда
					СтрокаТабличнойЧасти.Отгружено = Отгружено;
					НайденныеСтрокиОтгруженоПоСкладам[0].Количество = 0;
					СтрокаТабличнойЧасти.НеОтгружено =
						?(СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Отгружено < 0,
							0, СтрокаТабличнойЧасти.Количество - Отгружено);
				Иначе
					СтрокаТабличнойЧасти.Отгружено = СтрокаТабличнойЧасти.Количество;
					НайденныеСтрокиОтгруженоПоСкладам[0].Количество =
						ОтгруженоВБазовыхЕд - СтрокаТабличнойЧасти.Количество * КоэффициентЕдиницыИзмерения;
					СтрокаТабличнойЧасти.НеОтгружено = 0;
				КонецЕсли;
				
				Если НайденныеСтрокиОтгружено[0].ОтгруженоИтог > СуммаПоСтрокам Тогда
					НайденныеСтрокиОтгружено[0].Количество = СуммаПоСтрокам;
					НайденныеСтрокиОтгружено[0].ОтгруженоИтог = СуммаПоСтрокам;
				КонецЕсли;
				
				НайденныеСтрокиОтгружено[0].Количество = НайденныеСтрокиОтгружено[0].Количество
					- СтрокаТабличнойЧасти.Отгружено;
				
			Иначе
				СтрокаТабличнойЧасти.Отгружено = 0;
				СтрокаТабличнойЧасти.НеОтгружено = СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
	
		КонецЕсли;

		СтрокаТабличнойЧасти.СрокПополнения = СтрокаТабличнойЧасти.Номенклатура.СрокПополнения;
		
	КонецЦикла;
	
	// Дополним по отгрузкам без резервов
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОбходаЗапасов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) 
			Или ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("Строка") Тогда Продолжить КонецЕсли;
			
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) 
			Или ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			КоэффициентЕдиницыИзмерения = 1;
		Иначе
			КоэффициентЕдиницыИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		КоличествоСКоэффициентом = СтрокаТабличнойЧасти.Количество * КоэффициентЕдиницыИзмерения;
		
		ПараметрыОтбораБезСклада.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыОтбораБезСклада.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыОтбораБезСклада.Партия = СтрокаТабличнойЧасти.Партия;
		
		ОтгруженоВБазовыхЕд = 0;
		Отгружено = СтрокаТабличнойЧасти.Отгружено;
		НеОтгруженоИтог = 0;
		ОтгруженоИтог = 0;
		
		СтрокиПоНоменклатуре = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбораБезСклада);
		СуммаПоСтрокам = СтрокиПоНоменклатуре[0].Количество;
		СуммаПоСтрокамСТекКоэффициентом = СуммаПоСтрокам / КоэффициентЕдиницыИзмерения;
		
		НайденныеСтрокиОтгружено = ТаблицаОтгрузкаПоЗаказу.НайтиСтроки(ПараметрыОтбораБезСклада);
		
		Если НайденныеСтрокиОтгружено.Количество() Тогда
			Отгружено = Отгружено + Окр(НайденныеСтрокиОтгружено[0].Количество / КоэффициентЕдиницыИзмерения, 3);
			ОтгруженоИтог = Окр(НайденныеСтрокиОтгружено[0].ОтгруженоИтог / КоэффициентЕдиницыИзмерения, 3,
				РежимОкругления.Окр15как20);
			ОтгруженоВБазовыхЕд = НайденныеСтрокиОтгружено[0].Количество;
		КонецЕсли;
		
		НеОтгруженоИтог = СуммаПоСтрокамСТекКоэффициентом - ОтгруженоИтог;
		
		Если Не Отгружено = 0 Тогда
			
			Если СтрокаТабличнойЧасти.Количество >= Отгружено Тогда
				
				СтрокаТабличнойЧасти.Отгружено = Отгружено;
				НайденныеСтрокиОтгружено[0].Количество = 0;
				СтрокаТабличнойЧасти.НеОтгружено =
					?(СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Отгружено < 0,
						0, СтрокаТабличнойЧасти.Количество - Отгружено);
			Иначе
				НайденныеСтрокиОтгружено[0].Количество = ОтгруженоВБазовыхЕд
					- (СтрокаТабличнойЧасти.Количество
					- СтрокаТабличнойЧасти.Отгружено) * КоэффициентЕдиницыИзмерения;
				СтрокаТабличнойЧасти.Отгружено = СтрокаТабличнойЧасти.Количество;
				СтрокаТабличнойЧасти.НеОтгружено = 0;
			КонецЕсли
			
		Иначе
			СтрокаТабличнойЧасти.Отгружено = 0;
			СтрокаТабличнойЧасти.НеОтгружено = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		
		ЭтоДубльСтроки = Ложь;
		СтрокаТабличнойЧасти.ПредставлениеНеОтгружено = "";
		
		Если Не СтрокаТабличнойЧасти.НеОтгружено = НеОтгруженоИтог Тогда
			Если Не СтрокаТабличнойЧасти.НеОтгружено = 0 Тогда 
				СтрокаТабличнойЧасти.ПредставлениеНеОтгружено = СтрШаблон("%1 / %2", 
					Формат(СтрокаТабличнойЧасти.НеОтгружено, "ЧДЦ = 3"), Формат(НеОтгруженоИтог, "ЧДЦ = 3"));
			КонецЕсли;
			ЭтоДубльСтроки = Истина;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ЭтоДубльСтроки = ЭтоДубльСтроки;
		СтрокаТабличнойЧасти.НеОтгруженоВсего = НеОтгруженоИтог;
		
		Если КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = СтрШаблон("%1 / %2",
				Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3"), Формат(СуммаПоСтрокам, "ЧДЦ=3"));
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3")
		ИначеЕсли Не КоэффициентЕдиницыИзмерения = 1 И Не СуммаПоСтрокам = КоличествоСКоэффициентом Тогда
			СтрокаТабличнойЧасти.ПредставлениеДублей = СтрШаблон("%1 / %2",
				Формат(СтрокаТабличнойЧасти.Количество, "ЧДЦ=3"), Формат(СуммаПоСтрокамСТекКоэффициентом, "ЧДЦ=3"));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает данные номенклатуры для передачи в заполняемые документы.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - элемент справочника Номенклатура, для которого извлекаются данные.
// 
// Возвращаемое значение:
//  Структура - данные номенклатуры для использования в НоменклатураВДокументахКлиент.ПодготовитьДанныеЭлемента():
// * Номенклатура - СправочникСсылка.Номенклатура
// * Количество - Число
// * Цена - Число
// * СтавкаНДС - Неопределено, СправочникСсылка.СтавкиНДС - Ставка НДС
// * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - Характеристика
// * ПеречислениеСтавкаНДС - ПеречислениеСсылка.СтавкиНДС, Неопределено - Ставка НДС
Функция ДанныеНоменклатуры(Номенклатура) Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить("ТипНоменклатуры");
	Поля.Добавить("ЕдиницаИзмерения");
	Поля.Добавить("ЭтоНабор");
	Поля.Добавить("Поставщик");
	Поля.Добавить("СтранаПроисхождения");
	Поля.Добавить("Склад");
	Поля.Добавить("Ячейка");
	Поля.Добавить("Код");
	Поля.Добавить("Артикул");
	Поля.Добавить("ЕдиницаИзмерения");
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, Поля);
	
	Результат.Вставить("Номенклатура", Номенклатура);
	Результат.Вставить("Количество", 1);
	Результат.Вставить("Цена", 0);
	Результат.Вставить("СтавкаНДС", СтавкаНоменклатуры(Номенклатура));
	Результат.Вставить("Характеристика", ЗначенияНоменклатурыПоУмолчанию(Номенклатура));

	ИмяРеквизита = "ПеречислениеСтавкаНДС";
	ПеречислениеСтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.СтавкаНДС, ИмяРеквизита);
	
	Результат.Вставить("ПеречислениеСтавкаНДС", ПеречислениеСтавкаНДС);
	
	Возврат Результат;
	
КонецФункции

#Область РаботаСТабличнойЧастьюНоменклатуры

Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура,
		"ЕдиницаИзмерения, ТипНоменклатуры, СтранаПроисхождения, ВидСтавкиНДС, ФиксированнаяСтоимость, ТоварнаяНоменклатураВЭД,
		|ИспользоватьХарактеристики, ИспользоватьСерииНоменклатуры, Склад, Ячейка");
	
	СтруктураДанные.Вставить("БазоваяЕдиницаИзмерения", ДанныеНоменклатуры.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", ДанныеНоменклатуры.СтранаПроисхождения);
	СтруктураДанные.СтруктурнаяЕдиница = ?(Не ЗначениеЗаполнено(СтруктураДанные.СтруктурнаяЕдиница), ДанныеНоменклатуры.Склад, СтруктураДанные.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("Ячейка", ДанныеНоменклатуры.Ячейка);
	
	СтруктураДанные.Вставить("ЭтоУслуга",
		ДанныеНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	СтруктураДанные.Вставить("ЭтоЗапас",
		(ДанныеНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас")
		ИЛИ ДанныеНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат")));
	
	Если СтруктураДанные.Свойство("НормаВремени") Тогда
		СтруктураДанные.НормаВремени = ЦенообразованиеСервер.ПолучитьНормуВремениРаботы(СтруктураДанные);
	КонецЕсли;

	ПараметрыОпределенияНДС = ПараметрыОпределенияСтавкиНДС(СтруктураДанные);
	ПараметрыОпределенияНДС.НоменклатураВидСтавкиНДС = ДанныеНоменклатуры.ВидСтавкиНДС;
	ДанныеНДС = ДанныеНДССтрокиНоменклатуры(ПараметрыОпределенияНДС);
	СтруктураДанные.Вставить("СтавкаНДС", ДанныеНДС.СтавкаНДС);
	
	Если СтруктураДанные.Свойство("Характеристика") Тогда
		СтруктураДанные.Вставить("Спецификация", Справочники.Спецификации.СпецификацияПоУмолчанию(
			СтруктураДанные.Номенклатура, СтруктураДанные.Характеристика));
	Иначе
		СтруктураДанные.Вставить("Спецификация", Справочники.Спецификации.СпецификацияПоУмолчанию(
			СтруктураДанные.Номенклатура));
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		КонецЕсли;
		Если НЕ СтруктураДанные.Свойство("ВалютаДокумента") И ЗначениеЗаполнено(СтруктураДанные.ВидЦен) Тогда
			// для ЗаданиеНаРаботу - у которого нет реквизита ВалютыДокумента
			СтруктураДанные.Вставить("ВалютаДокумента", СтруктураДанные.ВидЦен.ВалютаЦены);
		КонецЕсли;
		
		Если СтруктураДанные.Свойство("ВидРабот") Тогда
			
			Если ДанныеНоменклатуры.ФиксированнаяСтоимость Тогда
				
				Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
				СтруктураДанные.Вставить("Цена", Цена);
				
			Иначе
				
				ТекНоменклатура = СтруктураДанные.Номенклатура;
				СтруктураДанные.Номенклатура = СтруктураДанные.ВидРабот;
				СтруктураДанные.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
				СтруктураДанные.Вставить("Цена", Цена);
				
				СтруктураДанные.Номенклатура = ТекНоменклатура;
				
			КонецЕсли;
			
		Иначе
			
			Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
			СтруктураДанные.Вставить("Цена", Цена);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидСкидкиНаценки")
		И ЗначениеЗаполнено(СтруктураДанные.ВидСкидкиНаценки) Тогда
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки.Процент);
	Иначе
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", 0);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ПроцентСкидкиПоДисконтнойКарте") 
		И ЗначениеЗаполнено(СтруктураДанные.ДисконтнаяКарта) Тогда
		ТекПроцент = СтруктураДанные.ПроцентСкидкиНаценки;
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", ТекПроцент
			+ СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("КодТНВЭД") Тогда
		СтруктураДанные.КодТНВЭД = ДанныеНоменклатуры.ТоварнаяНоменклатураВЭД;
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ХарактеристикиИспользуются") Тогда
		СтруктураДанные.ХарактеристикиИспользуются = 
			ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") 
			И ДанныеНоменклатуры.ИспользоватьХарактеристики;
	КонецЕсли;
		
	Если СтруктураДанные.Свойство("СтатусУказанияСерий") Тогда
		СтруктураДанные.СтатусУказанияСерий = 
			ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") 
			И ДанныеНоменклатуры.ИспользоватьСерииНоменклатуры;
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

#КонецОбласти

#КонецОбласти