

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Характеристика.Видимость = Запись.Номенклатура.ИспользоватьХарактеристики;
	Элементы.ХарактеристикаСопутствующегоТовара.Видимость = Запись.СопутствующийТовар.ИспользоватьХарактеристики;
	
	Если Параметры.Ключ.Пустой() И Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Номенклатура = Запись.СопутствующийТовар
		И Запись.Характеристика = Запись.ХарактеристикаСопутствующегоТовара Тогда
		СтрокаСообщения = НСтр("ru = 'Значения элементов групп ""Номенклатура"" и ""Сопутствующий товар"" не могут совпадать.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,,ЭтаФорма);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Элементы.Характеристика.Видимость = Запись.Номенклатура.ИспользоватьХарактеристики;
	Запись.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СопутствующийТоварПриИзмененииНаСервере()
	Элементы.ХарактеристикаСопутствующегоТовара.Видимость = Запись.СопутствующийТовар.ИспользоватьХарактеристики;
	Запись.ХарактеристикаСопутствующегоТовара = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
КонецПроцедуры

&НаКлиенте
Процедура СопутствующийТоварПриИзменении(Элемент)
	СопутствующийТоварПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти