
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкаПроцессов") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроцессы;
	КонецЕсли;
	
	Если Параметры.Свойство("Страница") 
		И НЕ ПустаяСтрока(Параметры.Страница) 
		И НЕ Элементы.Найти(Параметры.Страница)=Неопределено Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы[Параметры.Страница];
	КонецЕсли;
	
	ОпределитьИнтерфейсПриСоздании(Параметры);
	ОпределитьИнтерфейсДляМК();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.СостояниеВыполнения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Состояние выполнения"" не заполнено. Для заполнения перейдите на вкладку ""Процессы""'"));
		Отказ = Истина;
	КонецЕсли;
	
	ОбновитьСостояния();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ВидыЗаказНарядов", Объект.Ссылка, ЭтотОбъект);	
	ОбновитьПроцессы();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьДанныеПроцессов(ТекущийОбъект);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокСостояний.Ссылка КАК Ссылка,
	|	ПорядокСостояний.НомерСтроки КАК НомерСтроки,
	|	ПорядокСостояний.Состояние КАК Состояние,
	|	СостоянияЗаказНарядов.ПометкаУдаления КАК ПометкаУдаления,
	|	СостоянияЗаказНарядов.Наименование КАК Наименование,
	|	СостоянияЗаказНарядов.Цвет КАК Цвет,
	|	СостоянияЗаказНарядов.ЦветФона КАК ЦветФона,
	|	СостоянияЗаказНарядов.Предопределенный КАК Предопределенный,
	|	СостоянияЗаказНарядов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ПорядокСостояний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
	|		ПО ПорядокСостояний.Состояние = СостоянияЗаказНарядов.Ссылка
	|ГДЕ
	|	ПорядокСостояний.Ссылка = &ВидЗаказа";
	
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Состояние Из Результат Цикл
		СостояниеВТаблице = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние.Состояние));
		Для Каждого НайденноеСостояние Из СостояниеВТаблице Цикл
			Если Состояние.Цвет.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветТекста = Состояние.Цвет.Получить();
			КонецЕсли;
			Если Состояние.ЦветФона.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветФона = Состояние.ЦветФона.Получить();
			КонецЕсли;
			НайденноеСостояние.ПометкаУдаления = Состояние.ПометкаУдаления;
			НайденноеСостояние.НаименованиеСостояния = Состояние.Наименование;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СостояниеВыполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораСостоянияВыполнения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", ВыбранноеЗначение)).Количество() = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выбранного состояния нет среди используемых в виде заказ-наряда.'"),
			,
			"Объект.СостояниеВыполнения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораЦветаИзПорядкаСостоянийФрагмент(Цвет, СвойствоЦвета) Экспорт
	
	Если Цвет <> Неопределено И Цвет <> КодВозвратаДиалога.Отмена Тогда 
		
		ДанныеТекущейСтроки = Элементы.ПорядокСостояний.ТекущиеДанные; 
		
		Если ДанныеТекущейСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИндексСостояния = Объект.ПорядокСостояний.Индекс(ДанныеТекущейСтроки);
		ДанныеТекущейСтроки[СвойствоЦвета] = Цвет;
		ДанныеТекущейСтроки["Изменено"] = Истина;
		Модифицированность = Истина;
		ОбновитьЭлементыУсловногоОформления();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьИнтерфейсПрокруткиПроцессов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПорядокСостояний

&НаКлиенте
Процедура ПорядокСостоянийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьКоманд(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элемент.ТекущиеДанные.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен") И Копирование Тогда
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Состояние) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыделенныхСостояний = ДанныеВыделенныхСостояний();
	Для Каждого ДанныеСостояния Из ДанныеВыделенныхСостояний Цикл
		
		Если ДанныеСостояния.Состояние = Объект.СостояниеЗаявки Тогда
			ПредупреждениеОбИспользованииЗаявокДляСостояния(ДанныеСостояния.НаименованиеСостояния);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ОтветОтСервера = ПорядокСостоянийПередУдалениемНаСервере();
	Если ОтветОтСервера.ЕстьЗаявки Тогда
		ПредупреждениеОбИспользованииЗаявокДляСостояния(ОтветОтСервера.ПредставлениеСостояния);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ЗапрещеноИзменениеПорядка = Ложь;
	
	СтрокаПорядкаСостояний = Объект.ПорядокСостояний.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	Если СтрокаПорядкаСостояний <> Неопределено
		И СтрокаПорядкаСостояний.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен") Тогда
		
		ЗапрещеноИзменениеПорядка = Истина;
	КонецЕсли;
	
	Если Не ЗапрещеноИзменениеПорядка И Строка <> Неопределено Тогда
		СтрокаПорядкаСостояний = Объект.ПорядокСостояний.НайтиПоИдентификатору(Строка);
		Если СтрокаПорядкаСостояний <> Неопределено
			И СтрокаПорядкаСостояний.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен") Тогда
			
			ЗапрещеноИзменениеПорядка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗапрещеноИзменениеПорядка Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПослеУдаления(Элемент)
	
	ДобавитьСостояниеЗавершен();
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Состояние) Тогда
		ПараметрыПолученияДанных.Вставить("ТекущееНаименование", ТекущаяСтрока.НаименованиеСостояния);
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ОбъектПолученияДанных", "СостоянияЗаказНарядов"); 
	РаботаСВидамиЗаказовКлиент.СостояниеАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ОбработатьИзменениеСостоянияВТаблице(ВыбранноеЗначение, Элемент.ТекстРедактирования, СтандартнаяОбработка);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПорядокСостоянийСостояниеОчистка(Элемент, СтандартнаяОбработка)
	
	ОбработатьИзменениеСостоянияВТаблице("", "", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийЦветТекстаСостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РаботаСВидамиЗаказовКлиент.НачалоВыбораЦветаИзПорядкаСостояний(ЭтаФорма, "ЦветТекста", СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийЦветФонаСостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	 
	РаботаСВидамиЗаказовКлиент.НачалоВыбораЦветаИзПорядкаСостояний(ЭтаФорма, "ЦветФона", СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПорядокСостоянийПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ОтображатьСостоянияЗаявок");
	
	ОткрытьФорму("Справочник.СостоянияЗаказНарядов.Форма.ФормаСписка",ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеОткрытие(Элемент, СтандартнаяОбработка)
	ТекущееСостояние = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущееСостояние.Состояние) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекущееСостояние.Состояние);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		ТекущаяСтрокаСостояния = Элементы.ПорядокСостояний.ТекущиеДанные;
		ИндексТекущейСтроки = Объект.ПорядокСостояний.Индекс(ТекущаяСтрокаСостояния);
		
		Если ИндексТекущейСтроки = Объект.ПорядокСостояний.Количество() - 1 Тогда
			Объект.ПорядокСостояний.Сдвинуть(ИндексТекущейСтроки, -1);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСостоянийСостояниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.ПустаяСсылка") Тогда
		ТекущиеДанные.Изменено = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВсе(Команда)
	
	ДобавитьВсеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	ПереместитьСтрокуТЧ(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ПереместитьСтрокуТЧ(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеСостояние(Команда)

	РаботаСВидамиЗаказовКлиент.ПометитьНаУдалениеСостояние(ЭтаФорма);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнтерфейса

&НаСервере
Процедура ОбновитьИнтерфейсПрокруткиПроцессов()
	
	ВысотаГруппыПроцессов = 0;
	РастягиватьПоВертикали = Истина;
	ВертикальнаяПрокруткаПриСжатии = Ложь;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПорядокСостояний Тогда
		
		ВысотаГруппыПроцессов = 1;
		РастягиватьПоВертикали = Ложь;
		ВертикальнаяПрокруткаПриСжатии = Истина;
		
	КонецЕсли;
	
	Элементы.СтраницаДействия.Высота = ВысотаГруппыПроцессов;
	Элементы.СтраницаДействия.РастягиватьПоВертикали = РастягиватьПоВертикали;
	Элементы.СтраницаДействия.ВертикальнаяПрокруткаПриСжатии = ВертикальнаяПрокруткаПриСжатии;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИнтерфейсДляМК()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницаПроцессы.Видимость = Ложь;
	
	ТолькоПросмотрПорядкаСостояний = ЗначениеЗаполнено(Объект.СостояниеЗаявки);
	Если ТолькоПросмотрПорядкаСостояний Тогда
		
		Элементы.НадписьОграниченияРаботыВМК.Видимость = Истина;
		Элементы.ПорядокСостояний.ТолькоПросмотр = Истина;
		
		Элементы.ПорядокСостоянийДобавитьВсе.Доступность = Ложь;
		Элементы.КнопкиВверхВниз.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПорядокСостоянийПриИзмененииНаСервере()
	
	СдвинутьСостояниеЗавершен();
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаСервере
Процедура СдвинутьСостояниеЗавершен()
	
	СтрокиТЧ = Объект.ПорядокСостояний.НайтиСтроки(
	Новый Структура("Состояние", Справочники.СостоянияЗаказНарядов.Завершен));
	Если СтрокиТЧ.Количество() = 0 Тогда
		
		ДанныеСостояния = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Справочники.СостоянияЗаказНарядов.Завершен, "Представление,Цвет,ЦветФона");
		
		СтрокаТЧ = Объект.ПорядокСостояний.Добавить();
		СтрокаТЧ.Состояние = Справочники.СостоянияЗаказНарядов.Завершен;
		СтрокаТЧ.НаименованиеСостояния = ДанныеСостояния.Представление;
		СтрокаТЧ.ЦветТекста = ДанныеСостояния.Цвет;
		СтрокаТЧ.ЦветФона = ДанныеСостояния.ЦветФона;
		Возврат;
		
	КонецЕсли;
	
	ИндексСтроки = Объект.ПорядокСостояний.Индекс(СтрокиТЧ[0]);
	Объект.ПорядокСостояний.Сдвинуть(ИндексСтроки, Объект.ПорядокСостояний.Количество() - ИндексСтроки - 1);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	СохранитьГлобальныеНастройки();
	
	Элементы.ПорядокСостоянийКонтекстноеМенюПометитьНаУдаление.Видимость = РазрешеноИзменениеСостояния;
	Элементы.ПорядокСостоянийПометитьНаУдаление.Видимость = РазрешеноИзменениеСостояния;
	Элементы.ПорядокСостоянийСостояние.КнопкаВыбора = НесколькоВидовЗаказов;
	
	ИндексСозданныхЭлементов = 3;
	
	РаботаСВидамиЗаказов.ФормаЭлементаВидаЗаказаПриСозданииНаСервере(ЭтотОбъект);
	
	ЗаполнитьТаблицуПроцессов();
	ОбновитьЭлементыПроцессов();
	УстановитьФлагиПроцессов();
	
	УправлениеФормой();
	
	ОбновитьЭлементыУсловногоОформления();
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеСостоянияЗавершен(УсловноеОформление,
		ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен"),
		"Объект.ПорядокСостояний.Состояние",
		"ПорядокСостояний");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СтраницаПроцессы", 
		"Видимость", 
		ИспользоватьПроцессы И Не ЭтоМобильныйКлиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеОбИспользованииЗаявокДляСостояния(НаименованиеСостояния)
	
	РаботаСЗаявкамиКлиент.ПредупреждениеОбИспользованииЗаявокДляСостояния(НаименованиеСостояния, ЭтоМобильныйКлиент);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	НесколькоВидовЗаказов        = ИспользоватьВидыЗаказНарядов();
	ОтображатьЗадачиПроизводства = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство");
	ИспользоватьПроцессы         = ПолучитьФункциональнуюОпцию("ИспользоватьПроцессыСостояний");
	ОтображатьЗадачиПоставщиков    = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки");
	ОтображатьЗадачиCRM    = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM");
	ЗаявкиДоступны = РаботаСЗаявками.ЗаявкиДоступны();
	ТолькоПросмотрЗадач = НЕ Пользователи.ЭтоПолноправныйПользователь();
	
	РазрешеноИзменениеСостояния = ПравоДоступа("Изменение", Метаданные.Справочники.СостоянияЗаказНарядов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСостоянияВТаблице(ВыбранноеЗначение, ТекстРедактирования, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПорядокСостояний.ТекущиеДанные;
	ИндексСостояния = Объект.ПорядокСостояний.Индекс(ТекущиеДанные);
	
	Если Не Объект.Ссылка.Пустая() И ЗначениеЗаполнено(ТекущиеДанные.Состояние) Тогда
		
		Если ТекущиеДанные.Состояние = Объект.СостояниеЗаявки Тогда
			
			ПредупреждениеОбИспользованииЗаявокДляСостояния(ТекущиеДанные.НаименованиеСостояния);
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		НомерСостоянияЗаявки = НомерСостояния(Объект.ПорядокСостояний, Объект.СостояниеЗаявки);
		Если ИндексСостояния + 1 <= НомерСостоянияЗаявки Тогда
			
			ЕстьЗаявки = ЕстьЗаявкиВСостоянии(Объект.Ссылка, ТекущиеДанные.Состояние);
			Если ЕстьЗаявки Тогда
				
				ПредупреждениеОбИспользованииЗаявокДляСостояния(ТекущиеДанные.НаименованиеСостояния);
				СтандартнаяОбработка = Ложь;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьДанныеСостояния(ВыбранноеЗначение, ТекстРедактирования, ИндексСостояния, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Элементы.ПорядокСостояний.ЗакончитьРедактированиеСтроки(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЗаявкиВСостоянии(ВидЗаказа, Состояние)
	
	Возврат РаботаСЗаявками.ЕстьЗаказыВСостоянии(ВидЗаказа, Состояние, Истина);
	
КонецФункции

&НаСервере
Функция ПорядокСостоянийПередУдалениемНаСервере()
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьЗаявки", Ложь);
	Результат.Вставить("ПредставлениеСостояния", "");
	
	Состояния = Новый Массив;
	ДанныеВыделенныхСостояний = ДанныеВыделенныхСостоянийНаСервере();
	Для Каждого ДанныеСостояния Из ДанныеВыделенныхСостояний Цикл
		Состояния.Добавить(ДанныеСостояния.Состояние);
	КонецЦикла;
	
	НаличиеЗаявок = РаботаСЗаявками.НаличиеЗаказовПоСостояниям(Объект.Ссылка, Состояния, Истина);
	Для Каждого КлючЗначение Из НаличиеЗаявок Цикл
		Если КлючЗначение.Значение.ЕстьЗаказ Тогда
			Результат.ЕстьЗаявки = Истина;
			Результат.ПредставлениеСостояния = КлючЗначение.Значение.Представление;
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДанныеВыделенныхСостояний()
	
	Результат = Новый Массив;
	
	Для Каждого Идентификатор Из Элементы.ПорядокСостояний.ВыделенныеСтроки Цикл
		ДанныеСостояния = Объект.ПорядокСостояний.НайтиПоИдентификатору(Идентификатор);
		Результат.Добавить(ДанныеСостояния);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеВыделенныхСостоянийНаСервере()
	
	Результат = Новый Массив;
	
	Для Каждого Идентификатор Из Элементы.ПорядокСостояний.ВыделенныеСтроки Цикл
		ДанныеСостояния = Объект.ПорядокСостояний.НайтиПоИдентификатору(Идентификатор);
		Результат.Добавить(ДанныеСостояния);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ГруппаДействий_0_Действие_0.Видимость = ЗаявкиДоступны;
	
	Если Не ЗаявкиДоступны Тогда
		
		Элементы.ЗаголовокДействия_0РасширеннаяПодсказка.Заголовок =
		НСтр("ru = 'Заказ в состоянии выполнения отражает отгрузку всех товаров со склада, завершение работ, начисление зарплаты сотрудникам.
		|При этом на дату выполнения будут совершены все фактические движения: списание со склада, реализация товаров, начисление зарплаты.'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(Знач ИмяСобытия, Знач Параметр)
	
	Если ИмяСобытия = "Запись_СостоянияЗаказНарядов" Тогда
		
		ЭтоСостояниеДляЗаявок = ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ЭтоСостояниеДляЗаявок");
		
		Если ЭтоСостояниеДляЗаявок Тогда
			
			Объект.СостояниеЗаявки = Параметр.Ссылка;
			СтрокаТЗ = Объект.ПорядокСостояний.Вставить(0);
			СтрокаТЗ.Состояние = Объект.СостояниеЗаявки;
			
			Модифицированность = Ложь;
			Записать();
			
		КонецЕсли;
		
		ОбработатьЗаписьСостояния(Параметр);
		ОбновитьЭлементыУсловногоОформления();
		
		Если ЭтоСостояниеДляЗаявок Тогда
			ОбновитьПроцессы();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьСостояния(ПараметрЗаписи)
	
	Если ТипЗнч(ПараметрЗаписи) = Тип("Структура") И Не ПараметрЗаписи.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	
	Состояние = ПараметрЗаписи.Ссылка;
	ДанныеСостояния = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Состояние, "Ссылка, Наименование, ПометкаУдаления, Цвет, ЦветФона");
	
	Если ДанныеСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСостояния = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", ДанныеСостояния.Ссылка));
	Для Каждого НайденноеСостояние Из НайденныеСостояния Цикл
		НайденноеСостояние.Состояние = ДанныеСостояния.Ссылка;
		НайденноеСостояние.ПометкаУдаления = ДанныеСостояния.ПометкаУдаления;
		Если ДанныеСостояния.Цвет <> Неопределено Тогда
			НайденноеСостояние.ЦветТекста = ДанныеСостояния.Цвет.Получить();
		КонецЕсли;
		Если ДанныеСостояния.ЦветФона <> Неопределено Тогда
			НайденноеСостояние.ЦветФона = ДанныеСостояния.ЦветФона.Получить();
		КонецЕсли;
		
		НайденноеСостояние.НаименованиеСостояния = ДанныеСостояния.Наименование;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСостояниеЗавершен()
	Если Объект.ПорядокСостояний.Количество() = 0 Тогда
		НоваяСтрока = Объект.ПорядокСостояний.Добавить();
		ОбновитьДанныеСостояния(Справочники.СостоянияЗаказНарядов.Завершен, "", 0, Ложь);
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ДобавитьВсеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказНарядов.Ссылка КАК Состояние,
		|	СостоянияЗаказНарядов.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА СостоянияЗаказНарядов.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказНарядов.Завершен)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Порядок,
		|	СостоянияЗаказНарядов.Цвет КАК ЦветТекста,
		|	СостоянияЗаказНарядов.ЦветФона КАК ЦветФона
		|ИЗ
		|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
		|ГДЕ
		|	СостоянияЗаказНарядов.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	СостоянияЗаказНарядов.Наименование";
	
	Состояния = Запрос.Выполнить().Выгрузить();
	
	ИндексСостояния = 0;
	Для Каждого ДанныеСостояния Из Состояния Цикл
		
		СостояниеУжеВТаблице = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", ДанныеСостояния.Состояние));
		Если СостояниеУжеВТаблице.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеСостояние = Объект.ПорядокСостояний.Вставить(ИндексСостояния);
		ИндексСостояния = ИндексСостояния + 1;
		НовоеСостояние.Состояние = ДанныеСостояния.Состояние;
		НовоеСостояние.НаименованиеСостояния = ДанныеСостояния.Наименование;
		НовоеСостояние.ЦветТекста = ДанныеСостояния.ЦветТекста.Получить(); 
		НовоеСостояние.ЦветФона   = ДанныеСостояния.ЦветФона.Получить(); 
		
	КонецЦикла;	
	
	ОбновитьЭлементыУсловногоОформления();
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьСтрокуТЧ(Смещение)
	
	Если Элементы.ПорядокСостояний.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПорядка = Объект.ПорядокСостояний.НайтиПоИдентификатору(Элементы.ПорядокСостояний.ТекущаяСтрока);
	Если СтрокаПорядка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаПорядка.НомерСтроки + Смещение = 0
		Или СтрокаПорядка.НомерСтроки + Смещение > Объект.ПорядокСостояний.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Смещение > 0
		И Объект.ПорядокСостояний[СтрокаПорядка.НомерСтроки+Смещение-1].Состояние = 
		ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен")Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПорядокСостояний.Сдвинуть(СтрокаПорядка.НомерСтроки-1, Смещение);
	УстановитьДоступностьКоманд();
	ОбновитьПроцессы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКоманд()
	
	Данные = Элементы.ПорядокСостояний.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПоследнееСостояние = Объект.ПорядокСостояний.Индекс(Данные) = Объект.ПорядокСостояний.Количество() - 1;
	УстановитьДоступностьКомандНаСервере(Данные.Состояние,ЭтоПоследнееСостояние, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораСостоянияВыполнения(Форма)
	
	Форма.Элементы.СостояниеВыполнения.СписокВыбора.Очистить();
	Для Каждого СтрокаСостояния Из Форма.Объект.ПорядокСостояний Цикл
		Форма.Элементы.СостояниеВыполнения.СписокВыбора.Добавить(СтрокаСостояния.Состояние);
	КонецЦикла;
	
КонецПроцедуры

#Область УправлениеЭлементамиПроцессов

&НаСервере
Процедура УстановитьОформлениеДекорацииЗаголовка(Декорация, ЭталонныйЭлемент, Заголовок)
	
	Декорация.Вид = ЭталонныйЭлемент.Вид;
	Декорация.ГоризонтальноеПоложение = ЭталонныйЭлемент.ГоризонтальноеПоложение;
	Декорация.ГоризонтальноеПоложениеВГруппе = ЭталонныйЭлемент.ГоризонтальноеПоложениеВГруппе;
	Декорация.Заголовок = Заголовок;
	Декорация.Ширина = ЭталонныйЭлемент.Ширина;
	Декорация.Видимость = ЭталонныйЭлемент.Видимость;
	Декорация.РастягиватьПоГоризонтали = ЭталонныйЭлемент.РастягиватьПоГоризонтали;
	Декорация.Высота = ЭталонныйЭлемент.Высота;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыПроцессов()

	Если НЕ ИспользоватьПроцессы Тогда
		Возврат;
	КонецЕсли;

	Если Объект.ПорядокСостояний.Количество() = 0 Тогда
		Элементы.ГруппаЗаголовкиСостояний.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЗаголовкиСостояний.Видимость = Истина;
	КонецЕсли;
	
	УдалитьПодчиненныеЭлементы();
	ЗаполнитьЗаголовкиСостояний();
	
	ГруппыПроцессов = Процессы.НайтиСтроки(Новый Структура("ЭтоГруппа", Истина));
	
	Для Каждого Группа Из ГруппыПроцессов Цикл
		
		ИндексГруппы = Группа.ИндексГруппы;
		Если ИндексГруппы < ИндексСозданныхЭлементов Тогда
			ГруппаЗаголовка = Элементы["ГруппаДействий_"+ИндексГруппы];
			ГруппаОтступа = Элементы["ОтступыГруппыДействий_"+ИндексГруппы];
		Иначе
			ГруппаЗаголовка = Элементы.Добавить("ГруппаДействий_" + ИндексГруппы, Тип("ГруппаФормы"), Элементы.ДействияПоЗаказу);
			УстановитьОформлениеГруппы(ГруппаЗаголовка, Элементы.ГруппаДействий_0);
			
			ДекорацияНадпись = Элементы.Добавить("ЗаголовокДействия_" + ИндексГруппы, Тип("ДекорацияФормы"), ГруппаЗаголовка);
			УстановитьОформлениеДекорацииЗаголовка(ДекорацияНадпись, Элементы.ЗаголовокДействия_0, Группа.Наименование);
			ДекорацияНадпись.Подсказка = Группа.ПодсказкаГруппы;
			ДекорацияНадпись.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
			
			ГруппаОтступа = Элементы.Добавить("ОтступыГруппыДействий_" + ИндексГруппы, Тип("ГруппаФормы"), ГруппаЗаголовка);
			УстановитьОформлениеГруппы(ГруппаОтступа, Элементы.ОтступыГруппыДействий_0);
		КонецЕсли;

		ИндексСостояния = 0;
		ОбработанныеСостояния = Новый Массив;
		
		Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
			
			Если ОбработанныеСостояния.Найти(Состояние.Состояние) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИндексСостояния = Объект.ПорядокСостояний.Индекс(Состояние);
			ДекорацияНадпись = Элементы.Добавить("ГруппаДействия_"+ ИндексГруппы + "_Состояние_"+ИндексСостояния, Тип("ДекорацияФормы"), ГруппаОтступа);
			УстановитьОформлениеДекорацииЗаголовка(ДекорацияНадпись, 
				Элементы.ГруппаДействия_0_Состояние_ЗавершенУспешно, 
				Элементы.ГруппаДействия_0_Состояние_ЗавершенУспешно.Заголовок);
				
			ОбработанныеСостояния.Добавить(Состояние.Состояние);
		КонецЦикла;
		
		ДействияГруппы = Процессы.НайтиСтроки(Новый Структура("КлючГруппы", Группа.Ключ));
		
		Для Каждого Действия Из ДействияГруппы Цикл
			
			ИндексДействия = Действия.ИндексДействия;
			
			Если ИндексГруппы < ИндексСозданныхЭлементов Тогда
				
				ГруппаЗаголовка = Элементы["ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия];
				ГруппаОтступа = Элементы["ФлагиГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия];
				
			Иначе
				ГруппаЗаголовка = Элементы.Добавить("ГруппаДействий_" + ИндексГруппы + "_Действие_" + ИндексДействия, Тип("ГруппаФормы"), Элементы.ДействияПоЗаказу);
				УстановитьОформлениеГруппы(ГруппаЗаголовка, Элементы.ГруппаДействий_0_Действие_0);
				
				ДекорацияНадпись = Элементы.Добавить("ГруппаДействий_" + ИндексГруппы + "_Действие_"+ИндексДействия+"_Заголовок", Тип("ДекорацияФормы"), ГруппаЗаголовка);
				ДекорацияНадпись.Вид = Элементы.ГруппаДействий_0_Действие_0_Заголовок.Вид;
				ДекорацияНадпись.ГоризонтальноеПоложение = Элементы.ГруппаДействий_0_Действие_0_Заголовок.ГоризонтальноеПоложение;
				ДекорацияНадпись.ГоризонтальноеПоложениеВГруппе = Элементы.ГруппаДействий_0_Действие_0_Заголовок.ГоризонтальноеПоложениеВГруппе;
				ДекорацияНадпись.Заголовок = Действия.Наименование;
				ДекорацияНадпись.Ширина = Элементы.ГруппаДействий_0_Действие_0_Заголовок.Ширина;
				ДекорацияНадпись.Видимость = Элементы.ГруппаДействий_0_Действие_0_Заголовок.Видимость;
				ДекорацияНадпись.РастягиватьПоГоризонтали = Элементы.ГруппаДействий_0_Действие_0_Заголовок.РастягиватьПоГоризонтали;
				ДекорацияНадпись.Гиперссылка = Действия.ЭтоЗадачаАссистента;
				ДекорацияНадпись.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
				Если Действия.ЭтоЗадачаАссистента Тогда
					ДекорацияНадпись.УстановитьДействие("Нажатие", "Подключаемый_ОткрытьФормуЗадачи");
				КонецЕсли;
				
				ГруппаОтступа = Элементы.Добавить("ФлагиГруппыДействий_" + ИндексГруппы + "_Действие_"+ ИндексДействия, Тип("ГруппаФормы"), ГруппаЗаголовка);
				УстановитьОформлениеГруппы(ГруппаОтступа, Элементы.ФлагиГруппаДействий_0_Действие_0);
			КонецЕсли;
	
			ИндексСостояния = 0;
			ОбработанныеСостояния = Новый Массив;
			
			Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
				
				Если ОбработанныеСостояния.Найти(Состояние.Состояние) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ИндексСостояния = Объект.ПорядокСостояний.Индекс(Состояние);
				Если Состояние.Состояние = Справочники.СостоянияЗаказНарядов.Завершен Тогда
					
					Если ИндексГруппы < ИндексСозданныхЭлементов Тогда
						
						ДекорацияНадпись = Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенУспешно"];
						ДекорацияНадпись.Картинка = Элементы.ДекорацияНетКартинки.Картинка;
						ДекорацияНадпись.Гиперссылка = НЕ ТолькоПросмотрЗадач И НЕ Действия.ЭтоЗадачаАссистента;
						Если ДекорацияНадпись.Гиперссылка Тогда
							ДекорацияНадпись.УстановитьДействие("Нажатие", Действия.ОбработкаНажатия);
						КонецЕсли; 
						
						ДекорацияНадпись = Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенОтменен"];
						ДекорацияНадпись.Картинка = Элементы.ДекорацияНетКартинки.Картинка;
						ДекорацияНадпись.Гиперссылка = НЕ ТолькоПросмотрЗадач И НЕ Действия.ЭтоЗадачаАссистента;
						Если ДекорацияНадпись.Гиперссылка Тогда
							ДекорацияНадпись.УстановитьДействие("Нажатие", Действия.ОбработкаНажатия);
						КонецЕсли;
						
						ОбработанныеСостояния.Добавить(Состояние.Состояние);
						Продолжить;
					КонецЕсли;
					
					ДекорацияНадпись = Элементы.Добавить("Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенУспешно", Тип("ДекорацияФормы"), ГруппаОтступа);
					ДекорацияНадпись.Вид = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Вид;
					ДекорацияНадпись.Картинка = Элементы.ДекорацияНетКартинки.Картинка;
					ДекорацияНадпись.Гиперссылка = НЕ ТолькоПросмотрЗадач И НЕ Действия.ЭтоЗадачаАссистента;
					ДекорацияНадпись.ГоризонтальноеПоложениеВГруппе = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.ГоризонтальноеПоложениеВГруппе;
					ДекорацияНадпись.Заголовок = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Заголовок;
					ДекорацияНадпись.Ширина = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Ширина;
					ДекорацияНадпись.Видимость = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Видимость;
					ДекорацияНадпись.РастягиватьПоГоризонтали = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.РастягиватьПоГоризонтали;
					ДекорацияНадпись.Высота = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Высота;
					Если ДекорацияНадпись.Гиперссылка Тогда
						ДекорацияНадпись.УстановитьДействие("Нажатие", Действия.ОбработкаНажатия);
					КонецЕсли;
					
					ДекорацияНадпись = Элементы.Добавить("Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенОтменен", Тип("ДекорацияФормы"), ГруппаОтступа);
					ДекорацияНадпись.Вид = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Вид;
					ДекорацияНадпись.Картинка = Элементы.ДекорацияНетКартинки.Картинка;
					ДекорацияНадпись.Гиперссылка =  НЕ ТолькоПросмотрЗадач И НЕ Действия.ЭтоЗадачаАссистента;
					ДекорацияНадпись.ГоризонтальноеПоложениеВГруппе = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.ГоризонтальноеПоложениеВГруппе;
					ДекорацияНадпись.Заголовок = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Заголовок;
					ДекорацияНадпись.Ширина = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Ширина;
					ДекорацияНадпись.Видимость = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Видимость;
					ДекорацияНадпись.РастягиватьПоГоризонтали = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.РастягиватьПоГоризонтали;
					ДекорацияНадпись.Высота = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Высота;
					Если ДекорацияНадпись.Гиперссылка Тогда
						ДекорацияНадпись.УстановитьДействие("Нажатие", Действия.ОбработкаНажатия);
					КонецЕсли;
					ОбработанныеСостояния.Добавить(Состояние.Состояние);
					Продолжить;
					
				КонецЕсли;
				
				ДекорацияНадпись = Элементы.Добавить("Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_Состояние_"+ ИндексСостояния, Тип("ДекорацияФормы"), ГруппаОтступа);
				ДекорацияНадпись.Вид = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Вид;
				ДекорацияНадпись.Картинка = Элементы.ДекорацияНетКартинки.Картинка;
				ДекорацияНадпись.Гиперссылка = НЕ ТолькоПросмотрЗадач И НЕ Действия.ЭтоЗадачаАссистента;
				ДекорацияНадпись.ГоризонтальноеПоложениеВГруппе = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.ГоризонтальноеПоложениеВГруппе;
				ДекорацияНадпись.Заголовок = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Заголовок;
				ДекорацияНадпись.Ширина = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Ширина;
				ДекорацияНадпись.Видимость = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Видимость;
				ДекорацияНадпись.РастягиватьПоГоризонтали = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.РастягиватьПоГоризонтали;
				ДекорацияНадпись.Высота = Элементы.Флаг_ГруппаДействий_0_Действие_0_СостояниеЗавершенУспешно.Высота;
				Если ДекорацияНадпись.Гиперссылка Тогда
					ДекорацияНадпись.УстановитьДействие("Нажатие", Действия.ОбработкаНажатия);
				КонецЕсли;
				
				ОбработанныеСостояния.Добавить(Состояние.Состояние);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПереместитьЭлементыЗавершения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиСостояний()
	
	ИндексСостояния = 0;
	ШиринаСостояния = 19;
	ЦветЗавершенногоСостояния = Неопределено;
	ГруппаСостояний = Элементы.ГруппаЗаголовкиСостояний;
	
	НеобходимыеСостояния = Новый Массив;
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		
		Если Состояние.Состояние = Неопределено
			Или ТипЗнч(Состояние.Состояние) = Тип("Строка")
			Или Состояние.Состояние = Справочники.СостоянияЗаказНарядов.Завершен Тогда
			Продолжить;
		КонецЕсли;
		
		НеобходимыеСостояния.Добавить(Состояние.Состояние);
		
	КонецЦикла;
	
	ПредставленияСостояний = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НеобходимыеСостояния, "Представление");
	
	ОбработанныеСостояния = Новый Массив;
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		
		Если Состояние.Состояние = Неопределено 
			ИЛИ ОбработанныеСостояния.Найти(Состояние.Состояние) <> Неопределено
			ИЛИ ТипЗнч(Состояние.Состояние) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Состояние.Состояние = Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ЦветЗавершенногоСостояния = Состояние.Состояние.Цвет.Получить();
			ОбработанныеСостояния.Добавить(Состояние.Состояние);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Состояние.Состояние) Тогда
			НаименованиеСостояния = ПредставленияСостояний[Состояние.Состояние];
		Иначе
			НаименованиеСостояния = Состояние.НаименованиеСостояния;
		КонецЕсли;
		
		ГруппаЗаголовка = Элементы.Добавить("Состояние_" + ИндексСостояния, Тип("ГруппаФормы"), ГруппаСостояний);
		УстановитьОформлениеГруппы(ГруппаЗаголовка, Элементы.Состояние_ЗавершенУспешно);
		
		ДекорацияНадпись = Элементы.Добавить("ЗаголовокСостояние_" + ИндексСостояния, Тип("ДекорацияФормы"), ГруппаЗаголовка);
		ДекорацияНадпись.Вид = Элементы.ЗаголовокСостояние_ЗавершенУспешно.Вид;
		ДекорацияНадпись.ГоризонтальноеПоложение = Элементы.ЗаголовокСостояние_ЗавершенУспешно.ГоризонтальноеПоложение;
		ДекорацияНадпись.ГоризонтальноеПоложениеВГруппе = Элементы.ЗаголовокСостояние_ЗавершенУспешно.ГоризонтальноеПоложениеВГруппе;
		ДекорацияНадпись.Заголовок = НаименованиеСостояния;
		ДекорацияНадпись.Ширина = ШиринаСостояния;
		ДекорацияНадпись.Видимость = Элементы.ЗаголовокСостояние_ЗавершенУспешно.Видимость;
		ДекорацияНадпись.РастягиватьПоГоризонтали = Элементы.ЗаголовокСостояние_ЗавершенУспешно.РастягиватьПоГоризонтали;
		
		ДекорацияНадпись = Элементы.Добавить("ЛинияСостояние_" + ИндексСостояния, Тип("ДекорацияФормы"), ГруппаЗаголовка);
		ДекорацияНадпись.Вид = Элементы.ЛинияСостояние_ЗавершенУспешно.Вид;
		ДекорацияНадпись.Заголовок = Элементы.ЛинияСостояние_ЗавершенУспешно.Заголовок;
		ДекорацияНадпись.Ширина = ШиринаСостояния;
		ДекорацияНадпись.Видимость = Элементы.ЛинияСостояние_ЗавершенУспешно.Видимость;
		ДекорацияНадпись.РастягиватьПоГоризонтали = Элементы.ЛинияСостояние_ЗавершенУспешно.РастягиватьПоГоризонтали;
		ДекорацияНадпись.ГоризонтальноеПоложение = Элементы.ЛинияСостояние_ЗавершенУспешно.ГоризонтальноеПоложение;
		ДекорацияНадпись.ГоризонтальноеПоложениеВГруппе = Элементы.ЛинияСостояние_ЗавершенУспешно.ГоризонтальноеПоложениеВГруппе;
		ЦветСостояния = Состояние.Состояние.Цвет.Получить();
		
		Если ЦветСостояния <> Неопределено Тогда
			ДекорацияНадпись.ЦветТекста = ЦветСостояния;
		КонецЕсли;
		
		ИндексСостояния = ИндексСостояния + 1; 
		ОбработанныеСостояния.Добавить(Состояние.Состояние);
		
	КонецЦикла;

	Элементы.Переместить(Элементы.Состояние_ЗавершенУспешно, Элементы.ГруппаЗаголовкиСостояний);
	Элементы.Переместить(Элементы.Состояние_ЗавершенОтменен, Элементы.ГруппаЗаголовкиСостояний);
	
	Если ЦветЗавершенногоСостояния <> Неопределено Тогда
		Элементы.ЛинияСостояние_ЗавершенУспешно.ЦветТекста = ЦветЗавершенногоСостояния;
		Элементы.ЛинияСостояние_ЗавершенОтменен.ЦветТекста = ЦветЗавершенногоСостояния;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеГруппы(ДобавляемаяГруппа, ГруппаФормы)
	
	ДобавляемаяГруппа.Вид = ГруппаФормы.Вид;
	ДобавляемаяГруппа.Отображение = ГруппаФормы.Отображение;
	ДобавляемаяГруппа.Группировка = ГруппаФормы.Группировка;
	ДобавляемаяГруппа.ОтображатьЗаголовок = ГруппаФормы.ОтображатьЗаголовок;
	ДобавляемаяГруппа.ЦветФона = ГруппаФормы.ЦветФона;
	ДобавляемаяГруппа.СквозноеВыравнивание = ГруппаФормы.СквозноеВыравнивание;
	ДобавляемаяГруппа.Объединенная = ГруппаФормы.Объединенная;
	ДобавляемаяГруппа.Ширина = ГруппаФормы.Ширина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПроцессов()
		
	Процессы.Очистить();
	
	Если НЕ ИспользоватьПроцессы Тогда
		Возврат;
	КонецЕсли;
	
	КлючГруппыРежимЗаказа = "РежимЗаказа";
	
	НоваяГруппа = Процессы.Добавить();
	НоваяГруппа.ЭтоГруппа = Истина;
	НоваяГруппа.ИндексГруппы = 0;
	НоваяГруппа.Ключ = КлючГруппыРежимЗаказа;
	НоваяГруппа.Наименование = НСтр("ru = 'Режим заказа'");
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы = 0;
	НовоеДействие.ИндексДействия = 0;
	НовоеДействие.Ключ = "НастройкаСостояниеЗаявки";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.НаФорме;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
	НовоеДействие.Наименование = НСтр("ru = 'Состояние заявки'");
	НовоеДействие.КлючГруппы = КлючГруппыРежимЗаказа;
	НовоеДействие.ОбработкаНажатия = "Подключаемый_НажатиеФлагСостояниеЗаявки";
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы = 0;
	НовоеДействие.ИндексДействия = 1;
	НовоеДействие.Ключ = "НастройкаСостояниеВыполнения";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.НаФорме;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
	НовоеДействие.Наименование = НСтр("ru = 'Состояние выполнения'");
	НовоеДействие.КлючГруппы = КлючГруппыРежимЗаказа;
	НовоеДействие.ОбработкаНажатия = "Подключаемый_НажатиеФлагСостояниеВыполнения";
	
	НоваяГруппа = Процессы.Добавить();
	НоваяГруппа.ЭтоГруппа = Истина;
	НоваяГруппа.ИндексГруппы	  = 1;
	НоваяГруппа.Ключ	  = "КорректировкаЗаказа";
	НоваяГруппа.Наименование = НСтр("ru = 'Корректировка заказа'");
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы	  = 1;
	НовоеДействие.ИндексДействия	  = 0;
	НовоеДействие.Ключ	  = "ОбязательноеЗаполнениеПричиныОтмены";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.НаФорме;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
	НовоеДействие.Наименование = НСтр("ru = 'Обязательно заполнять поле ""Причина отмены товара""'");
	НовоеДействие.КлючГруппы   = "КорректировкаЗаказа";
	НовоеДействие.ОбработкаНажатия = "Подключаемый_НажатиеФлагОбязательноЗаполнение";
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы	  = 1;
	НовоеДействие.ИндексДействия = 1;
	НовоеДействие.Ключ	  = "Предупреждать о неотгруженных товарах";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.НаФорме;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ТолькоВПоследнемСостоянии;
	НовоеДействие.Наименование = НСтр("ru = 'Предпреждать о неотгруженных товарах при завершении заказа'");
	НовоеДействие.КлючГруппы   = "КорректировкаЗаказа";	
	НовоеДействие.ОбработкаНажатия = "Подключаемый_НажатиеЗапрещатьЗавершениеНеотгруженныхЗаказов";
	
	НоваяГруппа = Процессы.Добавить();
	НоваяГруппа.ЭтоГруппа = Истина;
	НоваяГруппа.ИндексГруппы = 2;
	НоваяГруппа.Ключ	  = "ОбщиеНастройки";
	НоваяГруппа.Наименование = НСтр("ru = 'Общие настройки (для всех видов)'");
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы	  = 2;
	НовоеДействие.ИндексДействия = 0;
	НовоеДействие.Ключ	  = "ЗапрещатьИзмененияПрошлыхПериодов";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.НаФорме;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
	НовоеДействие.Наименование = НСтр("ru = 'Запрещать изменения прошлых периодов'");
	НовоеДействие.КлючГруппы   = "ОбщиеНастройки";
	НовоеДействие.ОбработкаНажатия = "Подключаемый_НажатиеЗапрещатьИзменениеПрошлыхПериодов";
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы	  = 2;
	НовоеДействие.ИндексДействия = 1;
	НовоеДействие.Ключ	  = "Версионирование";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.НаФорме;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ТолькоВПервомСостоянии;
	НовоеДействие.Наименование = НСтр("ru = 'Хранить историю изменений (заказ покупателя, заказ-наряд)'");
	НовоеДействие.КлючГруппы   = "ОбщиеНастройки";
	НовоеДействие.ОбработкаНажатия = "Подключаемый_НажатиеХранитьИсториюИзменений";
		
	НоваяГруппа = Процессы.Добавить();
	НоваяГруппа.ЭтоГруппа = Истина;
	НоваяГруппа.ИндексГруппы	  = 3;
	НоваяГруппа.Ключ	  = "ОтправитьОповещение";
	НоваяГруппа.Наименование = НСтр("ru = 'Даша, отправь оповещение'");
	НоваяГруппа.ПодсказкаГруппы = 
	НСтр("ru = 'В программе реализован «Ассистент управления нашей фирмой» – Даша. 
	|Даша, как и обычный сотрудник, выполняет поручения в 1С:УНФ. 
	|Например, обрабатывает заказы при получении оплаты или отгрузке.
	|
	|При изменении состояния заказа Даша может оповестить клиента, менджера. '");
	
	Если ОтображатьЗадачиCRM Тогда
		НовоеДействие = Процессы.Добавить();
		НовоеДействие.ИндексГруппы	  = 3;
		НовоеДействие.ИндексДействия = 0;
		НовоеДействие.Ключ	  = "ОповещениеКлиентаОбИзмененииСостоянияЗаказа";
		НовоеДействие.КлючГруппы   = "ОтправитьОповещение";
		НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
		НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
		НовоеДействие.Наименование = НСтр("ru = 'Оповести клиента'");
		НовоеДействие.ЭтоЗадачаАссистента   = Истина;
		НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ОповещениеКлиентаОбИзмененииСостоянияЗаказа";
		НовоеДействие.ИдентификаторГруппыАссистента   = "ОповещениеКлиентаОбИзмененииСостоянияЗаказа";
	КонецЕсли;
	
	НовоеДействие = Процессы.Добавить();
	НовоеДействие.ИндексГруппы	  = 3;
	НовоеДействие.ИндексДействия = 1;
	НовоеДействие.Ключ	  = "ОповеститьСотрудника";
	НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
	НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
	НовоеДействие.Наименование = НСтр("ru = 'Оповести сотрудника'");
	НовоеДействие.КлючГруппы   = "ОтправитьОповещение";
	НовоеДействие.ЭтоЗадачаАссистента   = Истина;
	НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииСостоянияЗП";
	НовоеДействие.ИдентификаторГруппыАссистента   = "ОповещениеПользователяОбИзмененииСостоянияЗаказаПокупателя";
	
	Если ОтображатьЗадачиПроизводства ИЛИ ОтображатьЗадачиПоставщиков Тогда
		НоваяГруппа = Процессы.Добавить();
		НоваяГруппа.ЭтоГруппа = Истина;
		НоваяГруппа.ИндексГруппы = 4;
		НоваяГруппа.Ключ	  = "СвязанныеЗаказы";
		НоваяГруппа.Наименование = НСтр("ru = 'Даша, измени состояние связанных заказов'");
		НоваяГруппа.ПодсказкаГруппы = 
		НСтр("ru = 'В программе реализован «Ассистент управления нашей фирмой» – Даша (CRM - Сервис - Ассистент управления нашей фирмой). 
		|Даша, как и обычный сотрудник, выполняет поручения в 1С:УНФ. 
		|Например, обрабатывает заказы при получении оплаты или отгрузке.
		|
		|При изменении состояния заказа Даша может изменить состояние связанных заказов. '");
		
		Если ОтображатьЗадачиПоставщиков Тогда
			НовоеДействие = Процессы.Добавить();
			НовоеДействие.ИндексГруппы	  = 4;
			НовоеДействие.ИндексДействия = 0;
			НовоеДействие.Ключ	  = "ИзменитьЗаказПоставщику";
			НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
			НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
			НовоеДействие.Наименование = НСтр("ru = 'Измени состояние заказа поставщику'");
			НовоеДействие.КлючГруппы   = "СвязанныеЗаказы";
			НовоеДействие.ЭтоЗадачаАссистента   = Истина;
			НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов";
			НовоеДействие.ИдентификаторГруппыАссистента   = "ИзменениеСостоянияЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
		КонецЕсли;	
		
		Если ОтображатьЗадачиПроизводства Тогда
			НовоеДействие = Процессы.Добавить();
			НовоеДействие.ИндексГруппы	  = 4;
			НовоеДействие.ИндексДействия = 1;
			НовоеДействие.Ключ	  = "ИзменитьЗаказНаПроизводство";
			НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
			НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
			НовоеДействие.Наименование = НСтр("ru = 'Изменени состояние заказа на производство'");
			НовоеДействие.КлючГруппы   = "СвязанныеЗаказы";
			НовоеДействие.ЭтоЗадачаАссистента   = Истина;
			НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПоСостояниюСвязанныхЗаказов";
			НовоеДействие.ИдентификаторГруппыАссистента   = "ИзменениеСостоянияЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей";
		КонецЕсли;
	КонецЕсли;
	
	Если ОтображатьЗадачиCRM Тогда
		НоваяГруппа = Процессы.Добавить();
		НоваяГруппа.ЭтоГруппа = Истина;
		НоваяГруппа.ИндексГруппы	  = 5;
		НоваяГруппа.Ключ	  = "ПереводЗаказаВСостояние";
		НоваяГруппа.Наименование = НСтр("ru = 'Даша, переведи заказ в состояние'");
		НоваяГруппа.ПодсказкаГруппы = 
		НСтр("ru = 'В программе реализован «Ассистент управления нашей фирмой» – Даша (CRM - Сервис - Ассистент управления нашей фирмой). 
		|Даша, как и обычный сотрудник, выполняет поручения в 1С:УНФ. 
		|Например, обрабатывает заказы при получении оплаты или отгрузке.
		|
		|При выполнении определенных действий в программе Даша может перевести заказ в указанное состояние. '");
		
		НовоеДействие = Процессы.Добавить();
		НовоеДействие.ИндексГруппы	  = 5;
		НовоеДействие.ИндексДействия = 0;
		НовоеДействие.Ключ	  = "ИзменениеСтатусаОплаты";
		НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
		НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
		НовоеДействие.Наименование = НСтр("ru = 'При изменении статуса оплаты'");
		НовоеДействие.КлючГруппы   = "ПереводЗаказаВСостояние";
		НовоеДействие.ЭтоЗадачаАссистента   = Истина;
		НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплате";
		НовоеДействие.ИдентификаторГруппыАссистента   = "ИзменениеСостоянияЗаказаПриОплате";
		
		
		НовоеДействие = Процессы.Добавить();
		НовоеДействие.ИндексГруппы	  = 5;
		НовоеДействие.ИндексДействия = 1;
		НовоеДействие.Ключ	  = "ИзменениеСостоянияЗаказаПоставщику";
		НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
		НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
		НовоеДействие.Наименование = НСтр("ru = 'При изменении состояния заказа поставщику'");
		НовоеДействие.КлючГруппы   = "ПереводЗаказаВСостояние";
		НовоеДействие.ЭтоЗадачаАссистента   = Истина;
		НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
		НовоеДействие.ИдентификаторГруппыАссистента   = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикам";
		
		Если ОтображатьЗадачиПроизводства Тогда
			НовоеДействие = Процессы.Добавить();
			НовоеДействие.ИндексГруппы	  = 5;
			НовоеДействие.ИндексДействия = 2;
			НовоеДействие.Ключ	  = "ИзменениеСостоянияЗаказаНаПроизводство";
			НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
			НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
			НовоеДействие.Наименование = НСтр("ru = 'При изменении состояния заказа на производство'");
			НовоеДействие.КлючГруппы   = "ПереводЗаказаВСостояние";
			НовоеДействие.ЭтоЗадачаАссистента   = Истина;
			НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
			НовоеДействие.ИдентификаторГруппыАссистента   = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовНаПроизводство";
			
			НовоеДействие = Процессы.Добавить();
			НовоеДействие.ИндексГруппы	  = 5;
			НовоеДействие.ИндексДействия = 3;
			НовоеДействие.Ключ	  = "ИзменениеСостоянияЗаказаПоставщикаИНаПроизводство";
			НовоеДействие.ТипНастройки = Перечисления.ТипыНастройкиПроцессовСостояний.ВнешняяНастройка;
			НовоеДействие.ВидНастройки = Перечисления.ВидыНастройкиПроцессовСостояний.ВоВсехСостояниях;
			НовоеДействие.Наименование = НСтр("ru = 'При изменении состояния заказа поставщика и заказа на производство'");
			НовоеДействие.КлючГруппы   = "ПереводЗаказаВСостояние";
			НовоеДействие.ЭтоЗадачаАссистента   = Истина;
			НовоеДействие.ИмяФормыЗадачиАссистента   = "Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов";
			НовоеДействие.ИдентификаторГруппыАссистента   = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция КартинкаДействия(Используется)
	
	Если Используется Тогда
		Возврат БиблиотекаКартинок.ФлагВключен;
	Иначе
		Возврат БиблиотекаКартинок.ФлагОтключен;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПереместитьЭлементыЗавершения()
	
	ИндексГруппы = 0;
	Пока ИндексГруппы < ИндексСозданныхЭлементов Цикл
		
		ИндексДействия = 0;
		ПроцессыГруппы = Процессы.НайтиСтроки(Новый Структура("ИндексГруппы, ЭтоГруппа", ИндексГруппы, Ложь));
		Количество = ПроцессыГруппы.Количество();
		
		Пока ИндексДействия < Количество Цикл
			ЭлементУспешно = Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенУспешно"];
			ЭлементОтменен = Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенОтменен"];
			Группа = Элементы["ФлагиГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия];
		
			Элементы.Переместить(ЭлементУспешно, Группа);
			Элементы.Переместить(ЭлементОтменен, Группа);
			ИндексДействия = ИндексДействия + 1;
		КонецЦикла;
		
		ИндексГруппы = ИндексГруппы + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеДействияПроцессов

&НаКлиенте
Процедура Подключаемый_ОткрытьФормуЗадачи(Элемент)
	
	ИмяГруппы = Элемент.Родитель.Имя;
	ИндексПервогоЧисла = СтрНайти(ИмяГруппы, "_",НаправлениеПоиска.СКонца);
	ИмяГруппыДляПоиска = Сред(ИмяГруппы, СтрДлина("ГруппаДействий_")+1);
	ИндексПервойГруппы = СтрНайти(ИмяГруппыДляПоиска, "_",НаправлениеПоиска.СНачала);
	
	ИндексДействия = Число(Прав(ИмяГруппы, СтрДлина(ИмяГруппы) - ИндексПервогоЧисла));
	ИндексГруппы = Число(Лев(ИмяГруппыДляПоиска, ИндексПервойГруппы - 1)); 
	
	Действие = Процессы.НайтиСтроки(Новый Структура("ИндексГруппы, ИндексДействия, ЭтоГруппа", ИндексГруппы, ИндексДействия, Ложь));
	
	ИмяФормыАссистента = Действие[0].ИмяФормыЗадачиАссистента;
	ИдентификаторГруппы = Действие[0].ИдентификаторГруппыАссистента;;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗадачи",ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторГруппы", ИдентификаторГруппы);
	ОткрытьФорму(ИмяФормыАссистента, ПараметрыФормы ,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеФлагОбязательноЗаполнение(Элемент)
	
	Группа = Элемент.Родитель;
	ИндексЭлемента = Группа.ПодчиненныеЭлементы.Индекс(Элемент);
	ЭлементВключается = Элемент.Картинка = БиблиотекаКартинок.ФлагОтключен;
	Элемент.Картинка = КартинкаДействия(ЭлементВключается);
	Модифицированность = Истина;
	ИзмененыНастройкиОбязательностиЗаполнения = Истина;
	
	Если НЕ ЭлементВключается Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементГалочки ИЗ Группа.ПодчиненныеЭлементы Цикл
		ИндексГалочки = Группа.ПодчиненныеЭлементы.Индекс(ЭлементГалочки);
		
		Если ИндексГалочки > ИндексЭлемента Тогда
			ЭлементГалочки.Картинка = Элемент.Картинка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеЗапрещатьЗавершениеНеотгруженныхЗаказов(Элемент)
	
	ЭлементВключается = Элемент.Картинка = БиблиотекаКартинок.ФлагОтключен;
	Элемент.Картинка = КартинкаДействия(ЭлементВключается);
	Модифицированность = Истина;
	ИзмененыНастройкиЗапретаЗавершения = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеХранитьИсториюИзменений(Элемент)
	
	ИзмененыНастройкиВерсионирования = Истина;
	ГруппаВерсионирования = Элементы.ФлагиГруппаДействий_2_Действие_1;
	
	Если Элемент <> ГруппаВерсионирования.ПодчиненныеЭлементы[0] Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.Картинка = БиблиотекаКартинок.ФлагВключен Тогда
		Элемент.Картинка = БиблиотекаКартинок.ФлагОтключен;
	Иначе
		Элемент.Картинка = БиблиотекаКартинок.ФлагВключен;
	КонецЕсли;
	
	Для Каждого ЭлементГруппы Из ГруппаВерсионирования.ПодчиненныеЭлементы Цикл
		Если ЭлементГруппы = Элемент Тогда
			Продолжить;
		КонецЕсли;
		ЭлементГруппы.Картинка = КартинкаЗадачиАссистента(Элемент.Картинка = БиблиотекаКартинок.ФлагВключен);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеЗапрещатьИзменениеПрошлыхПериодов(Элемент)
	
	Элемент.Картинка = КартинкаДействия(Элемент.Картинка = БиблиотекаКартинок.ФлагОтключен);
	ГруппаФлагов = Элемент.Родитель;
	
	Модифицированность = Истина;
	ИзмененыНастройкиДатыЗапретаИзменений = Истина;
	
	Если СтрНайти(Элемент.Имя, "СостояниеЗавершен") <> 0 Тогда
		
		Для Каждого ЭлементГруппы Из ГруппаФлагов.ПодчиненныеЭлементы Цикл
			Если ЭлементГруппы = Элемент ИЛИ СтрНайти(ЭлементГруппы.Имя, "СостояниеЗавершен") = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЭлементГруппы.Картинка = Элемент.Картинка;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Подключаемый_НажатиеФлагСостояниеЗаявки(Элемент)
	
	ЗаявкиБылиВключены = (Элемент.Картинка = БиблиотекаКартинок.ФлагВключен);
	ГруппаДействия = Элементы[Элемент.Родитель.Имя];
	ИндексСостоянияЗаявки = ГруппаДействия.ПодчиненныеЭлементы.Индекс(Элемент);
	
	ОтветОтСервера = НажатиеФлагСостояниеЗаявкиНаСервере(ЗаявкиБылиВключены, ИндексСостоянияЗаявки);
	Если Не ОтветОтСервера.ИзменениеВозможно Тогда
		
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("РезультатПроверки", ОтветОтСервера.РезультатПроверки);
		ПараметрыМетода.Вставить("ИспользоватьВидыЗаказов", НесколькоВидовЗаказов);
		ПараметрыМетода.Вставить("НаименованиеВидаЗаказа", Объект.Наименование);
		ПараметрыМетода.Вставить("ЗаявкиИспользуютсяДляВида", ЗначениеЗаполнено(Объект.СостояниеЗаявки));
		Ответ = РаботаСЗаявкамиКлиентСервер.ОбработатьРезультатПроверкиВозможностиИзмененияИспользованияЗаявокДляСостояния(
		ПараметрыМетода);
		
		Если ЗначениеЗаполнено(Ответ.ДанныеПредупреждения.Текст) Тогда
			ПредупреждениеАсинх(Ответ.ДанныеПредупреждения.Текст);
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Ответ.ДанныеВопроса.Текст) Тогда
			Возврат;
		КонецЕсли;
		
		КлючОтветаСоздатьСостояние = "СоздатьСостояние";
		КлючОтветаПерейтиКОбъекту = "ПерейтиКОбъекту";
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить(КлючОтветаСоздатьСостояние, НСтр("ru = 'Создать состояние'"));
		
		Если ЗначениеЗаполнено(Ответ.ДанныеВопроса.ТекстКнопкиПереходаКОбъекту) Тогда
			КнопкиВопроса.Добавить(КлючОтветаПерейтиКОбъекту, Ответ.ДанныеВопроса.ТекстКнопкиПереходаКОбъекту);
		КонецЕсли;
		
		КнопкиВопроса.Добавить("Отмена", НСтр("ru = 'Отмена'"));
		
		ОтветОтПользователя = Ждать ВопросАсинх(Ответ.ДанныеВопроса.Текст, КнопкиВопроса, , КлючОтветаСоздатьСостояние);
		
		Если ОтветОтПользователя = КлючОтветаПерейтиКОбъекту Тогда
			
			ПерейтиПоНавигационнойСсылке(Ответ.ДанныеВопроса.НавигационнаяСсылкаОбъекта);
			
		ИначеЕсли ОтветОтПользователя = КлючОтветаСоздатьСостояние Тогда
			
			ПараметрыФормы = Новый Структура("ЭтоСостояниеДляЗаявок", Истина);
			ОткрытьФорму("Справочник.СостоянияЗаказНарядов.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеФлагСостояниеВыполнения(Элемент)
	
	ВыполнениеБылоВключено = (Элемент.Картинка = БиблиотекаКартинок.ФлагВключен);
	ГруппаДействия = Элементы[Элемент.Родитель.Имя];
	ИндексСостоянияВыполнения = ГруппаДействия.ПодчиненныеЭлементы.Индекс(Элемент);
	
	ОтветОтСервера = НажатиеФлагСостояниеВыполненияНаСервере(
	ВыполнениеБылоВключено, ИндексСостоянияВыполнения);
	
	Если Не ОтветОтСервера.ИзменениеВозможно Тогда
		
		ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'В состоянии ""%1"" заказ имеет режим ""Заявка"".
		|Для включения режима ""Выполнение"" отключите режим ""Заявка""'"),
		ОтветОтСервера.ПредставлениеСостояния);
		
		ПредупреждениеАсинх(ТекстПредупреждения);
		
	Иначе
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область АссистентУправления

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗадачи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьЗакрытиеФормыЗадачиСервер(Результат);
		
КонецПроцедуры 

&НаСервере
Процедура ОбработатьЗакрытиеФормыЗадачиСервер(Результат)
	
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	АссистентПодключен = АссистентУправления.Подключен();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОпределитьЗадачиВРаботе(Результат.ГруппаЗадач);
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Если НЕ ОбсуждениеСоздано Тогда
		Попытка
			СоздатьОбсуждение();
		Исключение
		КонецПопытки;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Результат.АвторИзменений) И Результат.НужноДобавитьВОбсуждение Тогда
		Попытка
			АссистентУправления.ОбновитьУчастниковЖурналРаботыАссистента(Результат.АвторИзменений);
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОпределитьЗадачиВРаботе(ИдентификаторГруппы = Неопределено)
	
	ОтборПоГруппе = Ложь;
	Если ИдентификаторГруппы = Неопределено Тогда
		ОтборПоГруппе = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиАссистента.Ссылка КАК Ссылка,
	|	ЗадачиАссистента.Родитель.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ЗадачиАссистента.Используется КАК Используется
	|ПОМЕСТИТЬ ИспользуемыеЗадачиАссистента
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|ГДЕ
	|	(&ОтборПоГруппе
	|			ИЛИ ЗадачиАссистента.Родитель.ИдентификаторГруппы = &ИдентификаторГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуемыеЗадачиАссистента.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ИспользуемыеЗадачиАссистента.Используется КАК Используется,
	|	ЗначениеЗаполнения.Ссылка КАК Ссылка,
	|	ЗначениеЗаполнения.Параметр КАК Параметр,
	|	ЗначениеЗаполнения.Значение КАК Значение
	|ИЗ
	|	ИспользуемыеЗадачиАссистента КАК ИспользуемыеЗадачиАссистента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления.ЗначенияЗаполнения КАК ЗначениеЗаполнения
	|		ПО (ЗначениеЗаполнения.Ссылка = ИспользуемыеЗадачиАссистента.Ссылка)
	|ГДЕ
	|	(ЗначениеЗаполнения.Параметр = ""СостояниеЗаказа""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""СостояниеЗаказаПокупателя""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""ВариантЗавершения""
	|			ИЛИ ЗначениеЗаполнения.Параметр = ""ВариантЗавершенияЗаказаПокупателя"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИспользуемыеЗадачиАссистента.ИдентификаторГруппы,
	|	ИспользуемыеЗадачиАссистента.Используется,
	|	ПараметрыУсловияЗадач.Ссылка,
	|	ПараметрыУсловияЗадач.Параметр,
	|	ПараметрыУсловияЗадач.Значение
	|ИЗ
	|	ИспользуемыеЗадачиАссистента КАК ИспользуемыеЗадачиАссистента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления.ПараметрыУсловия КАК ПараметрыУсловияЗадач
	|		ПО (ПараметрыУсловияЗадач.Ссылка = ИспользуемыеЗадачиАссистента.Ссылка)
	|ГДЕ
	|	(ПараметрыУсловияЗадач.Параметр = ""СостояниеЗаказа""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""СостояниеЗаказаПокупателя""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""ВариантЗавершения""
	|			ИЛИ ПараметрыУсловияЗадач.Параметр = ""ВариантЗавершенияЗаказаПокупателя"")";
	
	Запрос.УстановитьПараметр("ОтборПоГруппе", ОтборПоГруппе);
	Запрос.УстановитьПараметр("ИдентификаторГруппы", ИдентификаторГруппы);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЗадач = Результат.Выгрузить();
	ТаблицаЗадач.Колонки.Добавить("Состояние", Новый ОписаниеТипов("СправочникСсылка.СостоянияЗаказНарядов, ПеречислениеСсылка.ВариантыЗавершенияЗаказа"));
	
	Для Каждого Строка Из ТаблицаЗадач Цикл
		
		СостояниеЗаказа = Строка.Значение.Получить();
		Строка.Состояние = СостояниеЗаказа;
		
		ДействиеЗадачи = Процессы.НайтиСтроки(Новый Структура("ИдентификаторГруппыАссистента", Строка.ИдентификаторГруппы));
		
		Если ДействиеЗадачи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексГруппы = ДействиеЗадачи[0].ИндексГруппы;
		ИндексДействия = ДействиеЗадачи[0].ИндексДействия;
		ОбработанныеСостояния = Новый Массив;

		Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
			
			Если ОбработанныеСостояния.Найти(Состояние.Состояние) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ИндексСостояния = Объект.ПорядокСостояний.Индекс(Состояние); 
			Если Состояние.Состояние = Справочники.СостоянияЗаказНарядов.Завершен Тогда
				Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенУспешно"].Картинка = КартинкаЗадачиАссистента(Ложь);
				Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенОтменен"].Картинка = КартинкаЗадачиАссистента(Ложь);
				ИндексСостояния = ИндексСостояния + 1;
				Продолжить;
			КонецЕсли;
			Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_Состояние_"+ ИндексСостояния].Картинка = КартинкаЗадачиАссистента(Ложь);
			ОбработанныеСостояния.Добавить(Состояние.Состояние);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗадач Цикл
		
		ОбработанныеСостояния = Новый Массив;
		ДействиеЗадачи = Процессы.НайтиСтроки(Новый Структура("ИдентификаторГруппыАссистента", Строка.ИдентификаторГруппы));
		
		Если ДействиеЗадачи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексГруппы = ДействиеЗадачи[0].ИндексГруппы;
		ИндексДействия = ДействиеЗадачи[0].ИндексДействия;
		
		СостояниеЗадачи = Строка.Состояние;
		
		Если СтрНайти(Строка.Параметр, "СостояниеЗаказа") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбработанныеСостояния.Найти(СостояниеЗадачи) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ИндексыСостояний = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", СостояниеЗадачи));
		
		Если ИндексыСостояний.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСостояния = Объект.ПорядокСостояний.Индекс(ИндексыСостояний[0]);
		Если СостояниеЗадачи = Справочники.СостоянияЗаказНарядов.Завершен Тогда
			
			ВариантЗавершенияУспешно = ТаблицаЗадач.НайтиСтроки(Новый Структура("Ссылка, Состояние", Строка.Ссылка, Перечисления.ВариантыЗавершенияЗаказа.Успешно));
			ВариантЗавершенияОтменен = ТаблицаЗадач.НайтиСтроки(Новый Структура("Ссылка, Состояние", Строка.Ссылка, Перечисления.ВариантыЗавершенияЗаказа.Отменен));
					
			Если ВариантЗавершенияУспешно.Количество() = 0 И ВариантЗавершенияОтменен.Количество() = 0 Тогда
				Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенУспешно"].Картинка = КартинкаЗадачиАссистента(Строка.Используется);
				Продолжить;
			КонецЕсли;
			
			Если ВариантЗавершенияУспешно.Количество() <> 0 Тогда
				Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенУспешно"].Картинка = КартинкаЗадачиАссистента(Строка.Используется);
			КонецЕсли;
			
			Если ВариантЗавершенияОтменен.Количество() <> 0 Тогда
				Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_СостояниеЗавершенОтменен"].Картинка = КартинкаЗадачиАссистента(Строка.Используется);
			КонецЕсли;
			
		Иначе
			Элементы["Флаг_ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия+"_Состояние_"+ ИндексСостояния].Картинка = КартинкаЗадачиАссистента(Строка.Используется);			
			ОбработанныеСостояния.Добавить(СостояниеЗадачи);
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры

&НаСервере
Функция КартинкаЗадачиАссистента(Используется)
	
	Если Используется Тогда
		Возврат БиблиотекаКартинок.Готово_16;
	Иначе
		Возврат Элементы.ДекорацияНетКартинки.Картинка;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура СоздатьОбсуждение()
	
	Если АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.СоздатьОбсуждениеЖурналРаботыАссистента();
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеДанныхПроцессов

&НаСервере
Процедура СохранитьДанныеПроцессов(ТекущийОбъект)
	
	ЗаписатьНастройкиВерсионирования();
	ЗаписатьНастройкиДатыЗапрета();
	ЗаполнитьДанныеОбязательностиЗаполнения(ТекущийОбъект);
	ЗаполнитьДанныеЗапретаЗавершения(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиВерсионирования()
	
	Если НЕ ИзмененыНастройкиВерсионирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	
	Если Элементы.ФлагиГруппаДействий_1_Действие_1.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватьВерсионированиеОбъектов Тогда
		Константы.ИспользоватьВерсионированиеОбъектов.Установить(Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипОбъектаВерсионирования) Тогда
		ТипОбъектаВерсионирования = ТипОбъектаВерсионирования();
	КонецЕсли;
	
	Если Элементы.ФлагиГруппаДействий_1_Действие_1.ПодчиненныеЭлементы[0].Картинка = БиблиотекаКартинок.ФлагВключен Тогда
		ВерсионированиеОбъектов.ЗаписатьНастройкуВерсионированияПоОбъекту(ТипОбъектаВерсионирования, 
			Перечисления.ВариантыВерсионированияОбъектов.ВерсионироватьПриПроведении,
			Перечисления.СрокиХраненияВерсий.Бессрочно);
	Иначе
		ВерсионированиеОбъектов.ЗаписатьНастройкуВерсионированияПоОбъекту(ТипОбъектаВерсионирования, 
			Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать,
			Перечисления.СрокиХраненияВерсий.Бессрочно);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиДатыЗапрета()
	
	Если НЕ ИзмененыНастройкиДатыЗапретаИзменений Тогда
		Возврат;
	КонецЕсли;
	
	Группа = Элементы.ФлагиГруппаДействий_2_Действие_0;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел.Наименование = ""Заказ-наряд""";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	РазделДатыЗапрета = РазделДатыЗапрета();
	
	ИндексСостояния = 0;
	Для Каждого Флаг ИЗ Группа.ПодчиненныеЭлементы Цикл
		
		Состояние = Объект.ПорядокСостояний.Получить(ИндексСостояния).Состояние;
		
		Если Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ИндексСостояния = ИндексСостояния + 1;
		КонецЕсли;
		
		ЗаписиВРегистре = Таблица.НайтиСтроки(Новый Структура("Объект, Пользователь, ДатаЗапрета", 
			Состояние, 
			Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей, 
			Дата('39991231')));
			
		
		Если ЗаписиВРегистре.Количество() = 0 И Флаг.Картинка = БиблиотекаКартинок.ФлагВключен Тогда
			ЗаписатьДатуЗапретаСОписанием(РазделДатыЗапрета, Состояние, Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей, Дата('39991231'),,);
		КонецЕсли;
		
		Если ЗаписиВРегистре.Количество() <> 0 И Флаг.Картинка = БиблиотекаКартинок.ФлагОтключен Тогда
			Запись = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписиВРегистре[0]); 
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДатуЗапретаСОписанием(Знач Раздел, Знач Объект, Знач Пользователь, Знач ДатаЗапрета, Знач ВнутреннееОписаниеДатыЗапрета, Знач Комментарий)
	
	Если Не ЗначениеЗаполнено(ДатаЗапрета) Тогда
		ДатаЗапрета = '39991231';
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Раздел              = Раздел;
	МенеджерЗаписи.Объект              = Объект;
	МенеджерЗаписи.Пользователь        = Пользователь;
	МенеджерЗаписи.ДатаЗапрета         = ДатаЗапрета;
	МенеджерЗаписи.ОписаниеДатыЗапрета = ВнутреннееОписаниеДатыЗапрета;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбязательностиЗаполнения(ТекущийОбъект)
	
	Если НЕ ИзмененыНастройкиОбязательностиЗаполнения Тогда 
		Возврат;
	КонецЕсли;
	
	ГруппаНастроек = Элементы.ФлагиГруппаДействий_1_Действие_0;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроверкиЗаполнения");
	
	Если ПроцессыВида.Количество() = 0 Тогда
		ПроцессыВидаОбъект = Справочники.ПроцессыСостоянийЗаказов.СоздатьЭлемент();
		ПроцессыВидаОбъект.Предмет = "ЗаказНаряд";
		ПроцессыВидаОбъект.ВидЗаказа = ТекущийОбъект.Ссылка;
	Иначе
		ПроцессыВидаОбъект = ПроцессыВида[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
		
	ИндексСостояния = 0;
	
	СтрокиПричиныОтмены = ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.НайтиСтроки(Новый Структура("ИмяРеквизита", "ОтмененныеЗапасы.ПричинаОтмены"));
	
	Для Каждого Строка Из СтрокиПричиныОтмены Цикл
		ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.Удалить(Строка);
	КонецЦикла;
	
	Для Каждого Элемент Из ГруппаНастроек.ПодчиненныеЭлементы Цикл
		Состояние = ТекущийОбъект.ПорядокСостояний.Получить(ИндексСостояния).Состояние;
		
		Если Элемент.Картинка = БиблиотекаКартинок.ФлагОтключен Тогда
			Если Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
				ИндексСостояния = ИндексСостояния + 1;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		НоваяПроверка = ПроцессыВидаОбъект.ОбработкаПроверкиЗаполнения.Добавить();
		НоваяПроверка.ИмяРеквизита = "ОтмененныеЗапасы.ПричинаОтмены";
		НоваяПроверка.Состояние = Состояние;
		
		Если Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ИндексСостояния = ИндексСостояния + 1;
		Иначе
			ВариантЗавершения = ВариантЗавершения(Элемент.Имя);
			НоваяПроверка.ВариантЗавершения = ВариантЗавершения;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессыВидаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЗапретаЗавершения(ТекущийОбъект)
	
	Если НЕ ИзмененыНастройкиЗапретаЗавершения Тогда 
		Возврат;
	КонецЕсли;
	
	ГруппаНастроек = Элементы.ФлагиГруппаДействий_1_Действие_1;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроведения");
	
	Если ПроцессыВида.Количество() = 0 Тогда
		ПроцессыВидаОбъект = Справочники.ПроцессыСостоянийЗаказов.СоздатьЭлемент();
		ПроцессыВидаОбъект.Предмет = "ЗаказНаряд";
		ПроцессыВидаОбъект.ВидЗаказа = ТекущийОбъект.Ссылка;
	Иначе
		ПроцессыВидаОбъект = ПроцессыВида[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокиПричиныОтмены = ПроцессыВидаОбъект.ОбработкаПроведения.НайтиСтроки(Новый Структура("Свойство", "ПолностьюОтгружен"));
	
	Для Каждого Строка Из СтрокиПричиныОтмены Цикл
		ПроцессыВидаОбъект.ОбработкаПроведения.Удалить(Строка);
	КонецЦикла;
	
	ИндексСостояния = 0;
	
	Для Каждого Элемент Из ГруппаНастроек.ПодчиненныеЭлементы Цикл
		
		Состояние = ТекущийОбъект.ПорядокСостояний.Получить(ИндексСостояния).Состояние;
		
		Если Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ИндексСостояния = ИндексСостояния + 1;
			Продолжить;
		КонецЕсли;
		
		Если Элемент.Картинка <> БиблиотекаКартинок.ФлагВключен Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяПроверка = ПроцессыВидаОбъект.ОбработкаПроведения.Добавить();
		НоваяПроверка.Свойство = "ПолностьюОтгружен";
		НоваяПроверка.Состояние = Состояние;
		ВариантЗавершения = ВариантЗавершения(Элемент.Имя);
		НоваяПроверка.ВариантЗавершения = ВариантЗавершения;
		
	КонецЦикла;
	
	ПроцессыВидаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеФлаговПроцессов

&НаСервере
Процедура УстановитьФлагиПроцессов()
	
	Если Объект.ПорядокСостояний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОпределитьЗадачиВРаботе();
	УстановитьФлагиВерсионирования();
	УстановитьФлагиДатыЗапретаИзменений();
	УстановитьФлагиОбязательноеЗаполнениеПричины();
	УстановитьФлагиЗапретЗавершения(); 
	УстановитьФлагиСостояниеВыполнения();
	УстановитьФлагиСостояниеЗаявки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиСостояниеЗаявки()
	
	ГруппаЭлемента = Элементы.ФлагиГруппаДействий_0_Действие_0;
	Если ЗначениеЗаполнено(Объект.СостояниеЗаявки) Тогда
		СостояниеЗаявкиВСписке = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Объект.СостояниеЗаявки));
		ИндексСостоянияЗаявки = Объект.ПорядокСостояний.Индекс(СостояниеЗаявкиВСписке[0]);
	Иначе
		ИндексСостоянияЗаявки = -1;
	КонецЕсли;
	
	Индекс = 0;
	Для Каждого Элемент Из ГруппаЭлемента.ПодчиненныеЭлементы Цикл
		
		Элемент.Картинка = КартинкаДействия(Индекс <= ИндексСостоянияЗаявки);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиСостояниеВыполнения()
	
	СостояниеВыполненияВСписке = Объект.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Объект.СостояниеВыполнения));
	Если СостояниеВыполненияВСписке.Количество() = 0 И ЗначениеЗаполнено(Объект.СостояниеВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаЭлемента = Элементы.ФлагиГруппаДействий_0_Действие_1;
	Если ЗначениеЗаполнено(Объект.СостояниеВыполнения) Тогда
		ИндексСостоянияВыполнения = Объект.ПорядокСостояний.Индекс(СостояниеВыполненияВСписке[0]);
	Иначе
		ИндексСостоянияВыполнения = ГруппаЭлемента.ПодчиненныеЭлементы.Количество() + 1;
	КонецЕсли;
	
	Индекс = 0;
	Для Каждого Элемент Из ГруппаЭлемента.ПодчиненныеЭлементы Цикл
		
		Элемент.Картинка = КартинкаДействия(Индекс >= ИндексСостоянияВыполнения);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиВерсионирования()
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьВерсионированиеОбъектов = Константы.ИспользоватьВерсионированиеОбъектов.Получить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиВерсионированияОбъектов.ТипОбъекта КАК ТипОбъекта,
	|	НастройкиВерсионированияОбъектов.Вариант КАК ВариантВерсионирования,
	|	НастройкиВерсионированияОбъектов.СрокХраненияВерсий КАК СрокХраненияВерсий
	|ИЗ
	|	РегистрСведений.НастройкиВерсионированияОбъектов КАК НастройкиВерсионированияОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО (ИдентификаторыОбъектовМетаданных.Ссылка = НастройкиВерсионированияОбъектов.ТипОбъекта)
	|ГДЕ ПолноеИмя = ""Документ.ЗаказПокупателя""";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Таблица = Запрос.Выполнить().Выгрузить(); 
	
	Для Каждого Флаг Из Элементы.ФлагиГруппаДействий_2_Действие_1.ПодчиненныеЭлементы Цикл
		
		ВерсионированиеИспользуется = Таблица.Количество() <> 0 И Таблица[0].ВариантВерсионирования <> Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать;
		ВерсионированиеИспользуется = ВерсионированиеИспользуется И ИспользоватьВерсионированиеОбъектов;
		
		Индекс = Элементы.ФлагиГруппаДействий_2_Действие_1.ПодчиненныеЭлементы.Индекс(Флаг);
		
		Если Индекс = 0 Тогда
			Флаг.Картинка = КартинкаДействия(ВерсионированиеИспользуется);
			Продолжить;
		КонецЕсли;
		
		Флаг.Картинка = КартинкаЗадачиАссистента(ВерсионированиеИспользуется);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиДатыЗапретаИзменений()
	
	УстановитьПривилегированныйРежим(Истина);
	ДатыЗапретаВключены = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел.Наименование = ""Заказ-наряд""";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Таблица = Запрос.Выполнить().Выгрузить(); 
	
	ИндексСостояния = 0;
	Для Каждого Флаг Из Элементы.ФлагиГруппаДействий_2_Действие_0.ПодчиненныеЭлементы Цикл
		
		Если НЕ ДатыЗапретаВключены Тогда
			Флаг.Картинка = БиблиотекаКартинок.ФлагОтключен;
			Если  Объект.ПорядокСостояний[ИндексСостояния].Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
				ИндексСостояния = ИндексСостояния + 1;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ЕстьНастройкаСостояния = Таблица.НайтиСтроки(Новый Структура("Объект", Объект.ПорядокСостояний[ИндексСостояния].Состояние));
		
		Если ЕстьНастройкаСостояния.Количество() <> 0 Тогда
			Флаг.Картинка = БиблиотекаКартинок.ФлагВключен;
		Иначе 
			Флаг.Картинка = БиблиотекаКартинок.ФлагОтключен;
		КонецЕсли; 
		
		Если  Объект.ПорядокСостояний[ИндексСостояния].Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ИндексСостояния = ИндексСостояния + 1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиОбязательноеЗаполнениеПричины()
	
	ГруппаНастроек = Элементы.ФлагиГруппаДействий_1_Действие_0;
	ИндексСостояния = 0;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроверкиЗаполнения");
	
	Для Каждого Элемент Из ГруппаНастроек.ПодчиненныеЭлементы Цикл
		
		Состояние = Объект.ПорядокСостояний.Получить(ИндексСостояния).Состояние;
		ВариантЗавершения = ВариантЗавершения(Элемент.Имя);
		
		СтрокаПравила = ПроцессыВида.НайтиСтроки(Новый Структура("Состояние, ВариантЗавершения", Состояние, ВариантЗавершения));
		Элемент.Картинка = КартинкаДействия(СтрокаПравила.Количество() > 0);
				
		Если Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ИндексСостояния = ИндексСостояния + 1;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиЗапретЗавершения()
	
	ГруппаНастроек = Элементы.ФлагиГруппаДействий_1_Действие_1;
	ИндексСостояния = 0;
	
	ПроцессыВида = ПроцессыВида("ОбработкаПроведения");
	
	Для Каждого Элемент Из ГруппаНастроек.ПодчиненныеЭлементы Цикл
		
		Состояние = Объект.ПорядокСостояний.Получить(ИндексСостояния).Состояние;
		Если Состояние <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
			ИндексСостояния = ИндексСостояния + 1;
			Продолжить;
		КонецЕсли;
		
		ВариантЗавершения = ВариантЗавершения(Элемент.Имя);
		СтрокаПравила = ПроцессыВида.НайтиСтроки(Новый Структура("Состояние, ВариантЗавершения", Состояние, ВариантЗавершения));
		Элемент.Картинка = КартинкаДействия(СтрокаПравила.Количество() > 0);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОпределитьИнтерфейсПриСоздании(Параметры)
	
	Если ЗаявкиДоступны И Параметры.Свойство("ПервоеВключениеЗаявок") Тогда
		
		ПервыйФлагДляЗаявок = Элементы.Найти("Флаг_ГруппаДействий_0_Действие_0_Состояние_0");
		Если ПервыйФлагДляЗаявок <> Неопределено Тогда
			ТекущийЭлемент = ПервыйФлагДляЗаявок;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИнтерфейсПрокруткиПроцессов();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НомерСостояния(ПорядокСостояний, Состояние)
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Возврат 0;
	КонецЕсли;
	
	Список = ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние));
	Если Список.Количество() Тогда
		Возврат Список[0].НомерСтроки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция НажатиеФлагСостояниеЗаявкиНаСервере(Знач ЗаявкиБылиВключены, Знач ИндексСостоянияЗаявки)
	
	Результат = Новый Структура;
	Результат.Вставить("ИзменениеВозможно", Истина);
	Результат.Вставить("РезультатПроверки", Новый Структура);
	
	Ответ = РаботаСЗаявками.ПроверкаВозможностиИзмененияИспользованияЗаявокДляСостояния(
	ЗаявкиБылиВключены, Объект, ИндексСостоянияЗаявки);
	
	Если Не Ответ.ИзменениеВозможно Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат.РезультатПроверки, Ответ, Ложь);
		Результат.Вставить("ИзменениеВозможно", Ложь);
		Возврат Результат;
	КонецЕсли;
	
	Если ЗаявкиБылиВключены Тогда
		ИндексСостоянияЗаявки = ИндексСостоянияЗаявки - 1;
	КонецЕсли;
	
	КоличествоСостояний = Объект.ПорядокСостояний.Количество();
	КоличествоСостоянийЗавершения = 2;
	Если ИндексСостоянияЗаявки >= КоличествоСостояний - 1 Тогда
		ИндексСостоянияЗаявки = КоличествоСостояний - КоличествоСостоянийЗавершения;
	КонецЕсли;
	
	Если ИндексСостоянияЗаявки < 0 Тогда
		СостояниеЗаявки = Неопределено;
	Иначе
		СостояниеЗаявки = Объект.ПорядокСостояний[ИндексСостоянияЗаявки].Состояние;
	КонецЕсли;
	
	Объект.СостояниеЗаявки = СостояниеЗаявки;
	УстановитьФлагиСостояниеЗаявки();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НажатиеФлагСостояниеВыполненияНаСервере(Знач ВыполнениеБылоВключено, Знач ИндексСостоянияВыполнения)
	
	Результат = Новый Структура;
	Результат.Вставить("ИзменениеВозможно", Истина);
	Результат.Вставить("ПредставлениеСостояния", "");
	
	Если ВыполнениеБылоВключено Тогда
		ИндексСостоянияВыполнения = ИндексСостоянияВыполнения + 1;
	КонецЕсли;
	
	КоличествоСостояний = Объект.ПорядокСостояний.Количество();
	Если ИндексСостоянияВыполнения >= КоличествоСостояний - 1 Тогда
		ИндексСостоянияВыполнения = КоличествоСостояний - 1;
	КонецЕсли;
	
	Если ИндексСостоянияВыполнения >= 0 Тогда
		
		ИндексСостоянияЗаявки = ИндексСостоянияЗаявки();
		Если ИндексСостоянияЗаявки >= ИндексСостоянияВыполнения Тогда
			Результат.ИзменениеВозможно = Ложь;
			Результат.ПредставлениеСостояния = Строка(Объект.ПорядокСостояний[ИндексСостоянияВыполнения].Состояние);
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.СостояниеВыполнения = Объект.ПорядокСостояний[ИндексСостоянияВыполнения].Состояние;
	УстановитьФлагиСостояниеВыполнения();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИндексСостоянияЗаявки()
	
	Результат = 0;
	Для Каждого ПорядокСостояния Из Объект.ПорядокСостояний Цикл
		
		Если Объект.СостояниеЗаявки = ПорядокСостояния.Состояние Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат = Результат + 1;
		
	КонецЦикла;
	
	Возврат -1;
	
КонецФункции

&НаСервере
Функция ВариантЗавершения(ИмяЭлемента)
	
	ИмяВариантаЗавершения = Прав(ИмяЭлемента, СтрДлина(ИмяЭлемента) - СтрНайти(ИмяЭлемента, "_", НаправлениеПоиска.СКонца));
	Если ИмяВариантаЗавершения = "СостояниеЗавершенУспешно" Тогда
		Возврат Перечисления.ВариантыЗавершенияЗаказа.Успешно;
	ИначеЕсли ИмяВариантаЗавершения = "СостояниеЗавершенОтменен" Тогда
		Возврат Перечисления.ВариантыЗавершенияЗаказа.Отменен;
	Иначе
		Возврат Перечисления.ВариантыЗавершенияЗаказа.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ТипОбъектаВерсионирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК ТипОбъекта
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = ""Документ.ЗаказПокупателя""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ТипОбъекта;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция РазделДатыЗапрета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазделыДатыЗапретаИзменений.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.РазделыДатЗапретаИзменения КАК РазделыДатыЗапретаИзменений
	|ГДЕ
	|	РазделыДатыЗапретаИзменений.Наименование = ""Заказ-наряд""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПроцессыВида(ИмяТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроцессов(ИмяТаблицы);
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПроцессов(ИмяТаблицы)
	
	Если ИмяТаблицы = "ОбработкаПроверкиЗаполнения" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроцессыСостоянийЗаказов.Ссылка КАК Ссылка,
		|	ПроцессыОбработкаПроверкиЗаполнения.НомерСтроки КАК НомерСтроки,
		|	ПроцессыОбработкаПроверкиЗаполнения.Состояние КАК Состояние,
		|	ПроцессыОбработкаПроверкиЗаполнения.ИмяРеквизита КАК ИмяРеквизита,
		|	ПроцессыОбработкаПроверкиЗаполнения.ВариантЗавершения КАК ВариантЗавершения
		|ИЗ
		|	Справочник.ПроцессыСостоянийЗаказов КАК ПроцессыСостоянийЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессыСостоянийЗаказов.ОбработкаПроверкиЗаполнения КАК ПроцессыОбработкаПроверкиЗаполнения
		|		ПО (ПроцессыСостоянийЗаказов.Ссылка = ПроцессыОбработкаПроверкиЗаполнения.Ссылка)
		|ГДЕ
		|	ПроцессыСостоянийЗаказов.ВидЗаказа = &ВидЗаказа
		|	И ПроцессыСостоянийЗаказов.Предмет = ""ЗаказНаряд""";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроцессыСостоянийЗаказов.Ссылка КАК Ссылка,
		|	ПроцессыОбработкаПроведения.НомерСтроки КАК НомерСтроки,
		|	ПроцессыОбработкаПроведения.Состояние КАК Состояние,
		|	ПроцессыОбработкаПроведения.ВариантЗавершения КАК ВариантЗавершения,
		|	ПроцессыОбработкаПроведения.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ПроцессыСостоянийЗаказов КАК ПроцессыСостоянийЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессыСостоянийЗаказов.ОбработкаПроведения КАК ПроцессыОбработкаПроведения
		|		ПО ПроцессыСостоянийЗаказов.Ссылка = ПроцессыОбработкаПроведения.Ссылка
		|ГДЕ
		|	ПроцессыСостоянийЗаказов.ВидЗаказа = &ВидЗаказа
		|	И ПроцессыСостоянийЗаказов.Предмет = ""ЗаказНаряд""";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ОбновитьПроцессы()
	
	ЗаполнитьТаблицуПроцессов();
	ОбновитьЭлементыПроцессов();
	УстановитьФлагиПроцессов();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПодчиненныеЭлементы()
	
	УдаляемыеЭлементы = Новый Массив;
	
	УдалитьЭлементыЗаголовков(УдаляемыеЭлементы);
	УдалитьЭлементыДействий(УдаляемыеЭлементы);
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыЗаголовков(УдаляемыеЭлементы)
	
	Для Каждого Элемент Из Элементы.ГруппаЗаголовкиСостояний.ПодчиненныеЭлементы Цикл
		Если СтрНайти(Элемент.Имя, "Завершен") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыДействий(УдаляемыеЭлементы)
	
	ГруппыПроцессов = Процессы.НайтиСтроки(Новый Структура("ЭтоГруппа", Истина));
	
	Для Каждого Группа Из ГруппыПроцессов Цикл
		
		ИндексГруппы = Группа.ИндексГруппы;
		ДействияГруппы = Процессы.НайтиСтроки(Новый Структура("КлючГруппы", Группа.Ключ));
		
		ГруппаОтступа = Элементы.Найти("ОтступыГруппыДействий_"+ИндексГруппы);
		
		Если ГруппаОтступа <> Неопределено Тогда
			
			Для ИндексЭлемента = 0 По ГруппаОтступа.ПодчиненныеЭлементы.Количество()-1 Цикл
				
				ЭлементУдаления = ГруппаОтступа.ПодчиненныеЭлементы[ИндексЭлемента];
				Если СтрНайти(ЭлементУдаления.Имя, "Завершен") <> 0 Тогда
					Продолжить;
				КонецЕсли;
				УдаляемыеЭлементы.Добавить(ГруппаОтступа.ПодчиненныеЭлементы[ИндексЭлемента]);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИндексГруппы >= ИндексСозданныхЭлементов Тогда
			ГруппаЗаголовкаДействия = Элементы.Найти("ГруппаДействий_"+ИндексГруппы);
			Если ГруппаЗаголовкаДействия <> Неопределено Тогда
				УдаляемыеЭлементы.Добавить(ГруппаЗаголовкаДействия);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Действие Из ДействияГруппы Цикл
			
			ИндексДействия = Действие.ИндексДействия;
			ГруппаДействия = Элементы.Найти("ФлагиГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия);
			
			Если ГруппаДействия <> Неопределено Тогда
				Для ИндексЭлемента = 0 По ГруппаДействия.ПодчиненныеЭлементы.Количество()-1 Цикл
					ЭлементУдаления = ГруппаДействия.ПодчиненныеЭлементы[ИндексЭлемента];
					Если СтрНайти(ЭлементУдаления.Имя, "Завершен") <> 0 Тогда
						Продолжить;
					КонецЕсли;
					
					УдаляемыеЭлементы.Добавить(ГруппаДействия.ПодчиненныеЭлементы[ИндексЭлемента]);
					
				КонецЦикла;
			КонецЕсли;
			
					
			Если ИндексГруппы < ИндексСозданныхЭлементов Тогда
				Продолжить;
			КонецЕсли;
			
			ГруппаУдаления = Элементы.Найти("ГруппаДействий_"+ИндексГруппы+"_Действие_"+ИндексДействия);
				
			Если ГруппаУдаления <> Неопределено Тогда
				УдаляемыеЭлементы.Добавить(ГруппаУдаления);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользоватьВидыЗаказНарядов()

	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов");

КонецФункции

&НаСервере
Процедура ОбновитьЭлементыУсловногоОформления()
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ЭлементУсловногоОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЦветСостояния" Тогда
			УдаляемыеЭлементы.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементУсловногоОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЦветФона" Тогда
			УдаляемыеЭлементы.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементУсловногоОформления Из УдаляемыеЭлементы Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементУсловногоОформления);
	КонецЦикла; 
	
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Состояние.ЦветТекста); 
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЦветСостояния";		
		ЭлементУсловногоОформления.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементУсловногоОформления.Представление	= НСтр("ru='Оформление текста в цвет состояния'");
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.ПорядокСостояний.НаименованиеСостояния");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение	= Состояние.НаименованиеСостояния; 
		
		ОформляемоеПолеКД = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных("ПорядокСостояний");
		ОформляемоеПолеКД.Использование = Истина;

		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Состояние.ЦветФона); 
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЦветФона";		
		ЭлементУсловногоОформления.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементУсловногоОформления.Представление	= НСтр("ru='Оформление текста в цвет фона'");
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.ПорядокСостояний.НаименованиеСостояния");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение	= Состояние.НаименованиеСостояния;
		
		ОформляемоеПолеКД = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных("ПорядокСостояний");
		ОформляемоеПолеКД.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояния()
	
	УдаляемыеСостояния = Новый Массив;
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		Если НЕ ЗначениеЗаполнено(Состояние.НаименованиеСостояния) Тогда
			УдаляемыеСостояния.Добавить(Состояние);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Состояние Из УдаляемыеСостояния Цикл
		Объект.ПорядокСостояний.Удалить(Состояние);
	КонецЦикла;
	
	Для Каждого Состояние Из Объект.ПорядокСостояний Цикл
		
		Если НЕ Состояние.Изменено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(Состояние.Состояние) Тогда
				СостояниеОбъект = Состояние.Состояние.ПолучитьОбъект();
				СостояниеОбъект.Заблокировать();
			Иначе
				СостояниеОбъект = Справочники.СостоянияЗаказНарядов.СоздатьЭлемент();
				СостояниеОбъект.Наименование = Состояние.НаименованиеСостояния;
			КонецЕсли;
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СостояниеОбъект);
		КонецПопытки;
		
		СостояниеОбъект.ПометкаУдаления = Состояние.ПометкаУдаления;
		СостояниеОбъект.Цвет = Новый ХранилищеЗначения(Состояние.ЦветТекста);
		СостояниеОбъект.ЦветФона = Новый ХранилищеЗначения(Состояние.ЦветФона);
		Попытка
			СостояниеОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СостояниеОбъект);
		КонецПопытки;
		СостояниеОбъект.Разблокировать();
		Состояние.Состояние = СостояниеОбъект.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандНаСервере(Состояние, ЭтоПоследнееСостояние, Форма)
	
	СостояниеЗаполнено = ЗначениеЗаполнено(Состояние);
	
	Элементы = Форма.Элементы;
	ЭтоЗавершен = Состояние = ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен");
	Элементы.ПорядокСостояний.ИзменятьПорядокСтрок			= Не ЭтоЗавершен;
	Элементы.ПорядокСостоянийПереместитьВниз.Доступность	= Не ЭтоПоследнееСостояние;
	Элементы.ПорядокСостоянийПереместитьВверх.Доступность	= Не ЭтоЗавершен;
	Элементы.ПорядокСостоянийКонтекстноеМенюПометитьНаУдаление.Доступность = Не ЭтоЗавершен И СостояниеЗаполнено;
	Элементы.ПорядокСостоянийКонтекстноеМенюУдалить.Доступность	= Не (ЭтоЗавершен И ЭтоПоследнееСостояние);
	
	Элементы.ПорядокСостоянийПометитьНаУдаление.Доступность = Не ЭтоЗавершен И СостояниеЗаполнено;
	Элементы.ПорядокСостоянийУдалить.Доступность	= Не (ЭтоЗавершен И ЭтоПоследнееСостояние);

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСостояния(Ссылка, ТекстРедактирования, ИндексСостояния, СтандартнаяОбработка) 
	
	Если Ссылка = Справочники.СостоянияЗаказНарядов.ПустаяСсылка() Тогда
		Объект.ПорядокСостояний[ИндексСостояния].НаименованиеСостояния = ТекстРедактирования;
		Объект.ПорядокСостояний[ИндексСостояния].Изменено = Истина;
		Объект.ПорядокСостояний[ИндексСостояния].Состояние = Ссылка;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
		
	ДанныеСостояния = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Ссылка, Наименование, ПометкаУдаления, Цвет, ЦветФона");
	
	Если ДанныеСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПорядокСостояний[ИндексСостояния].Состояние = ДанныеСостояния.Ссылка;
	Объект.ПорядокСостояний[ИндексСостояния].ПометкаУдаления = ДанныеСостояния.ПометкаУдаления;
	Если ДанныеСостояния.Цвет <> Неопределено Тогда
		Объект.ПорядокСостояний[ИндексСостояния].ЦветТекста = ДанныеСостояния.Цвет.Получить();
	КонецЕсли;
	Если ДанныеСостояния.ЦветФона <> Неопределено Тогда
		Объект.ПорядокСостояний[ИндексСостояния].ЦветФона = ДанныеСостояния.ЦветФона.Получить();
	КонецЕсли;
	
	Объект.ПорядокСостояний[ИндексСостояния].НаименованиеСостояния = ДанныеСостояния.Наименование;
	ОбновитьЭлементыУсловногоОформления();
КонецПроцедуры

#КонецОбласти
