#Область СлужебныеПроцедурыИФункции

// Возвращает сведения о виде документа: КодМВД, ЭтоПаспортРФ, Представление.
//
// Параметры:
//   ВидДокумента - СправочникСсылка.ВидыДокументовФизическихЛиц
//
// Возвращаемое значение:
//   Структура - См. возвращаемое значение функции СЭДОФСС.СведенияОВидеДокумента().
//
Функция СведенияОВидеДокумента(ВидДокумента) Экспорт
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		Возврат СЭДОФСС.СведенияОВидеДокумента("", "", "");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	ИменаПолей = "Представление, ИмяПредопределенныхДанных, КодМВД";
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДокумента, ИменаПолей, Ложь);
	Возврат СЭДОФСС.СведенияОВидеДокумента(
		Реквизиты.Представление,
		Реквизиты.ИмяПредопределенныхДанных,
		Реквизиты.КодМВД);
КонецФункции

Функция ЕстьПравоОтправки() Экспорт
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ОбщиеФормыСЭДОФСС.Команды.ОтправитьВФонд);
КонецФункции

#КонецОбласти
