#Область СлужебныеПроцедурыИФункции

Процедура ТипДокументаИВидОперации(ИмяКоманды, Результат) Экспорт
	
	Результат = Новый Структура("ТипДокумента, ВидОперации");
	
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "Форма", "");
	Если ИмяКоманды = "СоздатьРеализацияПродажаКомиссия" Тогда
		Результат.ТипДокумента = "РасходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
	ИначеЕсли ИмяКоманды = "СоздатьРеализацияТовары" Тогда
		Результат.ТипДокумента = "РасходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
	ИначеЕсли ИмяКоманды = "СоздатьРеализацияУслуги" Тогда
		Результат.ТипДокумента = "РасходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
		
	ИначеЕсли ИмяКоманды = "СоздатьПоступлениеПокупкаКомиссия" Тогда
		Результат.ТипДокумента = "ПриходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
	ИначеЕсли ИмяКоманды = "СоздатьПоступлениеТовары" Тогда
		Результат.ТипДокумента = "ПриходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
	ИначеЕсли ИмяКоманды = "СоздатьПоступлениеУслуги" Тогда
		Результат.ТипДокумента = "ПриходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
	Иначе
		Результат = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

Процедура ТипДокументаИВидОперацииДляДокументаПоУмолчанию(Направление, ТипДокумента, Результат) Экспорт
		
	Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий") Тогда
		Результат.ТипДокумента = "ПриходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
	Иначе
		Результат.ТипДокумента = "РасходнаяНакладная";
		Результат.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
	КонецЕсли;
		
КонецПроцедуры

Процедура ПодходящиеТипыРаспознанногоДокумента(ТипДокумента, Результат) Экспорт
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
		Или ТипДокумента = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату"));
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриходнаяНакладная")
		Или ТипДокумента = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.ТОРГ12"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД"));
		// Т.к. поступление или реализацию можно создать по распознанной СФ
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура"));
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураПолученный")
		Или ТипДокумента = Тип("ДокументСсылка.СчетФактура") Тогда
		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаполненииПараметровВыбораДоговора(ДокументОбъект, ПараметрыВыбораДоговора) Экспорт
	
	ВидыДоговоров = Новый Массив;
	Если ДокументОбъект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СПокупателем"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СКомиссионером"));
	Иначе
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СПоставщиком"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СКомитентом"));
	КонецЕсли;
	
	ПараметрыВыбораДоговора.Вставить("ВидыДоговоров", ВидыДоговоров);
	
КонецПроцедуры

Процедура ОбязательныеРеквизитыПодчиненногоДокумента(ЭтотТипДокумента1С, ТипИВид, Реквизиты) Экспорт

	Если ЭтотТипДокумента1С = Тип("ДокументСсылка.ПриходнаяНакладная")
		Или ЭтотТипДокумента1С = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Реквизиты.Вставить("НомерДокумента");
		Реквизиты.Вставить("ДатаДокумента");
		Если ТипИВид.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика")
			Или ТипИВид.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию")
			Или ТипИВид.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
			Или ТипИВид.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию") Тогда
			
			Реквизиты.Вставить("Склад");
		КонецЕсли;
		
	ИначеЕсли ЭтотТипДокумента1С = Тип("ДокументСсылка.СчетФактураПолученный")
		Или ЭтотТипДокумента1С = Тип("ДокументСсылка.СчетФактура") Тогда
		
		Реквизиты.Вставить("НомерДокумента");
		Реквизиты.Вставить("ДатаДокумента");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти