#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеСервисы = Параметры.ДоступныеСервисы;
	Если ДоступныеСервисы = Неопределено Тогда
		ДоступныеСервисы = СервисДоставкиВызовСервера.ДоступныеСервисыДоставки();
	КонецЕсли;
	
	СписокВыбора = Элементы.ТипГрузоперевозки.СписокВыбора;
	Для Каждого Сервис Из ДоступныеСервисы Цикл
		СписокВыбора.Добавить(Сервис, СервисДоставкиКлиентСервер.ПредставлениеТипаГрузоперевозки(Сервис));
	КонецЦикла;
	
	Если Элементы.ТипГрузоперевозки.СписокВыбора.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет доступных сервисов доставки.'"), , , , Отказ);
	Иначе
		ТипГрузоперевозки = СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ТипГрузоперевозки.СписокВыбора.Количество() = 1 Тогда
		
		ТипГрузоперевозки = Элементы.ТипГрузоперевозки.СписокВыбора[0].Значение;
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("ТипГрузоперевозки", ТипГрузоперевозки);
		Закрыть(ПараметрыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ТипГрузоперевозки", ТипГрузоперевозки);
	Закрыть(ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти
