///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Основание)
		Или Не ЗначениеЗаполнено(Параметры.НастройкиОплатПоИдентификаторам) Тогда
		ВызватьИсключение НСтр("ru = 'Некорректные параметры формы.'");
		Возврат;
	КонецЕсли;
	
	Если Не ОнлайнЗаказы.НастройкаОнлайнЗаказовДоступна() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для создания страницы онлайн-заказов.'");
		Возврат;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	НастройкиОплатПоИдентификаторам = Параметры.НастройкиОплатПоИдентификаторам;
	Основание = Параметры.Основание;
	
	НеобходимВыборОрганизации = Ложь;
	ДоступенВыборОблачнойКассы = Ложь;
	НеобходимВыборОблачнойКассы = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы") Тогда
		МодульОблачныеКассы = ОбщегоНазначения.ОбщийМодуль("ОблачныеКассы");
		ДоступенВыборОблачнойКассы = МодульОблачныеКассы.ЧтениеНастроекПодключенияДоступно();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		МодульСистемаБыстрыхПлатежей = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежей");
		Элементы.ОтключитьКнопкуСБП.Видимость = МодульСистемаБыстрыхПлатежей.НастройкаПодключенияДоступна();
		Элементы.ДекорацияОтключитьСБП.Видимость = Ложь;
	Иначе
		Элементы.ОтключитьКнопкуСБП.Видимость= Ложь;
		Элементы.ДекорацияОтключитьСБП.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Наименование = Строка(Организация);
		Если ДоступенВыборОблачнойКассы Тогда
			НастройкиОблачныхКассОрганизации(Организация);
		КонецЕсли;
		НастройкиПодключенияПоНастройкеОплаты();
	Иначе
		НеобходимВыборОрганизации = Истина;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщаяИнформация;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияПользовательскоеСоглашениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:userAgreement" Тогда
		СтандартнаяОбработка = Ложь;
		МодульНастройкиПлатежныхСистемКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НастройкиПлатежныхСистемКлиент");
		МодульНастройкиПлатежныхСистемКлиент.ФормаПользовательскогоСоглашения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОткрытьНастройкуПодключенияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:onlineOrdersSettings" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(
			"Справочник.НастройкиПодключенияКОнлайнЗаказам.ФормаОбъекта",
			Новый Структура("Ключ, ЗапретИзмененияОрганизации", НастройкаПодключения, Истина));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПовторитьПопыткуОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "action:repeatSending" Тогда
		СтандартнаяОбработка = Ложь;
		ОбновитьСтраницуОнлайнЗаказов();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "action:repeatCreating" Тогда
		СтандартнаяОбработка = Ложь;
		СоздатьСтраницуОнлайнЗаказов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ДоступенВыборОблачнойКассы Тогда
		НастройкиОблачныхКассОрганизации(Организация);
	КонецЕсли;
	
	Если ПредставлениеНеРедактировалось Тогда
		Наименование = Строка(Организация);
	КонецЕсли;
	
	НастройкиПодключенияПоНастройкеОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(
		Элемент,
		ВыбранноеЗначение,
		ДополнительныеДанные,
		ВыборДобавлением,
		СтандартнаяОбработка)
	
	ПредставлениеНеРедактировалось = (Наименование = Строка(Организация));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиОблачныхКасс

&НаКлиенте
Процедура НастройкиОблачныхКассВыбор(
		Элемент,
		ВыбраннаяСтрока,
		Поле,
		СтандартнаяОбработка)
	
	Далее(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Отказ = Ложь;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщаяИнформация Тогда
		
		Если ОшибкаОтправкиВСервис Тогда
			ОбновитьСтраницуОнлайнЗаказов();
		ИначеЕсли ЗначениеЗаполнено(НастройкаПодключения) Тогда
			УстановитьОтображениеУспешногоЗавершения();
		ИначеЕсли НеобходимВыборОрганизации Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыПодключения;
			Заголовок = НСтр("ru = 'Параметры подключения'");
		ИначеЕсли НеобходимВыборОблачнойКассы Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборОблачнойКассы;
			Заголовок = НСтр("ru = 'Настройки фискализации'");
		Иначе
			СоздатьСтраницуОнлайнЗаказов();
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыПодключения Тогда
		
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Наименование"".'"),
				,
				,
				"Наименование");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Организация) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Организация"".'"),
				,
				,
				"Организация");
			Возврат;
		КонецЕсли;
		
		Если ОшибкаОтправкиВСервис Тогда
			ОбновитьСтраницуОнлайнЗаказов();
		ИначеЕсли ЗначениеЗаполнено(НастройкаПодключения) Тогда
			УстановитьОтображениеУспешногоЗавершения();
		ИначеЕсли НеобходимВыборОблачнойКассы Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборОблачнойКассы;
			Заголовок = НСтр("ru = 'Настройки фискализации'");
		Иначе
			
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборОблачнойКассы Тогда
		
		Отказ = Ложь;
		НастройкаОблачнойКассы = Неопределено;
		
		Если Элементы.НастройкиОблачныхКасс.ТекущаяСтрока = Неопределено Тогда
			Отказ = Истина;
		Иначе
			СтрокаНастройкиОблачныхКасс = НастройкиОблачныхКасс.НайтиПоИдентификатору(
				Элементы.НастройкиОблачныхКасс.ТекущаяСтрока);
			Если СтрокаНастройкиОблачныхКасс = Неопределено Тогда
				Отказ = Истина;
			Иначе
				НастройкаОблачнойКассы = СтрокаНастройкиОблачныхКасс.НастройкаПодключения;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не выбрана облачная касса для фискализации онлайн-заказов.'"),
				,
				,
				"НастройкиОблачныхКасс");
			Возврат;
		КонецЕсли;
		
		СоздатьСтраницуОнлайнЗаказов();
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультат Тогда
		
		Если ОтключитьКнопкуСБП Тогда
			ОтключитьКнопкуСБП();
		КонецЕсли;
		
		Закрыть(НастройкаПодключения);
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыПодключения Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщаяИнформация;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборОблачнойКассы Тогда
		Если НеобходимВыборОрганизации Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыПодключения;
			Заголовок = НСтр("ru = 'Параметры подключения'");
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщаяИнформация;
			Заголовок = НСтр("ru = 'Настройка подключения к Онлайн-заказам'");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НастройкиОплат(НастройкиОплатПоИдентификаторам)
	
	НастройкиОплат = Новый Соответствие;
	
	Для Каждого НастройкаОплатыПоИдентификатору Из НастройкиОплатПоИдентификаторам Цикл
		
		Если Не ЗначениеЗаполнено(НастройкаОплатыПоИдентификатору.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкиОплат.Вставить(
			ОнлайнЗаказыСлужебный.СпособОплатыПоИдентификатору(НастройкаОплатыПоИдентификатору.Ключ),
			НастройкаОплатыПоИдентификатору.Значение);
		
	КонецЦикла;
	
	Возврат НастройкиОплат;
	
КонецФункции

&НаСервере
Процедура НастройкиПодключенияПоНастройкеОплаты()
	
	НастройкиОплат = НастройкиОплат(НастройкиОплатПоИдентификаторам);
	
	Для Каждого НастройкаОплаты Из НастройкиОплат Цикл
		НастройкаОплатыОнлайнЗаказов = НастройкаОплаты.Значение;
	КонецЦикла;
	
	НастройкиПодключения = ОнлайнЗаказыСлужебный.НастройкиПодключенияПоНастройкеОплаты(
		НастройкаОплатыОнлайнЗаказов,
		Организация,
		Ложь);
	
	Если НастройкиПодключения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаПодключения = НастройкиПодключения[0];
	ОшибкаОтправкиВСервис = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		НастройкаПодключения,
		"ОшибкаСинхронизации");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщаяИнформация Тогда
		Элементы.Назад.Видимость = Ложь;
		Элементы.Далее.Видимость = Истина;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыПодключения Тогда
		Элементы.Назад.Видимость = Истина;
		Элементы.Далее.Видимость = Истина;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборОблачнойКассы Тогда
		Элементы.Назад.Видимость = Истина;
		Элементы.Далее.Видимость = Истина;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДлительнаяОперация Тогда
		Элементы.Назад.Видимость = Ложь;
		Элементы.Далее.Видимость = Ложь;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультат Тогда
		Если ЗначениеЗаполнено(НастройкаПодключения)
			И Не ОшибкаОтправкиВСервис Тогда
			Элементы.Назад.Видимость  = Ложь;
			Элементы.Далее.Видимость  = Истина;
			Элементы.Далее.Заголовок  = НСтр("ru = 'OK'");
		Иначе
			Элементы.Назад.Видимость  = Ложь;
			Элементы.Далее.Видимость  = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкиОблачныхКассОрганизации(Знач Организация)
	
	НастройкиОблачныхКасс.Очистить();
	
	МодульОблачныеКассыВызовСервера = ОбщегоНазначения.ОбщийМодуль("ОблачныеКассыВызовСервера");
	НастройкиОблачныхКассОрганизации = МодульОблачныеКассыВызовСервера.НастройкиОблачныхКассОрганизации(Организация);
	
	Для Каждого НастройкаОблачнойКассыОрганизации Из НастройкиОблачныхКассОрганизации Цикл
		Если Не ЗначениеЗаполнено(НастройкаОблачнойКассыОрганизации.Значение) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НастройкиОблачныхКасс.Добавить();
		НоваяСтрока.ОблачнаяКасса = НастройкаОблачнойКассыОрганизации.Ключ;
		НоваяСтрока.НастройкаПодключения = НастройкаОблачнойКассыОрганизации.Значение;
	КонецЦикла;
	
	Если НастройкиОблачныхКасс.Количество() = 0 Тогда
		НеобходимВыборОблачнойКассы = Ложь;
		НастройкаОблачнойКассы = Неопределено;
	ИначеЕсли НастройкиОблачныхКасс.Количество() = 1 Тогда
		НеобходимВыборОблачнойКассы = Ложь;
		НастройкаОблачнойКассы = НастройкиОблачныхКасс[0].НастройкаПодключения;
	Иначе
		НеобходимВыборОблачнойКассы = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтраницуОнлайнЗаказов()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	РезультатСоздания = СоздатьСтраницуОнлайнЗаказовЗапускЗадания();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"СоздатьСтраницуОнлайнЗаказовЗавершение",
		ЭтотОбъект);
		
	Если РезультатСоздания.Статус = "Выполнено" Или РезультатСоздания.Статус = "Ошибка" Тогда
		СоздатьСтраницуОнлайнЗаказовЗавершение(
			РезультатСоздания,
			Неопределено);
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДлительнаяОперация;
	Заголовок = НСтр("ru = 'Создание страницы'");
	Элементы.ДекорацияСостояние.Заголовок = НСтр("ru = 'Создание страницы онлайн-заказов, пожалуйста, подождите.'");
	
	УстановитьВидимостьДоступность();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатСоздания,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СоздатьСтраницуОнлайнЗаказовЗапускЗадания()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Создание страницы онлайн-заказов.'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.НоваяНастройкаПодключения",
		Организация,
		НастройкиОплат(НастройкиОплатПоИдентификаторам),
		НастройкаОблачнойКассы);
	
КонецФункции

&НаКлиенте
Процедура СоздатьСтраницуОнлайнЗаказовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		НастройкаПодключения = РезультатОперации.Ссылка;
		ОшибкаОтправкиВСервис = РезультатОперации.ОшибкаОтправкиВСервис;
		
		Если ЗначениеЗаполнено(РезультатОперации.СообщениеОбОшибке) Тогда
			УстановитьОтображениеИнформацииОбОшибке(
				РезультатОперации.СообщениеОбОшибке,
				Ложь,
				Ложь);
		Иначе
			УстановитьОтображениеУспешногоЗавершения()
		КонецЕсли;
		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ДанныеОшибки = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(
			Результат.ИнформацияОбОшибке,
			НСтр("ru = 'Ошибка создания страницы онлайн-заказов.'"));
		ИнформацияОбОшибке = ДанныеОшибки.Текст;
		УстановитьОтображениеИнформацииОбОшибке(
			ИнформацияОбОшибке,
			Истина,
			Истина);
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницуОнлайнЗаказов()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	РезультатВыполнения = ОбновитьСтраницуОнлайнЗаказовЗапускЗадания();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОбновитьСтраницуОнлайнЗаказовЗавершение",
		ЭтотОбъект);
		
	Если РезультатВыполнения.Статус = "Выполнено" Или РезультатВыполнения.Статус = "Ошибка" Тогда
		ОбновитьСтраницуОнлайнЗаказовЗавершение(
			РезультатВыполнения,
			Неопределено);
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДлительнаяОперация;
	Заголовок = НСтр("ru = 'Отправка настроек онлайн-заказов'");
	Элементы.ДекорацияСостояние.Заголовок = НСтр("ru = 'Отправка настроек онлайн-заказов в сервис, пожалуйста, подождите.'");
	
	УстановитьВидимостьДоступность();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьСтраницуОнлайнЗаказовЗапускЗадания()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Обновление настроек Онлайн-заказов в сервисе.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ОбновитьНастройку",
		НастройкаПодключения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтраницуОнлайнЗаказовЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если ЗначениеЗаполнено(РезультатОперации.СообщениеОбОшибке) Тогда
			УстановитьОтображениеИнформацииОбОшибке(
				РезультатОперации.СообщениеОбОшибке,
				Ложь,
				Ложь);
		Иначе
			ОшибкаОтправкиВСервис = Ложь;
			УстановитьОтображениеУспешногоЗавершения()
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ДанныеОшибки = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(
			Результат.ИнформацияОбОшибке,
			НСтр("ru = 'Ошибка обновления настройки онлайн-заказов в сервисе.'"));
		
		ПоказатьПредупреждение(
			Неопределено,
			ДанныеОшибки.Текст);
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеУспешногоЗавершения()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультат;
	Элементы.ГруппаУспешноеСоздание.Видимость = Истина;
	Элементы.ГруппаОшибкаСоздания.Видимость = Ложь;
	Элементы.ДекорацияКартинкаРезультат.Картинка = БиблиотекаКартинок.Успешно32;
	Элементы.ДекорацияОписаниеРезультата.Заголовок = НСтр("ru = 'Настройка онлайн-заказов выполнена.'");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеИнформацииОбОшибке(
		Знач ИнформацияОбОшибке,
		Знач Ошибка = Ложь,
		Знач ОтображатьЖР = Ложь)
	
	Если ОтображатьЖР Тогда
		ПредставлениеОшибки = СтроковыеФункции.ФорматированнаяСтрока(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|
					|
					|Подробную информацию см. в <a href = ""open:log"">Журнале регистрации</a>.'"),
				ИнформацияОбОшибке));
		
	Иначе
		ПредставлениеОшибки = ИнформацияОбОшибке;
	КонецЕсли;
	
	Элементы.ДекорацияПовторитьПопытку.Видимость = Истина;
	
	Если ОшибкаОтправкиВСервис Тогда
		Элементы.ДекорацияПовторитьПопытку.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<a href = ""action:repeatSending"">Повторить отправку</a> настроек онлайн-заказов в сервис.'"));
	ИначеЕсли Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
				Элементы.ДекорацияПовторитьПопытку.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<a href = ""action:repeatCreating"">Повторить создание</a> страницы онлайн-заказов.'"));
	Иначе
		Элементы.ДекорацияПовторитьПопытку.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница        = Элементы.ГруппаРезультат;
	Элементы.ГруппаУспешноеСоздание.Видимость      = Ложь;
	Элементы.ГруппаОшибкаСоздания.Видимость        = Истина;
	Элементы.ДекорацияОписаниеРезультата.Заголовок = ПредставлениеОшибки;
	Элементы.ДекорацияКартинкаРезультат.Картинка   = ?(Ошибка,
		БиблиотекаКартинок.Ошибка32,
		БиблиотекаКартинок.Предупреждение32);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьКнопкуСБП()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		МодульНастройкиПлатежныхСистемСлужебный = ОбщегоНазначения.ОбщийМодуль("НастройкиПлатежныхСистемСлужебный");
		МодульНастройкиПлатежныхСистемКлиентСервер = ОбщегоНазначения.ОбщийМодуль("НастройкиПлатежныхСистемКлиентСервер");
		УстановитьПривилегированныйРежим(Истина);
		МодульНастройкиПлатежныхСистемСлужебный.ОтключитьКомандыПодсистемы(
			МодульНастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП());
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти