#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПриКопировании объекта.
//
Процедура ПриКопировании(ОбъектКопирования)

	ВызватьИсключение НСтр("ru ='Для документа счет-фактура копирование не предусмотрено'");

КонецПроцедуры // ПриКопировании()

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И Не ДанныеЗаполнения.Свойство("Ссылка") Тогда

		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

		ДозаполнитьРеквизитыСводныхСправок();

	ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения) Или (ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений")) Тогда

		ЗаполнитьДокументыОснования(ДанныеЗаполнения);
		ВыполнитьОбработкуЗаполнения();
		ДозаполнитьРеквизитыСводныхСправок();
//		ЗаполнитьТаблицуАвансы();

	Иначе

		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();

	КонецЕсли;

	Если ЭтоВозврат <> Перечисления.ДаНет.Да Тогда

		ЭтоВозврат = Перечисления.ДаНет.Нет;

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КодВидаОперации) Тогда
		КодВидаОперации = Документы.СчетФактура.ПолучитьКодВидаОперации(ЭтотОбъект);
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийСчетФактура.СводнаяСправка
		И НЕ ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка
		И НЕ ЗначениеЗаполнено(ДатаВыставления) Тогда
		ВыставленСтатус = 2;
		ДатаВыставления = ?(Не ЗначениеЗаполнено(Дата), ТекущаяДатаСеанса(), Дата);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Исправление Тогда

		ПроверяемыеРеквизиты.Добавить("НомерИсправления");
		ПроверяемыеРеквизиты.Добавить("ДатаИсправления");

	КонецЕсли;

	Если ДокументыОснования.Количество() < 1 Тогда

		НеобходимоЗаполнитьДокументы = НСтр(
			"ru = 'Необходимо заполнить документы, которые являются основаниями счета-фактуры.'");
		ОбщегоНазначения.СообщитьПользователю(НеобходимоЗаполнитьДокументы, ЭтотОбъект, , , Отказ);

	Иначе

		Для Каждого СтрокаТаблицы Из ДокументыОснования Цикл

			ДокументОснование = СтрокаТаблицы.ДокументОснование;

			Если ЗначениеЗаполнено(ДокументОснование) И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,
				"Проведен") Тогда

				ДокументОснованиеНеПроведен = СтрШаблон(НСтр(
					"ru = 'Документ-основание %1 № %2 от %3 не проведен. Проведение счет фактуры невозможно.'"), ТипЗнч(
					ДокументОснование), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Номер"), Формат(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата"), "ДЛФ=D;"));
				ОбщегоНазначения.СообщитьПользователю(ДокументОснованиеНеПроведен, ЭтотОбъект, , , Отказ);

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизитДоговор(ПроверяемыеРеквизиты, ЭтотОбъект);

	Если ТребуетсяОтразитьСуммыДокументаВНациональнойВалюте() Тогда

		Если ДокументыОснования.Количество() = 1 И Не ЗначениеЗаполнено(ДокументыОснования[0].ДокументОснование) Тогда

			НеВыбранДокументОснование = НСтр("ru = 'Не выбран документ-основание.'");
			ОбщегоНазначения.СообщитьПользователю(НеВыбранДокументОснование, ЭтотОбъект, , , Отказ);

		КонецЕсли;

	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса Тогда

		ИмяСписка = НСтр("ru = 'Расшифровка аванса'");
		Для Каждого СтрокаАвансы Из Авансы Цикл

			ИндексСтроки = Формат(СтрокаАвансы.НомерСтроки - 1, "ЧН=0; ЧГ=");
			Если СтрокаАвансы.СуммаДоКорректировки > СтрокаАвансы.Сумма Тогда

				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность", НСтр(
					"ru = 'Сумма'"), СтрокаАвансы.НомерСтроки, ИмяСписка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, СтрШаблон("Авансы[%1].Сумма",
					ИндексСтроки), "Объект", Отказ);

			КонецЕсли;

			Если СтрокаАвансы.СуммаНДСДоКорректировки > СтрокаАвансы.СуммаНДС Тогда

				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность", НСтр(
					"ru = 'Сумма НДС'"), СтрокаАвансы.НомерСтроки, ИмяСписка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, СтрШаблон("Авансы[%1].СуммаНДС",
					ИндексСтроки), "Объект", Отказ);

			КонецЕсли;

		КонецЦикла;

	Иначе

		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Авансы.КорректируемыйСчетФактура");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Авансы.СуммаДоКорректировки");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Авансы.СтавкаНДСДоКорректировки");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Авансы.СуммаНДСДоКорректировки");

	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.СводнаяСправка Или ВидОперации
		= Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Тогда
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;

	ИменаТабличныхЧастей = Новый Массив;
	ИменаТабличныхЧастей.Добавить("УдалитьЗапасы");

	ГрузовыеТаможенныеДекларацииСервер.ПриОбработкеПроверкиЗаполнения(Отказ, ЭтотОбъект, ИменаТабличныхЧастей);

КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыРеализации = Новый Массив;
	ТипыРеализации.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ТипыРеализации.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ТипыРеализации.Добавить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"));
	ТипыРеализации.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	ТипыРеализации.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	ТипыРеализации.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	МассивОснованийРеализации = Новый Массив;
	 
	// Проверка на уникальность счета-фактуры
	Для Каждого СтрокаОснование Из ДокументыОснования Цикл
		
		Если ТипыРеализации.Найти(ТипЗнч(СтрокаОснование.ДокументОснование)) <> Неопределено Тогда 
			МассивОснованийРеализации.Добавить(СтрокаОснование.ДокументОснование);
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Или (ТипЗнч(СтрокаОснование.ДокументОснование)
			= Тип("ДокументСсылка.КорректировкаРеализации") И ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс) Тогда
			Продолжить;
		КонецЕсли;

		ДокументОснование = СтрокаОснование.ДокументОснование;
		Если ЗначениеЗаполнено(ДокументОснование) И Не ТипЗнч(ДокументОснование) = Тип(
			"ДокументСсылка.ОтчетКомиссионера") И Не ТипЗнч(ДокументОснование) = Тип(
			"ДокументСсылка.ПодтверждениеНулевойСтавкиНДС") Тогда

			НайденныйСчетФактура = СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(ДокументОснование);
			Если ЗначениеЗаполнено(НайденныйСчетФактура) И НайденныйСчетФактура.Ссылка <> Ссылка Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Для документа ""%1"" 
												|уже введен счет-фактура ""%2"". 
												|Запись еще одного документа ""счет-фактура"" не допускается.'"),
					ДокументОснование, НайденныйСчетФактура.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДокументОснование", , Отказ);
			КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип(
			"ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда

			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				НовыйСтатус = Перечисления.СтатусыСчетаФактуры.Проведен;
			Иначе
				НовыйСтатус = Перечисления.СтатусыСчетаФактуры.НеПроведен;
			КонецЕсли;

			Если ЗначениеЗаполнено(НомерНаПечать) Тогда
				НомерДляРегистра = НомерНаПечать;
			Иначе
				Если ЭтоНовый() И Не ЗначениеЗаполнено(Номер) Тогда
					УстановитьНовыйНомер();
				КонецЕсли;
				НомерДляРегистра = РаботаСФормойДокументаКлиентСервер.ПолучитьКороткийНомерДокумента(Номер);
			КонецЕсли;

			РегистрыСведений.СтатусыДокументов.УстановитьСтатусСчетаФактурыДокумента(ДокументОснование,
				НомерДляРегистра, НовыйСтатус);

		КонецЕсли;

	КонецЦикла;
	
    //НДС
	Если ДокументыОснования.Количество() > 0 Тогда
		ДокументОснование = ДокументыОснования[0].ДокументОснование;
	Иначе
		ДокументОснование = Неопределено;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ГрупповоеПерепроведение") И ДополнительныеСвойства.ГрупповоеПерепроведение Тогда

		Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс И УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, Дата)
			И (Авансы.Количество() = 1 Или Авансы.Количество() = 0) Тогда
			СуммыДокументовОснований = Новый Структура;

			СуммыДокументовОснований.Вставить("СуммаДокумента", 0);
			СуммыДокументовОснований.Вставить("СуммаНДСДокумента", 0);
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда

            Авансы.Очистить();
				ЗаполнитьСуммуДокументаАвансПоКорректировке(ДокументОснование, СуммыДокументовОснований);

			ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеВКассу") Или ТипЗнч(ДокументОснование)
				= Тип("ДокументСсылка.ПоступлениеНаСчет") Или ТипЗнч(ДокументОснование) = Тип(
				"ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
				Авансы.Очистить();
				ЗаполнитьСуммуДокументаПоАвансу(ДокументОснование, СуммыДокументовОснований);
				ЗаполнитьРасшифровкуАванса(ДокументОснование, СуммыДокументовОснований);
			КонецЕсли;
			
			Если СуммаНДСДокумента <> СуммыДокументовОснований.СуммаНДСДокумента
			ИЛИ СуммаДокумента <> СуммыДокументовОснований.СуммаДокумента Тогда
	
			    ЗаполнитьЗначенияСвойств(ЭтотОбъект, СуммыДокументовОснований);
			КонецЕсли;
			
		КонецЕсли;
		
		КодВидаОперацииОснованияУменьшение = "";
		Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка Тогда
			ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Дата);
			Если ВерсияКодовВидовОпераций > 1 Тогда
				Если КодВидаОперацииОснованияУменьшение <> "" Тогда
					КодВидаОперацииНаУменьшение = КодВидаОперацииОснованияУменьшение;
				Иначе
					Если ЗначениеЗаполнено(Договор) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,
						"УчетАгентскогоНДСПокупателем") Тогда
						КодВидаОперацииНаУменьшение = "34";
					Иначе
						КодВидаОперацииНаУменьшение = "18";
					КонецЕсли;
				КонецЕсли;
			Иначе
				КодВидаОперацииНаУменьшение = "";
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	//НДС

	ЗаполнениеОбъектовУНФ.ЗаполнитьДоговорПоУмолчанию(ЭтотОбъект);
	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.Продажа
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка Тогда
		ОбновитьСуммыДокумента(МассивОснованийРеализации);
	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Тогда
		
		Если СуммаДокумента <> 0 И СуммаУменьшение = 0 Тогда
			СуммаУменьшение = СуммаДокумента;
			СуммаНДСУменьшение = СуммаНДСДокумента;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИсправляемыйСчетФактура) Тогда
			РеквизитыИсправляемого = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсправляемыйСчетФактура, "Номер, Дата");
			Если РеквизитыИсправляемого.Номер = НомерИсходногоДокумента Тогда
				ДозаполнитьРеквизитыСводныхСправок();
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("НеобходимоОтразитьСчетФактуройЗапасыВРазрезеГТД",
		ТребуетсяОтразитьСчетФактуройЗапасыВРазрезеГТД());
	ДополнительныеСвойства.Вставить("ТребуетсяОтразитьСуммыДокументаВНациональнойВалюте",
		ТребуетсяОтразитьСуммыДокументаВНациональнойВалюте());
	
	// Взаиморасчеты
	РасчетыПроведениеДокументов.ИнициализироватьДополнительныеСвойстваДляПроведения(ЭтотОбъект, ДополнительныеСвойства,
		Отказ, Ложь);
	
	// Инициализация данных документа.
	Документы.СчетФактура.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыВРазрезеГТД", ТаблицыДляДвижений, Движения, Отказ);
	
	// Суммы документов регламентированный учет
	ПроведениеДокументовУНФ.ОтразитьДвижения("СуммыДокументовРегламентированныйУчет", ТаблицыДляДвижений, Движения,
		Отказ);
    
    // НДС
	ПроведениеДокументовУНФ.ОтразитьДвижения("НДСЗаписиКнигиПродаж", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("НДСАвансыПолученные", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЖурналУчетаСчетовФактур", ТаблицыДляДвижений, Движения, Отказ); 
    // НДС
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.СчетФактура.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);

	ПроведениеДокументовУНФ.ЗакрытьМенеджерВременныхТаблиц(ЭтотОбъект);

КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.СчетФактура.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);

КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не (ПолучитьФункциональнуюОпцию("ПередачаТоваровНаКомиссию") Или ПолучитьФункциональнуюОпцию(
		"ПриемТоваровНаКомиссию") Или ПолучитьФункциональнуюОпцию("ИспользуетсяОСНО")) Тогда

		УстановитьПривилегированныйРежим(Истина);
		Константы.ФункциональнаяОпцияИспользоватьСчетаФактурыИсходящие.Установить(Истина);
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТребуетсяОтразитьСчетФактуройЗапасыВРазрезеГТД()

	Возврат ГрузовыеТаможенныеДекларацииСервер.НеобходимоОтразитьСчетФактуройЗапасыВРазрезеГТД(Ссылка);

КонецФункции

Функция ТребуетсяОтразитьСуммыДокументаВНациональнойВалюте()

	Если УдалитьЗапасы.Количество() < 1 Тогда

		Возврат Ложь;

	КонецЕсли;

	Возврат (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетФактура.Продажа") Или ВидОперации
		= ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетФактура.Корректировка"))
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "РасчетыВУсловныхЕдиницах") И ВалютаДокумента
		<> Константы.НациональнаяВалюта.Получить() И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВалютаРасчетов")
		<> Константы.НациональнаяВалюта.Получить();

КонецФункции

Процедура ОбновитьСуммыДокумента(ДокументыОснования)

	// Реквизиты СуммаДокумента и СуммаНДСДокумента не заполняем: нужно обновить новые реквизиты сумм,
	// которые могут быть незаполнены
	СуммыДокументов = СуммыДокументовОснований();
	СуммыДокументов.Удалить("СуммаДокумента");
	СуммыДокументов.Удалить("СуммаНДСДокумента");
	
	Для Каждого Элемент Из СуммыДокументов Цикл
		Если ЭтотОбъект[Элемент.Ключ] <> 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

	// 	Обрабатываем только корректировочные документы и документы, содержащие товары на комиссии
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
	Запрос.Текст = "ВЫБРАТЬ
	|	Запасы.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ ВТРегистраторы
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|		ПО Запасы.Партия = ПартииНоменклатуры.Ссылка
	|		И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|		И Запасы.Регистратор В (&ДокументыОснования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка В (&ДокументыОснования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В (&ДокументыОснования)
	|	И ПриходнаяНакладная.ПокупателюВыставляетсяКорректировочныйСчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомиссионера.Ссылка
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Ссылка В (&ДокументыОснования)
	|	И ОтчетКомиссионера.НаВозвратыВыставляетсяКорректировочныйСчетФактура
	|	И ОтчетКомиссионера.СуммаДокументаВозврат > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРегистраторы.Ссылка,
	|	ТИПЗНАЧЕНИЯ(ВТРегистраторы.Ссылка) КАК ТипСсылки
	|ИЗ
	|	ВТРегистраторы КАК ВТРегистраторы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДокументыПоТипам = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СписокДокументов = ДокументыПоТипам.Получить(Выборка.ТипСсылки);
		Если СписокДокументов = Неопределено Тогда
			СписокДокументов = Новый Массив;
			ДокументыПоТипам.Вставить(Выборка.ТипСсылки, СписокДокументов);
		КонецЕсли; 
		СписокДокументов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Заказы = ДокументыПоТипам.Получить(Тип("ДокументСсылка.ЗаказПокупателя"));
	Если Заказы <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаСуммыЗаказПокупателя();
		ЗаполнитьСуммыДокументов(ТекстЗапроса, Заказы, СуммыДокументов);
	КонецЕсли;

	Корректировки = ДокументыПоТипам.Получить(Тип("ДокументСсылка.КорректировкаРеализации"));
	Если Корректировки <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаСуммыКорректировкаРеализации();
		ЗаполнитьСуммыДокументов(ТекстЗапроса, Корректировки, СуммыДокументов);
	КонецЕсли;

	ВозвратыПокупателя = ДокументыПоТипам.Получить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	Если ВозвратыПокупателя <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаСуммыПриходнаяНакладная();
		ЗаполнитьСуммыДокументов(ТекстЗапроса, ВозвратыПокупателя, СуммыДокументов);
	КонецЕсли;

	Передачи = ДокументыПоТипам.Получить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"));
	Если Передачи <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаСуммДокумента(ТипЗнч(ДокументыОснования), "Запасы", Истина);
		ЗаполнитьСуммыДокументов(ТекстЗапроса, Передачи, СуммыДокументов);
	КонецЕсли;

	РасходныеНакладные = ДокументыПоТипам.Получить(Тип("ДокументСсылка.РасходнаяНакладная"));
	Если РасходныеНакладные <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаСуммыРасходнаяНакладная();
		ЗаполнитьСуммыДокументов(ТекстЗапроса, РасходныеНакладные, СуммыДокументов);
	КонецЕсли;
	
	ОтчетыКомиссионеров = ДокументыПоТипам.Получить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	Если ОтчетыКомиссионеров <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаСуммыОтчетКомиссионераКорректировка();
		ЗаполнитьСуммыДокументов(ТекстЗапроса, ОтчетыКомиссионеров, СуммыДокументов);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СуммыДокументов);
	
КонецПроцедуры

Функция СовместнаяРеализацияСобственныхИКомиссионныхТоваров(СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
	|	1 КАК ИндексЗапасов
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|	И (РасходнаяНакладнаяЗапасы.Партия = ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|			ИЛИ РасходнаяНакладнаяЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.СобственныеЗапасы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходнаяНакладнаяЗапасы.Ссылка,
	|	1
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Ссылка КАК Ссылка,
	|	Итог.ИндексЗапасов КАК ИндексЗапасов
	|ИЗ
	|	Итог КАК Итог
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.Ссылка,
	|	Итог.ИндексЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(Итог.ИндексЗапасов) = 2";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#Область ПроцедурыЗаполненияДокумента

Процедура ПроверитьДокументыОснованияСчетФактуры()
	
	Для Каждого ТекСтрока из ДокументыОснования Цикл

		Если ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации")
		И НЕ ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс Тогда

			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСтрока.ДокументОснование,
				"ДокументОснование, ВидОперации");

			Если ТипЗнч(РеквизитыОснования.ДокументОснование) = Тип("ДокументСсылка.АктОРасхожденияхПолученный") Тогда
				РеквизитыАктаОРасхождениях = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					РеквизитыОснования.ДокументОснование, "ДокументОснование");
				РеквизитыОснования.ДокументОснование = РеквизитыАктаОРасхождениях.ДокументОснование;
			КонецЕсли;

			Если СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(РеквизитыОснования.ДокументОснование) = Неопределено Тогда

				ШаблонТекст = НСтр(
					"ru = 'Перед добавлением %1 счета-фактуры создайте счет-фактуру у исправляемого документа'");

				ЭтоИсправление = (РеквизитыОснования.ВидОперации
					= Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
				ОписаниеВидаОперации = ?(ЭтоИсправление, НСтр("ru = 'исправления'"), НСтр("ru = 'корректировочного'"));

				ВызватьИсключение СтрШаблон(ШаблонТекст, ОписаниеВидаОперации);

			КонецЕсли;

		КонецЕсли;

		Если ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеВКассу") Или ТипЗнч(
			ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеНаСчет") Или ТипЗнч(
			ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда

			Если Не Документы.СчетФактура.ТребуетсяВводитьСчетФактуруНаАванс(ТекСтрока.ДокументОснование) Тогда
				ТекстИсключения = НСтр("ru = 'Для операции, которая выбрана в документе %1,
									   |создание счета-фактуры не требуется.'");

				ВызватьИсключение СтрШаблон(ТекстИсключения, СокрЛП(ТекСтрока.ДокументОснование));
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("СсылкаНаДокумент", ТекСтрока.ДокументОснование);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПлатежныйДокументРасшифровкаПлатежа.Договор КАК Договор,
			|  ПризнакАванса КАК ПризнакАванса
			|ИЗ
			|	Документ.%ТипДокумента%.РасшифровкаПлатежа КАК ПлатежныйДокументРасшифровкаПлатежа
			|ГДЕ
			|	ПлатежныйДокументРасшифровкаПлатежа.Ссылка = &СсылкаНаДокумент";

			Если ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеВКассу");
			ИначеЕсли ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеНаСчет");
			ИначеЕсли ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ОперацияПоПлатежнымКартам");
			КонецЕсли;
			ТаблицаРасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	
			ПараметрыОтбора = Новый Структура("ПризнакАванса", Истина);
			
			НайденныеСтроки = ТаблицаРасшифровкаПлатежа.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() < 1 Тогда

				ТекстИсключения = НСтр("ru = 'В документе %1 нет авансовых данных.
									   |Создание счета-фактуры не требуется.'");

				ВызватьИсключение СтрШаблон(ТекстИсключения, СокрЛП(ТекСтрока.ДокументОснование));

			КонецЕсли;

			Если ДополнительныеСвойства.Свойство("ЭтоСуммоваяРазница") Тогда

				ОтсутствуетДоговорУЕ = Истина;
				Для Каждого СтрокаРасшифровки Из ТаблицаРасшифровкаПлатежа Цикл

					ДоговорКонтрагента = СтрокаРасшифровки.Договор; //СправочникСсылка.ДоговорыКонтрагентов
					Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента,
						"РасчетыВУсловныхЕдиницах") Тогда

						ОтсутствуетДоговорУЕ = Ложь;
						Прервать;

					КонецЕсли;

				КонецЦикла;

				Если ОтсутствуетДоговорУЕ Тогда

					ТекстИсключения = НСтр("ru = 'Счет-фактура с видом операции Суммовые разницы формируется по договорам в У.Е.
										   |В документе %1 отсутствуют договоры в условных единицах.'");

					ВызватьИсключение СтрШаблон(ТекстИсключения, СокрЛП(ТекСтрока.ДокументОснование));

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		НеСправка = Не ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка И Не ВидОперации
			= Перечисления.ВидыОперацийСчетФактура.СводнаяСправка;
			
		НеКорректировкаНаАванс = Не (ТипЗнч(ТекСтрока.ДокументОснование) = Тип(
			"ДокументСсылка.КорректировкаРеализации") И ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс);
		
		НеОтчетКомиссионераНаАванс = Не (ТипЗнч(ТекСтрока.ДокументОснование) = Тип(
			"ДокументСсылка.ОтчетКомиссионера") И ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс);
		
		Если НеСправка И НеКорректировкаНаАванс И НеОтчетКомиссионераНаАванс Тогда

			НайденныйСчетФактура = СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(ТекСтрока.ДокументОснование);
			Если ЗначениеЗаполнено(НайденныйСчетФактура) И НайденныйСчетФактура.Ссылка <> Ссылка Тогда

				ШаблонТекст = НСтр("ru = 'Для документа ""%1"" 
								   |уже введен счет-фактура ""%2"".
								   |Запись еще одного документа ""Счет-фактура"" не допускается!'");

				ВызватьИсключение СтрШаблон(ШаблонТекст, ТекСтрока.ДокументОснование, НайденныйСчетФактура.Ссылка);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Добавить строку документа основания.
// 
// Параметры:
//  СсылкаНаДокументОснование - ДокументСсылка
//  НаименованиеДокументаОтгрузки - Строка
Процедура ДобавитьСтрокуДокументаОснования(СсылкаНаДокументОснование, НаименованиеДокументаОтгрузки = "")

	Если Не ОбщегоНазначения.ЗначениеСсылочногоТипа(СсылкаНаДокументОснование) Тогда

		ВызватьИсключение СтрШаблон(НСтр("ru ='Документ-основание должен быть ссылочного типа'"),
			СсылкаНаДокументОснование);

	КонецЕсли;
	
	КонтролироватьУникальностьСчетФактуры = Не (ТипЗнч(СсылкаНаДокументОснование) = Тип(
		"ДокументСсылка.ДокументРасчетовСКонтрагентом") Или (ТипЗнч(СсылкаНаДокументОснование) = Тип(
		"ДокументСсылка.КорректировкаРеализации") И ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс));

	ЭтоСинхронизация = ДополнительныеСвойства.Свойство("ЭтоСинхронизация");
	Если Не ЭтоСинхронизация И КонтролироватьУникальностьСчетФактуры
		И СсылкаНаДокументОснование.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда

		ВызватьИсключение СтрШаблон(НСтр("ru ='Для документа %1 ввод счета-фактуры не требуется'"),
			СсылкаНаДокументОснование);

	КонецЕсли;

	Если ДокументыОснования.Найти(СсылкаНаДокументОснование, "ДокументОснование") = Неопределено Тогда

		НоваяСтрока 							  = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование			  = СсылкаНаДокументОснование;
		НоваяСтрока.НаименованиеДокументаОтгрузки = НаименованиеДокументаОтгрузки;

	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументыОснования(ДанныеЗаполнения)

	ДокументыОснования.Очистить();
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда

		ДобавитьСтрокуДокументаОснования(ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда

		ЕстьНаименованиеДокумента = (ДанныеЗаполнения.Колонки.Найти("НаименованиеДокументаОтгрузки") <> Неопределено);
		Для Каждого СтрокаТаблицы Из ДанныеЗаполнения Цикл

			ДобавитьСтрокуДокументаОснования(СтрокаТаблицы.ДокументОснование, ?(ЕстьНаименованиеДокумента,
				СтрокаТаблицы.НаименованиеДокументаОтгрузки, ""));

		КонецЦикла;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("Ссылка") Тогда

			ДобавитьСтрокуДокументаОснования(ДанныеЗаполнения.Ссылка);

		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("ЭтоСуммоваяРазница") Тогда

			ДополнительныеСвойства.Вставить("ЭтоСуммоваяРазница", ДанныеЗаполнения.ЭтоСуммоваяРазница);

		КонецЕсли;

	КонецЕсли;

	ПроверитьДокументыОснованияСчетФактуры();

КонецПроцедуры

Процедура ЗаполнитьЗначениеСПроверкой(Приемник, Источник, ИмяРеквизита, ЗапретитьРазличия = Ложь)

	Если ТипЗнч(Источник) = Тип("ДокументСсылка.АктВыполненныхРабот") И ИмяРеквизита = "ПодписьКладовщика" Тогда

		Возврат;

	КонецЕсли;

	Если ЗапретитьРазличия И ЗначениеЗаполнено(Приемник[ИмяРеквизита]) Тогда

		Если Приемник[ИмяРеквизита] <> Источник[ИмяРеквизита] Тогда

			ВызватьИсключение СтрШаблон(НСтр("ru ='Ввод счета-фактуры по различающимся значениям запрещен (%1).'"),
				ИмяРеквизита);

		КонецЕсли;

		Приемник[ИмяРеквизита] = Источник[ИмяРеквизита];

	Иначе

		Приемник[ИмяРеквизита] = Источник[ИмяРеквизита];

	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьЗначенияДокументаВИтоговыеСуммы(ДанныеЗаполнения, СуммыДокументовОснований, СуммаДокументаОснования,
	СуммаНДСДокументаОснования)

	СуммыДокументовОснований.СуммаДокумента = СуммыДокументовОснований.СуммаДокумента + СуммаДокументаОснования;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммыДокументовОснований.СуммаНДСДокумента + СуммаНДСДокументаОснования;

	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда

		СуммыДокументовОснований.СуммаДокумента = СуммыДокументовОснований.СуммаДокумента - СуммаНДСДокументаОснования;

	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСуммыДокументаВИтоговыеСуммы(ИтоговыеСуммы, СуммыДокумента)

	Для Каждого Элемент Из СуммыДокумента Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ИтоговыеСуммы[Элемент.Ключ] = ИтоговыеСуммы[Элемент.Ключ] + Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область Реализация

Процедура ЗаполнитьСведенияШапкиПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований)

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Контрагент", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Договор", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");
	
	Если НЕ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьГлавногоБухгалтера");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьКладовщика");
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ОснованиеПечати");

		ВидОперацийВозвратов = Новый Массив;
		ВидОперацийВозвратов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику);
		ВидОперацийВозвратов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту);
		ВидОперацийВозвратов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки);
		ВидОперацийВозвратов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения);

		Если СведенияДокументовОснований.ЭтоВозврат <> Перечисления.ДаНет.Да Тогда

			СведенияДокументовОснований.ЭтоВозврат = ?(ВидОперацийВозвратов.Найти(
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидОперации"))
				= Неопределено, Перечисления.ДаНет.Нет, Перечисления.ДаНет.Да);

		КонецЕсли;
		
		// Прослеживаемость
		//@skip-check reading-attribute-from-database
		ЕстьПрослеживаемыеТовары = ДанныеЗаполнения.Запасы.Итог("ПрослеживаемыйТовар") > 0;
		СведенияДокументовОснований.ЕстьПрослеживаемыеТовары = Макс(
			СведенияДокументовОснований.ЕстьПрослеживаемыеТовары, ЕстьПрослеживаемыеТовары);
		// Конец Прослеживаемость
		
		Если СовместнаяРеализацияСобственныхИКомиссионныхТоваров(ДанныеЗаполнения) Тогда
			КодВидаОперации = "15";
		Иначе
			КодВидаОперации = "";
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда

		ДокументРеализацииСсылка = Документы.КорректировкаРеализации.ПолучитьИсправляемыйДокументРеализации(
			ДанныеЗаполнения, Истина);
		Если Не ПустаяСтрока(ДокументРеализацииСсылка.ОснованиеПечати) Тогда

			СведенияДокументовОснований.ОснованиеПечати = ДокументРеализацииСсылка.ОснованиеПечати;

		КонецЕсли;

		СведенияДокументовОснований.Вставить("ИсправляемыйСчетФактура", Неопределено);
		СведенияДокументовОснований.Вставить("ВидОперации", Неопределено);
		СведенияДокументовОснований.Вставить("НомерИсходногоДокумента", Неопределено);
		СведенияДокументовОснований.Вставить("ДатаИсходногоДокумента", Неопределено);
		СведенияДокументовОснований.Вставить("НомерИсправляемогоКорректировочногоДокумента", Неопределено);
		СведенияДокументовОснований.Вставить("ДатаИсправляемогоКорректировочногоДокумента", Неопределено);
		СведенияДокументовОснований.Вставить("НомерИсправления", Неопределено);
		СведенияДокументовОснований.Вставить("Исправление", Неопределено);
		СведенияДокументовОснований.Вставить("УчитыватьИсправлениеИсходногоДокумента", Неопределено);
		СведенияДокументовОснований.Вставить("НомерИсправленияИсходногоДокумента", Неопределено);
		СведенияДокументовОснований.Вставить("ДатаИсправленияИсходногоДокумента", Неопределено);

		Если Не ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс Тогда
			
			РеквизитыКорректировки = Документы.СчетФактура.ПолучитьПараметрыЗаполненияКорректировочногоСчетаФактуры(
			ДанныеЗаполнения);
			
			Для Каждого ЭлементСтруктуры Из РеквизитыКорректировки Цикл
				
				Если СведенияДокументовОснований.Свойство(ЭлементСтруктуры.Ключ) Тогда
					
					СведенияДокументовОснований[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
					
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			СведенияДокументовОснований.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс;
		КонецЕсли;
		
	ИначеЕсли НЕ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ОснованиеПечати");

	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДатаНомерДокументовОплатыПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований)

	ВерсияПостановленияНДС1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата);

	Если ВерсияПостановленияНДС1137 >= 8 Тогда
		ТекДатаНомерДокументовОплаты = Документы.СчетФактура.ПолучитьДатаНомерДокументовОплаты(ДанныеЗаполнения);
	Иначе
		ТекДатаНомерДокументовОплаты = Документы.СчетФактура.АрхивныеАлгоритмыПолучитьДатаНомерДокументовОплаты(
			ДанныеЗаполнения);
	КонецЕсли;

	Если ТекДатаНомерДокументовОплаты <> Неопределено Тогда
		ДатаНомерДокументовОплаты.Загрузить(ТекДатаНомерДокументовОплаты);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСуммыДокументов(ТекстЗапроса, СписокДокументов, СуммыДокументовОснований)
	
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СписокДокументов)
		ИЛИ ТипЗнч(СписокДокументов) = Тип("Массив") И СписокДокументов.Количество() = 0 Тогда
			Возврат;
	КонецЕсли;
	
	СуммыДокументаПустые = СуммыДокументовОснований();
	СуммыДокумента = Новый Структура;
	Для Каждого Элемент Из СуммыДокументовОснований Цикл
		СуммыДокумента.Вставить(Элемент.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СписокДокументов);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СуммыДокумента, СуммыДокументаПустые);
		ЗаполнитьЗначенияСвойств(СуммыДокумента, Выборка);
		ДобавитьСуммыДокументаВИтоговыеСуммы(СуммыДокументовОснований, СуммыДокумента);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаПоРеализации(ДанныеЗаполнения, СуммыДокументовОснований)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда

		ТекстЗапроса = ТекстЗапросаСуммыРасходнаяНакладная();

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ТекстЗапроса = ТекстЗапросаСуммыКорректировкаРеализации();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда

		ТекстЗапроса = ТекстЗапросаСуммДокумента(ТипЗнч(ДанныеЗаполнения), "РаботыИУслуги", Ложь);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда

		ТекстЗапроса = ТекстЗапросаСуммДокумента(ТипЗнч(ДанныеЗаполнения), "Запасы", Истина);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда

		ТекстЗапроса = ТекстЗапросаСуммыЗаказПокупателя();
		// Суммы доставки - доставка в ЗН не автоматизирована.

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда

		ТекстЗапроса = ТекстЗапросаСуммыПриходнаяНакладная();
	
	Иначе
		
		ТекстЗапроса = "";
	КонецЕсли;

	ЗаполнитьСуммыДокументов(ТекстЗапроса, ДанныеЗаполнения, СуммыДокументовОснований);

КонецПроцедуры

Функция ТекстЗапросаСуммДокумента(ТипДокумента, ИмяТаблицы, ЕстьПартии)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ЛОЖЬ КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДокумента
	|ИЗ
	|	ТабличнаяЧасть КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ КАК Реквизиты
	|		ПО ТаблицаДокумента.Ссылка = Реквизиты.Ссылка
	|		И Реквизиты.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыДокумента.Ссылка КАК ДокументСсылка,
	|	СУММА(ВТСуммыДокумента.Сумма) КАК СуммаДокумента,
	|	СУММА(ВТСуммыДокумента.СуммаНДС) КАК СуммаНДСДокумента,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаДокументаКомиссия,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаНДСДокументаКомиссия
	|ИЗ
	|	ВТСуммыДокумента КАК ВТСуммыДокумента
	|СГРУППИРОВАТЬ ПО
	|	ВТСуммыДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДокумента";
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Документ = Метаданные.НайтиПоТипу(ТипДокумента);
	
	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[0];
	Выбор = ЗапросВыбора.Операторы[0];

	ИндексТаблицы = -1;
	ПсевдонимТаблица = "ТаблицаДокумента";
	ПсевдонимРеквизиты = "Реквизиты";
	Для Индекс = 0 По Выбор.Источники.Количество() - 1 Цикл
		
		Псевдоним = Выбор.Источники[Индекс].Источник.Псевдоним;
		Если Псевдоним = ПсевдонимТаблица Тогда
			ИмяТаблицыЗапроса = СтрШаблон("%1.%2", Документ.ПолноеИмя(), ИмяТаблицы);
			ИндексТаблицы = Индекс;
		ИначеЕсли Псевдоним = ПсевдонимРеквизиты Тогда
			ИмяТаблицыЗапроса = Документ.ПолноеИмя();
		Иначе
			Продолжить;
		КонецЕсли;
		
		Таблица = ЗапросВыбора.ДоступныеТаблицы.Найти(ИмяТаблицыЗапроса);
		Выбор.Источники.Заменить(Индекс, Таблица);
		Выбор.Источники[Индекс].Источник.Псевдоним = Псевдоним;
		
	КонецЦикла;
		
	Если Документ.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено Тогда
		Выбор.ВыбираемыеПоля[1] =  Новый ВыражениеСхемыЗапроса(
			"ВЫБОР
			|	КОГДА Реквизиты.СуммаВключаетНДС ТОГДА
			|		ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
			|	ИНАЧЕ ТаблицаДокумента.Сумма
			|КОНЕЦ");
	КонецЕсли;

	Если ЕстьПартии Тогда
		ИсточникПартии = Выбор.Источники.Добавить("Справочник.ПартииНоменклатуры", "ПартииНоменклатуры");
		Выбор.Источники[ИндексТаблицы].Соединения.Добавить(ИсточникПартии,
			"ТаблицаДокумента.Партия = ПартииНоменклатуры.Ссылка
			|И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)");
		Выбор.ВыбираемыеПоля[3] = Новый ВыражениеСхемыЗапроса("НЕ ПартииНоменклатуры.Статус ЕСТЬ NULL");
	КонецЕсли;
	
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаСуммыРасходнаяНакладная()
	
	Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.СуммаВключаетНДС
	|			ТОГДА РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.СуммаНДС
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	НЕ ПартииНоменклатуры.Статус ЕСТЬ NULL КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДокумента
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО РасходнаяНакладнаяЗапасы.Ссылка = РасходнаяНакладная.Ссылка
	|		И РасходнаяНакладная.Ссылка В (&Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|		ПО РасходнаяНакладнаяЗапасы.Партия = ПартииНоменклатуры.Ссылка
	|		И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.СуммаВключаетНДС
	|			ТОГДА РасходнаяНакладная.СтоимостьДоставки - РасходнаяНакладная.СуммаНДСДоставки
	|		ИНАЧЕ РасходнаяНакладная.СтоимостьДоставки
	|	КОНЕЦ,
	|	РасходнаяНакладная.СуммаНДСДоставки,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыДокумента.Ссылка КАК ДокументСсылка,
	|	СУММА(ВТСуммыДокумента.Сумма) КАК СуммаДокумента,
	|	СУММА(ВТСуммыДокумента.СуммаНДС) КАК СуммаНДСДокумента,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаДокументаКомиссия,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаНДСДокументаКомиссия
	|ИЗ
	|	ВТСуммыДокумента КАК ВТСуммыДокумента
	|СГРУППИРОВАТЬ ПО
	|	ВТСуммыДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДокумента";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСуммыКорректировкаРеализации()
	
	Текст = "ВЫБРАТЬ
	|    КорректировкаРеализации.Ссылка,
	|    КорректировкаРеализации.СуммаВключаетНДС,
	|    КорректировкаРеализации.СтоимостьДоставки,
	|    КорректировкаРеализации.СтоимостьДоставкиДоИзменения,
	|    КорректировкаРеализации.СтоимостьДоставкиДоКорректировки,
	|    КорректировкаРеализации.СуммаНДСДоставки,
	|    КорректировкаРеализации.СуммаНДСДоставкиДоИзменения,
	|    КорректировкаРеализации.СуммаНДСДоставкиДоКорректировки,
	|    КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) КАК
	|        ИсправлениеОшибки
	|ПОМЕСТИТЬ ВТДокумент
	|ИЗ
	|    Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|    КорректировкаРеализации.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    КорректировкаРеализации.Ссылка КАК Ссылка,
	|    КорректировкаРеализацииЗапасы.Сумма - ВЫБОР
	|        КОГДА КорректировкаРеализации.СуммаВключаетНДС
	|            ТОГДА КорректировкаРеализацииЗапасы.СуммаНДС
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК Сумма,
	|    КорректировкаРеализацииЗапасы.СуммаНДС КАК СуммаНДС,
	|    ВЫБОР
	|        КОГДА КорректировкаРеализации.ИсправлениеОшибки
	|            ТОГДА КорректировкаРеализацииЗапасы.СуммаДоКорректировки - ВЫБОР
	|                КОГДА КорректировкаРеализации.СуммаВключаетНДС
	|                    ТОГДА КорректировкаРеализацииЗапасы.СуммаНДСДоКорректировки
	|                ИНАЧЕ 0
	|            КОНЕЦ
	|        ИНАЧЕ КорректировкаРеализацииЗапасы.СуммаДоИзменения - ВЫБОР
	|            КОГДА КорректировкаРеализации.СуммаВключаетНДС
	|                ТОГДА КорректировкаРеализацииЗапасы.СуммаНДСДоИзменения
	|            ИНАЧЕ 0
	|        КОНЕЦ
	|    КОНЕЦ КАК СуммаДо,
	|    ВЫБОР
	|        КОГДА КорректировкаРеализации.ИсправлениеОшибки
	|            ТОГДА КорректировкаРеализацииЗапасы.СуммаНДСДоКорректировки
	|        ИНАЧЕ КорректировкаРеализацииЗапасы.СуммаНДСДоИзменения
	|    КОНЕЦ КАК СуммаНДСДо,
	|    НЕ ПартииНоменклатуры.Статус ЕСТЬ NULL КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДокумента
	|ИЗ
	|    Документ.КорректировкаРеализации.Запасы КАК КорректировкаРеализацииЗапасы
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокумент КАК КорректировкаРеализации
	|        ПО КорректировкаРеализацииЗапасы.Ссылка = КорректировкаРеализации.Ссылка
	|        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|        ПО КорректировкаРеализацииЗапасы.Партия = ПартииНоменклатуры.Ссылка
	|        И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|    КорректировкаРеализации.Ссылка,
	|    КорректировкаРеализации.СтоимостьДоставки - ВЫБОР
	|        КОГДА КорректировкаРеализации.СуммаВключаетНДС
	|            ТОГДА КорректировкаРеализации.СуммаНДСДоставки
	|        ИНАЧЕ 0
	|    КОНЕЦ,
	|    КорректировкаРеализации.СуммаНДСДоставки,
	|    ВЫБОР
	|        КОГДА КорректировкаРеализации.ИсправлениеОшибки
	|            ТОГДА КорректировкаРеализации.СтоимостьДоставкиДоКорректировки - ВЫБОР
	|                КОГДА КорректировкаРеализации.СуммаВключаетНДС
	|                    ТОГДА КорректировкаРеализации.СуммаНДСДоставкиДоКорректировки
	|                ИНАЧЕ 0
	|            КОНЕЦ
	|        ИНАЧЕ КорректировкаРеализации.СтоимостьДоставкиДоИзменения - ВЫБОР
	|            КОГДА КорректировкаРеализации.СуммаВключаетНДС
	|                ТОГДА КорректировкаРеализации.СуммаНДСДоставкиДоИзменения
	|            ИНАЧЕ 0
	|        КОНЕЦ
	|    КОНЕЦ,
	|    ВЫБОР
	|        КОГДА КорректировкаРеализации.ИсправлениеОшибки
	|            ТОГДА КорректировкаРеализации.СуммаНДСДоставкиДоКорректировки
	|        ИНАЧЕ КорректировкаРеализации.СуммаНДСДоставкиДоИзменения
	|    КОНЕЦ,
	|    ЛОЖЬ
	|ИЗ
	|    ВТДокумент КАК КорректировкаРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ВТСуммыДокумента.Ссылка КАК Ссылка,
	|    ВТСуммыДокумента.Сумма КАК Сумма,
	|    ВТСуммыДокумента.СуммаНДС КАК СуммаНДС,
	|    ВЫБОР
	|        КОГДА ВТСуммыДокумента.СуммаДо > ВТСуммыДокумента.Сумма
	|            ТОГДА ВТСуммыДокумента.СуммаДо - ВТСуммыДокумента.Сумма
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК СуммаУменьшение,
	|    ВЫБОР
	|        КОГДА ВТСуммыДокумента.СуммаДо < ВТСуммыДокумента.Сумма
	|            ТОГДА ВТСуммыДокумента.Сумма - ВТСуммыДокумента.СуммаДо
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК СуммаУвеличение,
	|    ВЫБОР
	|        КОГДА ВТСуммыДокумента.СуммаНДСДо > ВТСуммыДокумента.СуммаНДС
	|            ТОГДА ВТСуммыДокумента.СуммаНДСДо - ВТСуммыДокумента.СуммаНДС
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК СуммаНДСУменьшение,
	|    ВЫБОР
	|        КОГДА ВТСуммыДокумента.СуммаНДСДо < ВТСуммыДокумента.СуммаНДС
	|            ТОГДА ВТСуммыДокумента.СуммаНДС - ВТСуммыДокумента.СуммаНДСДо
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК СуммаНДСУвеличение,
	|    ВТСуммыДокумента.ЭтоКомиссия КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыИзменения
	|ИЗ
	|    ВТСуммыДокумента КАК ВТСуммыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ВТСуммыИзменения.Ссылка КАК ДокументСсылка,
	|    СУММА(ВТСуммыИзменения.Сумма) КАК СуммаДокумента,
	|    СУММА(ВТСуммыИзменения.СуммаНДС) КАК СуммаНДСДокумента,
	|    СУММА(ВТСуммыИзменения.СуммаУменьшение) КАК СуммаУменьшение,
	|    СУММА(ВТСуммыИзменения.СуммаУвеличение) КАК СуммаУвеличение,
	|    СУММА(ВТСуммыИзменения.СуммаНДСУменьшение) КАК СуммаНДСУменьшение,
	|    СУММА(ВТСуммыИзменения.СуммаНДСУвеличение) КАК СуммаНДСУвеличение,
	|    СУММА(ВЫБОР
	|        КОГДА ВТСуммыИзменения.ЭтоКомиссия
	|            ТОГДА ВТСуммыИзменения.Сумма
	|        ИНАЧЕ 0
	|    КОНЕЦ) КАК СуммаДокументаКомиссия,
	|    СУММА(ВЫБОР
	|        КОГДА ВТСуммыИзменения.ЭтоКомиссия
	|            ТОГДА ВТСуммыИзменения.СуммаНДС
	|        ИНАЧЕ 0
	|    КОНЕЦ) КАК СуммаНДСДокументаКомиссия,
	|    СУММА(ВЫБОР
	|        КОГДА ВТСуммыИзменения.ЭтоКомиссия
	|            ТОГДА ВТСуммыИзменения.СуммаУменьшение
	|        ИНАЧЕ 0
	|    КОНЕЦ) КАК СуммаУменьшениеКомиссия,
	|    СУММА(ВЫБОР
	|        КОГДА ВТСуммыИзменения.ЭтоКомиссия
	|            ТОГДА ВТСуммыИзменения.СуммаУвеличение
	|        ИНАЧЕ 0
	|    КОНЕЦ) КАК СуммаУвеличениеКомиссия,
	|    СУММА(ВЫБОР
	|        КОГДА ВТСуммыИзменения.ЭтоКомиссия
	|            ТОГДА ВТСуммыИзменения.СуммаНДСУменьшение
	|        ИНАЧЕ 0
	|    КОНЕЦ) КАК СуммаНДСУменьшениеКомиссия,
	|    СУММА(ВЫБОР
	|        КОГДА ВТСуммыИзменения.ЭтоКомиссия
	|            ТОГДА ВТСуммыИзменения.СуммаНДСУвеличение
	|        ИНАЧЕ 0
	|    КОНЕЦ) КАК СуммаНДСУвеличениеКомиссия
	|ИЗ
	|    ВТСуммыИзменения КАК ВТСуммыИзменения
	|СГРУППИРОВАТЬ ПО
	|    ВТСуммыИзменения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыИзменения";

	Возврат Текст;	
КонецФункции

Функция ТекстЗапросаСуммыЗаказПокупателя()
	
	Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.СуммаВключаетНДС
	|			ТОГДА ЗаказПокупателяЗапасы.Сумма - ЗаказПокупателяЗапасы.СуммаНДС
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	НЕ ПартииНоменклатуры.Статус ЕСТЬ NULL КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ПО ЗаказПокупателяЗапасы.Ссылка = ЗаказПокупателя.Ссылка
	|		И ЗаказПокупателя.Ссылка В (&Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|		ПО ЗаказПокупателяЗапасы.Партия = ПартииНоменклатуры.Ссылка
	|		И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.СуммаВключаетНДС
	|			ТОГДА ЗаказПокупателяРаботы.Сумма - ЗаказПокупателяРаботы.СуммаНДС
	|		ИНАЧЕ ЗаказПокупателяРаботы.Сумма
	|	КОНЕЦ,
	|	ЗаказПокупателяРаботы.СуммаНДС,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаказПокупателя.Работы КАК ЗаказПокупателяРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ПО ЗаказПокупателяРаботы.Ссылка = ЗаказПокупателя.Ссылка
	|		И ЗаказПокупателя.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыДокумента.Ссылка КАК ДокументСсылка,
	|	СУММА(ВТСуммыДокумента.Сумма) КАК СуммаДокумента,
	|	СУММА(ВТСуммыДокумента.СуммаНДС) КАК СуммаНДСДокумента,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаДокументаКомиссия,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаНДСДокументаКомиссия
	|ИЗ
	|	ВТСуммыДокумента КАК ВТСуммыДокумента
	|СГРУППИРОВАТЬ ПО
	|	ВТСуммыДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДокумента";
	
	Возврат Текст;	
КонецФункции

Функция ТекстЗапросаСуммыПриходнаяНакладная()
	
	Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПриходнаяНакладная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТДокументыВозврата
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыВозврата.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВТДокументыВозврата.СуммаВключаетНДС
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Сумма - ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Сумма
	|	КОНЕЦ КАК СуммаУменьшение,
	|	ПриходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСУменьшение,
	|	НЕ ПартииНоменклатуры.Статус ЕСТЬ NULL КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДокумента
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыВозврата КАК ВТДокументыВозврата
	|		ПО ПриходнаяНакладнаяЗапасы.Ссылка = ВТДокументыВозврата.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|		ПО ПриходнаяНакладнаяЗапасы.Партия = ПартииНоменклатуры.Ссылка
	|		И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыВозврата.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.СуммаВключаетНДС
	|			ТОГДА РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.СуммаНДС
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Сумма
	|	КОНЕЦ КАК СуммаДо,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСДо,
	|	НЕ ПартииНоменклатуры.Статус ЕСТЬ NULL КАК ЭтоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДо
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО РасходнаяНакладнаяЗапасы.Ссылка = РасходнаяНакладная.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыВозврата КАК ВТДокументыВозврата
	|		ПО РасходнаяНакладная.Ссылка = ВТДокументыВозврата.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|		ПО РасходнаяНакладнаяЗапасы.Партия = ПартииНоменклатуры.Ссылка
	|		И ПартииНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДокументыВозврата;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыДокумента.Ссылка КАК Ссылка,
	|	СУММА(ВТСуммыДокумента.СуммаУменьшение) КАК СуммаУменьшение,
	|	СУММА(ВТСуммыДокумента.СуммаНДСУменьшение) КАК СуммаНДСУменьшение,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.СуммаУменьшение
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаУменьшениеКомиссия,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДокумента.ЭтоКомиссия
	|			ТОГДА ВТСуммыДокумента.СуммаНДСУменьшение
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаНДСУменьшениеКомиссия
	|ПОМЕСТИТЬ ВТСуммыКомиссия
	|ИЗ
	|	ВТСуммыДокумента КАК ВТСуммыДокумента
	|СГРУППИРОВАТЬ ПО
	|	ВТСуммыДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыДо.Ссылка КАК Ссылка,
	|	СУММА(ВТСуммыДо.СуммаДо) КАК СуммаДо,
	|	СУММА(ВТСуммыДо.СуммаНДСДо) КАК СуммаНДСДо,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДо.ЭтоКомиссия
	|			ТОГДА ВТСуммыДо.СуммаДо
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаДоКомиссия,
	|	СУММА(ВЫБОР
	|		КОГДА ВТСуммыДо.ЭтоКомиссия
	|			ТОГДА ВТСуммыДо.СуммаНДСДо
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаНДСДоКомиссия
	|ПОМЕСТИТЬ ВТСуммыДоКомиссия
	|ИЗ
	|	ВТСуммыДо КАК ВТСуммыДо
	|СГРУППИРОВАТЬ ПО
	|	ВТСуммыДо.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДокумента;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДо;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыКомиссия.Ссылка КАК ДокументСсылка,
	|	ВЫБОР
	|		КОГДА ВТСуммыДоКомиссия.СуммаДо ЕСТЬ NULL
	|			ТОГДА ВТСуммыКомиссия.СуммаУменьшение
	|		ИНАЧЕ ВТСуммыДоКомиссия.СуммаДо - ВТСуммыКомиссия.СуммаУменьшение
	|	КОНЕЦ КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ВТСуммыДоКомиссия.СуммаДо ЕСТЬ NULL
	|			ТОГДА ВТСуммыКомиссия.СуммаНДСУменьшение
	|		ИНАЧЕ ВТСуммыДоКомиссия.СуммаНДСДо - ВТСуммыКомиссия.СуммаНДСУменьшение
	|	КОНЕЦ КАК СуммаНДСДокумента,
	|	ВТСуммыКомиссия.СуммаУменьшение,
	|	ВТСуммыКомиссия.СуммаНДСУменьшение,
	|	ВТСуммыКомиссия.СуммаУменьшениеКомиссия,
	|	ВТСуммыКомиссия.СуммаНДСУменьшениеКомиссия,
	|	ВЫБОР
	|		КОГДА ВТСуммыДоКомиссия.СуммаДо ЕСТЬ NULL
	|			ТОГДА ВТСуммыКомиссия.СуммаУменьшениеКомиссия
	|		ИНАЧЕ ВТСуммыДоКомиссия.СуммаДоКомиссия - ВТСуммыКомиссия.СуммаУменьшениеКомиссия
	|	КОНЕЦ КАК СуммаДокументаКомиссия,
	|	ВЫБОР
	|		КОГДА ВТСуммыДоКомиссия.СуммаДо ЕСТЬ NULL
	|			ТОГДА ВТСуммыКомиссия.СуммаНДСУменьшениеКомиссия
	|		ИНАЧЕ ВТСуммыДоКомиссия.СуммаНДСДоКомиссия - ВТСуммыКомиссия.СуммаНДСУменьшениеКомиссия
	|	КОНЕЦ КАК СуммаНДСКомиссия
	|ИЗ
	|	ВТСуммыКомиссия КАК ВТСуммыКомиссия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыДоКомиссия КАК ВТСуммыДоКомиссия
	|		ПО ВТСуммыКомиссия.Ссылка = ВТСуммыДоКомиссия.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДоКомиссия;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыКомиссия";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область Поступление
Процедура ЗаполнитьСведенияШапкиПоПоступлению(ДанныеЗаполнения, СведенияДокументовОснований)

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Контрагент", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Договор", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьКладовщика");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");

	ДокументРеализацииСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ДокументОснование");
	Если Не ПустаяСтрока(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДокументРеализацииСсылка, "ОснованиеПечати")) Тогда

		СведенияДокументовОснований.ОснованиеПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДокументРеализацииСсылка, "ОснованиеПечати");

	КонецЕсли;

	СведенияДокументовОснований.Вставить("ИсправляемыйСчетФактура", Неопределено);
	СведенияДокументовОснований.Вставить("ВидОперации", Неопределено);
	СведенияДокументовОснований.Вставить("НомерИсходногоДокумента", Неопределено);
	СведенияДокументовОснований.Вставить("ДатаИсходногоДокумента", Неопределено);
	СведенияДокументовОснований.Вставить("НомерИсправляемогоКорректировочногоДокумента", Неопределено);
	СведенияДокументовОснований.Вставить("ДатаИсправляемогоКорректировочногоДокумента", Неопределено);
	СведенияДокументовОснований.Вставить("НомерИсправления", Неопределено);
	СведенияДокументовОснований.Вставить("Исправление", Неопределено);
	СведенияДокументовОснований.Вставить("УчитыватьИсправлениеИсходногоДокумента", Неопределено);
	СведенияДокументовОснований.Вставить("НомерИсправленияИсходногоДокумента", Неопределено);
	СведенияДокументовОснований.Вставить("ДатаИсправленияИсходногоДокумента", Неопределено);

	РеквизитыКорректировки = Документы.СчетФактура.ПолучитьПараметрыЗаполненияКорректировочногоСчетаФактурыВозвратОтПокупателя(
		ДанныеЗаполнения);
	Для Каждого ЭлементСтруктуры Из РеквизитыКорректировки Цикл

		Если СведенияДокументовОснований.Свойство(ЭлементСтруктуры.Ключ) Тогда

			СведенияДокументовОснований[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьСведенияШапкиПоПередачеТоваровМеждуОрганизациями(ДанныеЗаполнения, СведенияДокументовОснований)

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	СведенияДокументовОснований.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения,
		"КонтрагентПолучатель");
	СведенияДокументовОснований.Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Договор");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьРуководителя");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьГлавногоБухгалтера");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьКладовщика");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ОснованиеПечати");

КонецПроцедуры

#Область ОтчетКомитенту

Процедура ЗаполнитьСведенияШапкиПоОтчетуКомитента(ДанныеЗаполнения, СведенияДокументовОснований)

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Контрагент", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Договор", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ОснованиеПечати");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьРуководителя");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ДанныеЗаполнения, "Организация"), "ПодписьГлавногоБухгалтера");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");

КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаПоОтчетуКомитента(ДанныеЗаполнения, СведенияДокументовОснований,
	СуммыДокументовОснований)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомитентуЗапасы.СуммаВознаграждения,
		|	ОтчетКомитентуЗапасы.СуммаНДСВознаграждения
		|ИЗ
		|	Документ.ОтчетКомитенту.Запасы КАК ОтчетКомитентуЗапасы
		|ГДЕ
		|	ОтчетКомитентуЗапасы.Ссылка = &СсылкаНаДокумент";
		
	ТаблицаЗапасы = Запрос.Выполнить().Выгрузить();
	
	СуммыДокументовОснований.СуммаДокумента = ТаблицаЗапасы.Итог("СуммаВознаграждения");
	СуммыДокументовОснований.СуммаНДСДокумента = ТаблицаЗапасы.Итог("СуммаНДСВознаграждения");
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда

		СуммыДокументовОснований.СуммаДокумента = СуммыДокументовОснований.СуммаДокумента
			- СуммыДокументовОснований.СуммаНДСДокумента;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОтчетКомиссионера

// Поддержка механизма заполнения сводных счетов-фактур на основании отчетов комиссионеров
//

Процедура ЗаполнитьПоПокупателямОтчетаКомиссионера(СтруктураЗаполнения) Экспорт
	
	// Заполнение шапки.
	ДанныеЗаполнения	= СтруктураЗаполнения.Ссылка;
	Дата				= СтруктураЗаполнения.Дата;
	ВидОперации			= Перечисления.ВидыОперацийСчетФактура.Продажа;
	Организация			= СтруктураЗаполнения.Организация;
	Контрагент			= СтруктураЗаполнения.Покупатель;
	Договор				= Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(СтруктураЗаполнения.Покупатель);
	СводныйКомиссионный = СтруктураЗаполнения.СводныйКомиссионный;
	ВалютаДокумента		= СтруктураЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС	= СтруктураЗаполнения.СуммаВключаетНДС; // переменная
	Курс				= СтруктураЗаполнения.Курс;
	Кратность			= СтруктураЗаполнения.Кратность;

	Если СтруктураЗаполнения.Свойство("Корректировочный") Тогда
		Корректировочный	= СтруктураЗаполнения.Корректировочный;
		Если Корректировочный Тогда
			ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка;
		КонецЕсли;
	КонецЕсли;
	//

	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда

		ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,
			"ВалютаРасчетов"), Дата);
		Курс = ВалютаКурсКратность.Курс;
		Кратность = ВалютаКурсКратность.Кратность;

	КонецЕсли;

	СтрокаДокументаОснования = ДокументыОснования.Найти(ДанныеЗаполнения, "ДокументОснование");
	
	Если СтрокаДокументаОснования = Неопределено Тогда

		СтрокаДокументаОснования = ДокументыОснования.Добавить();
		СтрокаДокументаОснования.ДокументОснование = ДанныеЗаполнения;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда

		ПодписьРуководителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ПодписьРуководителя");
		ПодписьГлавногоБухгалтера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ПодписьГлавногоБухгалтера");

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодВидаОперации) Тогда
		КодВидаОперации = ?(СводныйКомиссионный, "27", "01");
	КонецЕсли;
	
	// Прослеживаемость
	Для Каждого СтрокаЗапасы Из СтруктураЗаполнения.Запасы Цикл
		Если СтрокаЗапасы.ПрослеживаемыйТовар Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// Конец Прослеживаемость

	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка Тогда
		Если НЕ ЗначениеЗаполнено(КодВидаОперацииНаУменьшение) Тогда
			КодВидаОперацииНаУменьшение = ?(СводныйКорректировочный, "01", "18");
		КонецЕсли;
		
		НомерИсходногоДокумента = СтруктураЗаполнения.НомерИсходногоДокумента;
		ДатаИсходногоДокумента = СтруктураЗаполнения.ДатаИсходногоДокумента;
		СтрокаДокументаОснования.НомерИсходногоДокумента = СтруктураЗаполнения.НомерИсходногоДокумента;
		СтрокаДокументаОснования.ДатаИсходногоДокумента = СтруктураЗаполнения.ДатаИсходногоДокумента;
		ЗаполнитьСуммыОтчетКомиссионераКорректировка(ДанныеЗаполнения);
	Иначе
		ЗаполнитьТабличнуюЧастьПоОтчетуКомиссионера(СтруктураЗаполнения, СуммаВключаетНДС);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоОтчетуКомиссионера(СтруктураЗаполнения, СуммаВключаетНДС) Экспорт

	ФорматСчетФактуры = ?(УдалитьЗапасы.Количество() > 0, "1.6.11", "1.6.12");

	Если ФорматСчетФактуры = "1.6.11" Тогда

		УдалитьЗапасы.Очистить();

	КонецЕсли;

	СуммаДокумента = 0;
	СуммаНДСДокумента = 0;

	РезультатПоиска = СтруктураЗаполнения.Запасы;
	Для Каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл

		Если ФорматСчетФактуры = "1.6.11" Тогда

			НоваяСтрока = УдалитьЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);

			Если НоваяСтрока.Количество = 0 Тогда
				НоваяСтрока.Цена = 0;
			ИначеЕсли СуммаВключаетНДС Тогда
				НоваяСтрока.Цена = НоваяСтрока.Сумма / ((ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					НоваяСтрока.СтавкаНДС, "Ставка") + 100) / 100) / НоваяСтрока.Количество;
			Иначе
				НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
			КонецЕсли;

		КонецЕсли;

		Если СуммаВключаетНДС Тогда

			СуммаБезНДС = Окр(СтрокаТабличнойЧасти.Сумма / ((СтрокаТабличнойЧасти.СтавкаНДС.Ставка + 100) / 100), 2);

		Иначе

			СуммаБезНДС = СтрокаТабличнойЧасти.Сумма;

		КонецЕсли;

		Если ФорматСчетФактуры = "1.6.11" Тогда

			НоваяСтрока.Сумма = СуммаБезНДС;

		КонецЕсли;

		СуммаДокумента = СуммаДокумента + СуммаБезНДС;
		СуммаНДСДокумента = СуммаНДСДокумента + СтрокаТабличнойЧасти.СуммаНДС;

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПоПокупателямОтчетаКомиссионераСводнаяСправка(СтруктураЗаполнения, СведенияДокументовОснований,
	СуммыДокументовОснований) Экспорт
	
	// Заполнение шапки.
	ДанныеЗаполнения	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураЗаполнения, "Ссылка");

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
		
	//

	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда

		ДоговорВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВалютаРасчетов");

		ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДоговорВалютаРасчетов, Дата);
		ДанныеКурса = Новый Структура("Курс, Кратность", ВалютаКурсКратность.Курс, ВалютаКурсКратность.Кратность);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Курс");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Кратность");

	КонецЕсли;

	Если ДокументыОснования.Найти(ДанныеЗаполнения, "ДокументОснование") = Неопределено Тогда

		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;

	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"ПодписьРуководителя, ПодписьГлавногоБухгалтера");
		ДанныеПодписей = Новый Структура("ПодписьРуководителя, ПодписьГлавногоБухгалтера",
			ЗначенияРеквизитов.ПодписьРуководителя, ЗначенияРеквизитов.ПодписьГлавногоБухгалтера);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьГлавногоБухгалтера");

	КонецЕсли;
    
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СтруктураЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасы.СтавкаНДС,
	|	ОтчетКомиссионераЗапасы.Сумма,
	|	ОтчетКомиссионераЗапасы.СуммаНДС,
	|	ОтчетКомиссионераЗапасы.СтавкаНДС.Ставка
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка = &СсылкаНаДокумент";

	РезультатПоиска = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда
			СуммаБезНДС = Окр(СтрокаТабличнойЧасти.Сумма / ((СтрокаТабличнойЧасти.СтавкаНДССтавка + 100) / 100), 2);
		Иначе
			СуммаБезНДС = СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;

		СуммаДокумента = СуммаДокумента + СуммаБезНДС;
		СуммаНДСДокумента = СуммаНДСДокумента + СтрокаТабличнойЧасти.СуммаНДС;

	КонецЦикла;

	СуммыДокументовОснований.СуммаДокумента = СуммаДокумента;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммаНДСДокумента;

КонецПроцедуры

Процедура ЗаполнитьПоПокупателямОтчетаКомиссионераСводнаяСправкаКорректировка(СтруктураЗаполнения,
	СведенияДокументовОснований, СуммыДокументовОснований) Экспорт
	
	// Заполнение шапки.
	ДанныеЗаполнения	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураЗаполнения, "Ссылка");

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
		
	//

	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда

		ДоговорВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВалютаРасчетов");
		ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДоговорВалютаРасчетов, Дата);
		ДанныеКурса = Новый Структура("Курс, Кратность", ВалютаКурсКратность.Курс, ВалютаКурсКратность.Кратность);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Курс");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Кратность");

	КонецЕсли;

	Если ДокументыОснования.Найти(ДанныеЗаполнения, "ДокументОснование") = Неопределено Тогда

		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;

	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"ПодписьРуководителя, ПодписьГлавногоБухгалтера");
		ДанныеПодписей = Новый Структура("ПодписьРуководителя, ПодписьГлавногоБухгалтера",
			ЗначенияРеквизитов.ПодписьРуководителя, ЗначенияРеквизитов.ПодписьГлавногоБухгалтера);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьГлавногоБухгалтера");

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СтруктураЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасыВозвраты.Сумма,
	|	ОтчетКомиссионераЗапасыВозвраты.СуммаНДС,
	|	ОтчетКомиссионераЗапасыВозвраты.СтавкаНДС.Ставка
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасыВозвраты
	|ГДЕ
	|	ОтчетКомиссионераЗапасыВозвраты.Ссылка = &СсылкаНаДокумент";

	РезультатПоиска = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда
			СуммаБезНДС = Окр(СтрокаТабличнойЧасти.Сумма / ((СтрокаТабличнойЧасти.СтавкаНДССтавка + 100) / 100), 2);

		Иначе
			СуммаБезНДС = СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;

		СуммаДокумента = СуммаДокумента + СуммаБезНДС;
		СуммаНДСДокумента = СуммаНДСДокумента + СтрокаТабличнойЧасти.СуммаНДС;

	КонецЦикла;

	СуммыДокументовОснований.СуммаДокумента = СуммаДокумента;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммаНДСДокумента;

КонецПроцедуры

Процедура ЗаполнитьСуммыОтчетКомиссионераКорректировка(ДокументОснование)
	
	СуммыДокументов = СуммыДокументовОснований();
	ТекстЗапроса = ТекстЗапросаСуммыОтчетКомиссионераКорректировка();
	ЗаполнитьСуммыДокументов(ТекстЗапроса, ДокументОснование, СуммыДокументов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СуммыДокументов);
	
КонецПроцедуры

Функция ТекстЗапросаСуммыОтчетКомиссионераКорректировка()
	
	Текст = "ВЫБРАТЬ
	|	ОтчетКомиссионера.Ссылка КАК Ссылка,
	|	ОтчетКомиссионера.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ВТДокументыВозврата
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Ссылка В (&Ссылка)
	|	И ОтчетКомиссионера.НаВозвратыВыставляетсяКорректировочныйСчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыВозврата.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВТДокументыВозврата.СуммаВключаетНДС
	|			ТОГДА ЗапасыВозвраты.Сумма - ЗапасыВозвраты.СуммаНДС
	|		ИНАЧЕ ЗапасыВозвраты.Сумма
	|	КОНЕЦ КАК СуммаУменьшение,
	|	ЗапасыВозвраты.СуммаНДС КАК СуммаНДСУменьшение
	|ПОМЕСТИТЬ ВТСуммыДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионера.ЗапасыВозвраты КАК ЗапасыВозвраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыВозврата КАК ВТДокументыВозврата
	|		ПО ЗапасыВозвраты.Ссылка = ВТДокументыВозврата.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.ПокупателиВозвраты КАК ПокупателиВозвраты
	|		ПО ЗапасыВозвраты.Ссылка = ПокупателиВозвраты.Ссылка
	|		И ЗапасыВозвраты.КлючСвязи = ПокупателиВозвраты.КлючСвязи
	|		И ПокупателиВозвраты.ВыставленСФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДокументыВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСуммыДокумента.Ссылка КАК ДокументСсылка,
	|	СУММА(ВТСуммыДокумента.СуммаУменьшение) КАК СуммаДокумента,
	|	СУММА(ВТСуммыДокумента.СуммаНДСУменьшение) КАК СуммаНДСДокумента,
	|	СУММА(ВТСуммыДокумента.СуммаУменьшение) КАК СуммаУменьшение,
	|	СУММА(ВТСуммыДокумента.СуммаНДСУменьшение) КАК СуммаНДСУменьшение
	|ИЗ
	|	ВТСуммыДокумента КАК ВТСуммыДокумента
	|СГРУППИРОВАТЬ ПО
	|	ВТСуммыДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыДокумента";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ОтчетОРозничныхПродажах

Процедура ЗаполнитьПоОтчетОРозничныхПродажахСводнаяСправкаКорректировка(СтруктураЗаполнения,
	СведенияДокументовОснований, СуммыДокументовОснований) Экспорт
	
	// Заполнение шапки.
	ДанныеЗаполнения	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураЗаполнения, "Ссылка");;

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);

	Курс = 1;
	Кратность = 1;
	
	//

	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда

		ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеЗаполнения, "ВалютаДокумента"), Дата);
		ДанныеКурса = Новый Структура("Курс, Кратность", ВалютаКурсКратность.Курс, ВалютаКурсКратность.Кратность);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Курс");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Кратность");

	КонецЕсли;

	Если ДокументыОснования.Найти(ДанныеЗаполнения, "ДокументОснование") = Неопределено Тогда

		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;

	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"ПодписьРуководителя, ПодписьГлавногоБухгалтера");
		ДанныеПодписей = Новый Структура("ПодписьРуководителя, ПодписьГлавногоБухгалтера",
			ЗначенияРеквизитов.ПодписьРуководителя, ЗначенияРеквизитов.ПодписьГлавногоБухгалтера);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьГлавногоБухгалтера");

	КонецЕсли;
    
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СтруктураЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетОРозничныхПродажахЗапасы.Сумма КАК Сумма,
	|	ОтчетОРозничныхПродажахЗапасы.СуммаНДС КАК СуммаНДС,
	|	ОтчетОРозничныхПродажахЗапасы.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
	|	ОтчетОРозничныхПродажахЗапасы.Возврат КАК Возврат
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	|ГДЕ
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка = &СсылкаНаДокумент";

	РезультатПоиска = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл

		Если СтрокаТабличнойЧасти.Возврат = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда
			СуммаБезНДС = Окр(СтрокаТабличнойЧасти.Сумма / ((СтрокаТабличнойЧасти.СтавкаНДССтавка + 100) / 100), 2);
		Иначе
			СуммаБезНДС = СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;

		СуммаДокумента = СуммаДокумента + (-СуммаБезНДС);
		СуммаНДСДокумента = СуммаНДСДокумента + (-СтрокаТабличнойЧасти.СуммаНДС);

	КонецЦикла;

	СуммыДокументовОснований.СуммаДокумента = СуммаДокумента;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммаНДСДокумента;
	СуммыДокументовОснований.СуммаУменьшение = СуммаДокумента;
	СуммыДокументовОснований.СуммаНДСУменьшение = СуммаНДСДокумента;

КонецПроцедуры

Процедура ЗаполнитьПоОтчетОРозничныхПродажахСводнаяСправка(СтруктураЗаполнения, СведенияДокументовОснований,
	СуммыДокументовОснований) Экспорт
    
    // Заполнение шапки.
	ДанныеЗаполнения    = СтруктураЗаполнения.Ссылка;

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);

	Курс = 1;
	Кратность = 1;
    
    //

	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда

		ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеЗаполнения.ВалютаДокумента, Дата);
		ДанныеКурса = Новый Структура("Курс, Кратность", ВалютаКурсКратность.Курс, ВалютаКурсКратность.Кратность);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Курс");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Кратность");

	КонецЕсли;

	Если ДокументыОснования.Найти(ДанныеЗаполнения, "ДокументОснование") = Неопределено Тогда

		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;

	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"ПодписьРуководителя, ПодписьГлавногоБухгалтера");
		ДанныеПодписей = Новый Структура("ПодписьРуководителя, ПодписьГлавногоБухгалтера",
			ЗначенияРеквизитов.ПодписьРуководителя, ЗначенияРеквизитов.ПодписьГлавногоБухгалтера);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьГлавногоБухгалтера");

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СтруктураЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|    ОтчетОРозничныхПродажахЗапасы.СтавкаНДС,
	|    ОтчетОРозничныхПродажахЗапасы.Сумма,
	|    ОтчетОРозничныхПродажахЗапасы.СуммаНДС,
	|    ОтчетОРозничныхПродажахЗапасы.СтавкаНДС.Ставка,
	|    ОтчетОРозничныхПродажахЗапасы.Возврат
	|ИЗ
	|    Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	|ГДЕ
	|    ОтчетОРозничныхПродажахЗапасы.Ссылка = &СсылкаНаДокумент";

	ТаблицаЗапасы = Запрос.Выполнить().Выгрузить();

	СтруктураПоиска = Новый Структура("Возврат", 0);
	РезультатПоиска = ТаблицаЗапасы.НайтиСтроки(СтруктураПоиска);

	Для Каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда
			СуммаБезНДС = Окр(СтрокаТабличнойЧасти.Сумма / ((СтрокаТабличнойЧасти.СтавкаНДССтавка + 100) / 100), 2);
		Иначе
			СуммаБезНДС = СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;

		СуммаДокумента = СуммаДокумента + СуммаБезНДС;
		СуммаНДСДокумента = СуммаНДСДокумента + СтрокаТабличнойЧасти.СуммаНДС;

	КонецЦикла;

	СуммыДокументовОснований.СуммаДокумента = СуммаДокумента;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммаНДСДокумента;

КонецПроцедуры

Процедура ЗаполнитьПоОтчетОРозничныхПродажахАвансПодарочныеСертификаты(СтруктураЗаполнения, СведенияДокументовОснований,
	СуммыДокументовОснований) Экспорт
    
    // Заполнение шапки.
	ДанныеЗаполнения    = СтруктураЗаполнения.Ссылка;

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);

	Курс = 1;
	Кратность = 1;
    
    //

	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда

		ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеЗаполнения.ВалютаДокумента, Дата);
		ДанныеКурса = Новый Структура("Курс, Кратность", ВалютаКурсКратность.Курс, ВалютаКурсКратность.Кратность);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Курс");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеКурса, "Кратность");

	КонецЕсли;

	Если ДокументыОснования.Найти(ДанныеЗаполнения, "ДокументОснование") = Неопределено Тогда

		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;

	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"ПодписьРуководителя, ПодписьГлавногоБухгалтера");
		ДанныеПодписей = Новый Структура("ПодписьРуководителя, ПодписьГлавногоБухгалтера",
			ЗначенияРеквизитов.ПодписьРуководителя, ЗначенияРеквизитов.ПодписьГлавногоБухгалтера);

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеПодписей, "ПодписьГлавногоБухгалтера");

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СтруктураЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|    ОтчетОРозничныхПродажахЗапасы.СтавкаНДС,
	|    ОтчетОРозничныхПродажахЗапасы.Сумма,
	|    ОтчетОРозничныхПродажахЗапасы.СуммаНДС,
	|    ОтчетОРозничныхПродажахЗапасы.СтавкаНДС.Ставка,
	|    ОтчетОРозничныхПродажахЗапасы.Возврат
	|ИЗ
	|    Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	|ГДЕ
	|    ОтчетОРозничныхПродажахЗапасы.Ссылка = &СсылкаНаДокумент
	|    И
	|        ОтчетОРозничныхПродажахЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)";

	ТаблицаЗапасы = Запрос.Выполнить().Выгрузить();

	СтруктураПоиска = Новый Структура("Возврат", 0);
	РезультатПоиска = ТаблицаЗапасы.НайтиСтроки(СтруктураПоиска);

	Для Каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаВключаетНДС") Тогда
			СуммаБезНДС = Окр(СтрокаТабличнойЧасти.Сумма / ((СтрокаТабличнойЧасти.СтавкаНДССтавка + 100) / 100), 2);
		Иначе
			СуммаБезНДС = СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;

		СуммаДокумента = СуммаДокумента + СуммаБезНДС;
		СуммаНДСДокумента = СуммаНДСДокумента + СтрокаТабличнойЧасти.СуммаНДС;

	КонецЦикла;

	СуммыДокументовОснований.СуммаДокумента = СуммаДокумента;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммаНДСДокумента;

КонецПроцедуры

#КонецОбласти

#Область ОтчетОПереработке

Процедура ЗаполнитьСведенияШапкиПоПереработке(ДанныеЗаполнения, СведенияДокументовОснований)

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Контрагент", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Договор", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ОснованиеПечати");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьРуководителя");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьГлавногоБухгалтера");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьКладовщика");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");

КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаПоПереработке(ДанныеЗаполнения, СведенияДокументовОснований, СуммыДокументовОснований)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетОПереработкеПродукция.Сумма,
	|	ОтчетОПереработкеПродукция.СуммаНДС
	|ИЗ
	|	Документ.ОтчетОПереработке.Продукция КАК ОтчетОПереработкеПродукция
	|ГДЕ
	|	ОтчетОПереработкеПродукция.Ссылка = &СсылкаНаДокумент";

	ТаблицаПродукция = Запрос.Выполнить().Выгрузить();
	
	СуммаДокументаОснования = ТаблицаПродукция.Итог("Сумма");
	СуммаНДСДокументаОснования = ТаблицаПродукция.Итог("СуммаНДС");

	ДобавитьЗначенияДокументаВИтоговыеСуммы(ДанныеЗаполнения, СуммыДокументовОснований, СуммаДокументаОснования,
		СуммаНДСДокументаОснования);

КонецПроцедуры

#КонецОбласти

#Область Ремонт

Процедура ЗаполнитьСведенияШапкиПоРемонту(ДанныеЗаполнения, СведенияДокументовОснований)

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Контрагент", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Договор", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ВалютаДокумента", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Кратность");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Курс");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьРуководителя");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьГлавногоБухгалтера");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьКладовщика");
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");

	СведенияДокументовОснований.ОснованиеПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения,
		"Договор.Наименование");

КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаПоРемонту(ДанныеЗаполнения, СведенияДокументовОснований, СуммыДокументовОснований)
	;
	
	СуммаДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаДокумента");
	СуммаНДСДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СуммаНДС");

	ДобавитьЗначенияДокументаВИтоговыеСуммы(ДанныеЗаполнения, СуммыДокументовОснований, СуммаДокументаОснования,
		СуммаНДСДокументаОснования);

КонецПроцедуры

#КонецОбласти

#Область Авансы

Процедура ЗаполнитьСведенияШапкиПоАвансу(ДанныеЗаполнения, СведенияДокументовОснований)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежныйДокументРасшифровкаПлатежа.Договор КАК Договор
		|ИЗ
		|	Документ.%ТипДокумента%.РасшифровкаПлатежа КАК ПлатежныйДокументРасшифровкаПлатежа
		|ГДЕ
		|	ПлатежныйДокументРасшифровкаПлатежа.Ссылка = &СсылкаНаДокумент";
	
	ВидОперацииСчетФактуры = Перечисления.ВидыОперацийСчетФактура[?(ДополнительныеСвойства.Свойство(
		"ЭтоСуммоваяРазница"), "СуммовыеРазницы", "Аванс")];
	
	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.НаАвансКомитента 
		И ВидОперацииСчетФактуры = Перечисления.ВидыОперацийСчетФактура.Аванс Тогда
		СведенияДокументовОснований.Вставить("ВидОперации", Перечисления.ВидыОперацийСчетФактура.НаАвансКомитента);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса 
		И ВидОперацииСчетФактуры = Перечисления.ВидыОперацийСчетФактура.Аванс Тогда	
	    СведенияДокументовОснований.Вставить("ВидОперации", Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса);
	Иначе
		СведенияДокументовОснований.Вставить("ВидОперации", ВидОперацииСчетФактуры);
	КонецЕсли;

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Организация", Истина);
	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "Контрагент", Истина);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "ДоговорКонтрагента, ВалютаДокумента");
		СведенияДокументовОснований.Договор = ЗначенияРеквизитов.ДоговорКонтрагента;
		СведенияДокументовОснований.ВалютаДокумента = ЗначенияРеквизитов.ВалютаДокумента;
		Возврат;
	КонецЕсли
	;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ПодписьГлавногоБухгалтера");

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеВКассу");	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Или ТипЗнч(ДанныеЗаполнения) = Тип(
		"ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда

			
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеЗаполнения, "Организация"), "ПодписьРуководителя");
		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеЗаполнения, "Организация"), "ПодписьГлавногоБухгалтера");

		ТипДокумента = ?(ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет"), "ПоступлениеНаСчет",
		"ОперацияПоПлатежнымКартам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", ТипДокумента);
	КонецЕсли;

	ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ДанныеЗаполнения, "ХозяйственнаяОперация");
    
    ТаблицаРасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
    
	Если ТаблицаРасшифровкаПлатежа.Количество() > 0 Тогда

		ЗаполнитьЗначениеСПроверкой(СведенияДокументовОснований, ТаблицаРасшифровкаПлатежа[0], "Договор", Истина);

	КонецЕсли;

	Если СведенияДокументовОснований.ВидОперации = Перечисления.ВидыОперацийСчетФактура.СуммовыеРазницы Тогда

		СведенияДокументовОснований.Вставить("ВалютаДокумента", Константы.НациональнаяВалюта.Получить());
		СведенияДокументовОснований.Вставить("СтавкаНДССуммовойРазницы",
			УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС(18));

	ИначеЕсли СведенияДокументовОснований.Свойство("ВалютаДокумента") И ЗначениеЗаполнено(
		СведенияДокументовОснований.ВалютаДокумента) И СведенияДокументовОснований.ВалютаДокумента
		<> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВалютаДенежныхСредств") Тогда

		ВызватьИсключение СтрШаблон(НСтр("ru ='Ввод счета-фактуры по различающимся значениям запрещен (%1).'"), НСтр(
			"ru ='Валюта документа'"));

	Иначе

		СведенияДокументовОснований.Вставить("ВалютаДокумента", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеЗаполнения, "ВалютаДенежныхСредств"));
		Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда

			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВалютаДенежныхСредств")
				<> Константы.НациональнаяВалюта.Получить() Тогда

				СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта",
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВалютаДенежныхСредств")));
				СведенияДокументовОснований.Вставить("Курс", СтруктураПоВалюте.Курс);
				СведенияДокументовОснований.Вставить("Кратность", СтруктураПоВалюте.Кратность);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаПоАвансу(ДанныеЗаполнения, СуммыДокументовОснований)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежныйДокументРасшифровкаПлатежа.ПризнакАванса,
		|	ПлатежныйДокументРасшифровкаПлатежа.СтавкаНДС,
		|	ПлатежныйДокументРасшифровкаПлатежа.СуммаНДС,
		|	ПлатежныйДокументРасшифровкаПлатежа.СуммаПлатежа
		|ИЗ
		|	Документ.%ТипДокумента%.РасшифровкаПлатежа КАК ПлатежныйДокументРасшифровкаПлатежа
		|ГДЕ
		|	ПлатежныйДокументРасшифровкаПлатежа.Ссылка = &СсылкаНаДокумент";
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеВКассу");		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеНаСчет");
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ОперацияПоПлатежнымКартам");
	КонецЕсли;
	ТаблицаРасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();	
		
	СтавкаБезНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();

	СуммаНДСДокументаОснования = 0;
	СуммаДокументаОснования = 0;
	Для Каждого СтрокаРасшифровки Из ТаблицаРасшифровкаПлатежа Цикл

		Если Не СтрокаРасшифровки.ПризнакАванса Или СтрокаРасшифровки.СтавкаНДС = СтавкаБезНДС Тогда

			Продолжить;

		КонецЕсли;

		СуммаНДСДокументаОснования = СуммаНДСДокументаОснования + СтрокаРасшифровки.СуммаНДС;
		СуммаДокументаОснования = СуммаДокументаОснования + (СтрокаРасшифровки.СуммаПлатежа
			- СтрокаРасшифровки.СуммаНДС);

	КонецЦикла;

	СуммыДокументовОснований.СуммаДокумента = СуммыДокументовОснований.СуммаДокумента + СуммаДокументаОснования;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммыДокументовОснований.СуммаНДСДокумента + СуммаНДСДокументаОснования;

КонецПроцедуры

Процедура ЗаполнитьСуммуДокументаАвансПоКорректировке(ДанныеЗаполнения, СуммыДокументовОснований)

	Авансы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализацииЗапасы.СуммаДоИзменения,
		|	КорректировкаРеализацииЗапасы.Сумма,
		|	КорректировкаРеализацииЗапасы.СуммаНДС,
		|	КорректировкаРеализацииЗапасы.СуммаНДСДоИзменения
		|ИЗ
		|	Документ.КорректировкаРеализации.Запасы КАК КорректировкаРеализацииЗапасы
		|ГДЕ
		|	КорректировкаРеализацииЗапасы.Ссылка = &СсылкаНаДокумент";

	Запасы = Запрос.Выполнить().Выгрузить();

	СуммаДокументаОснования = Запасы.Итог("СуммаДоИзменения") - Запасы.Итог("Сумма");
	СуммаНДСДокументаОснования = Запасы.Итог("СуммаНДСДоИзменения") - Запасы.Итог("СуммаНДС");
	Если СуммаДокументаОснования < 0 Тогда
		СуммаДокументаОснования = 0;
		СуммаНДСДокументаОснования = 0;
	Иначе

		РеквизитыДокументы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			"Организация, Дата, СуммаВключаетНДС");

		СтавкаНДСАвансыПеречисление = УчетНДСВызовСервера.РасчетнаяСтавкаНДСОрганизации(РеквизитыДокументы.Организация,
			РеквизитыДокументы.Дата);
		СтавкаНДСАвансы = Справочники.СтавкиНДС.СтавкаНДСПоПеречислениюСтавкиНДС(СтавкаНДСАвансыПеречисление);

		СтрокаАванса = Авансы.Добавить();
		СтрокаАванса.Содержание = НСтр("ru ='Предварительная оплата'");
		СтрокаАванса.СтавкаНДС = СтавкаНДСАвансы;
		СтрокаАванса.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
        СуммаДокументаОснования, РеквизитыДокументы.СуммаВключаетНДС, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(
            СтавкаНДСАвансыПеречисление));
		СуммаНДСДокументаОснования = СтрокаАванса.СуммаНДС;

		Если РеквизитыДокументы.СуммаВключаетНДС Тогда
			СтрокаАванса.Сумма = СуммаДокументаОснования;
			СуммаДокументаОснования = СуммаДокументаОснования - СуммаНДСДокументаОснования;
		Иначе
			СтрокаАванса.Сумма = СуммаДокументаОснования + СуммаНДСДокументаОснования;
		КонецЕсли;

	КонецЕсли;
	СуммыДокументовОснований.СуммаДокумента = СуммыДокументовОснований.СуммаДокумента + СуммаДокументаОснования;
	СуммыДокументовОснований.СуммаНДСДокумента = СуммыДокументовОснований.СуммаНДСДокумента + СуммаНДСДокументаОснования;

КонецПроцедуры

Процедура ЗаполнитьРасшифровкуАванса(ДанныеЗаполнения, СуммыДокументовОснований)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежныйДокументРасшифровкаПлатежа.ПризнакАванса,
		|	ПлатежныйДокументРасшифровкаПлатежа.СтавкаНДС,
		|	ПлатежныйДокументРасшифровкаПлатежа.СуммаНДС,
		|	ПлатежныйДокументРасшифровкаПлатежа.СуммаПлатежа
		|ИЗ
		|	Документ.%ТипДокумента%.РасшифровкаПлатежа КАК ПлатежныйДокументРасшифровкаПлатежа
		|ГДЕ
		|	ПлатежныйДокументРасшифровкаПлатежа.Ссылка = &СсылкаНаДокумент";
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеВКассу");		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ПоступлениеНаСчет");
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "ОперацияПоПлатежнымКартам");
	КонецЕсли;
	ТаблицаРасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	
	СтавкаБезНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();

	Для Каждого СтрокаРасшифровки Из ТаблицаРасшифровкаПлатежа Цикл

		Если Не СтрокаРасшифровки.ПризнакАванса Или СтрокаРасшифровки.СтавкаНДС = СтавкаБезНДС Тогда

			Продолжить;

		КонецЕсли;

		СтавкуНДСРасчетная = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСРасчетная(СтрокаРасшифровки.СтавкаНДС);

        Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса И Авансы.Количество() > 0 Тогда
			КорректируемыйСчетФактура =  Авансы[0].КорректируемыйСчетФактура;
			Авансы.Очистить();
		КонецЕсли;

		Если Авансы.Количество() > 0 И Авансы[0].СтавкаНДС = СтавкуНДСРасчетная Тогда
			СтрокаДатаНомерДокументовОплаты = Авансы[0];
			СтрокаДатаНомерДокументовОплаты.Сумма = СтрокаДатаНомерДокументовОплаты.Сумма
				+ (СтрокаРасшифровки.СуммаПлатежа);
			СтрокаДатаНомерДокументовОплаты.СуммаНДС = СтрокаДатаНомерДокументовОплаты.СуммаНДС
				+ СтрокаРасшифровки.СуммаНДС;
		Иначе
				СтрокаДатаНомерДокументовОплаты = Авансы.Добавить();
				СтрокаДатаНомерДокументовОплаты.Содержание = НСтр("ru ='Предварительная оплата'");
				СтрокаДатаНомерДокументовОплаты.Сумма = СтрокаРасшифровки.СуммаПлатежа;
				СтрокаДатаНомерДокументовОплаты.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСРасчетная(
				СтрокаРасшифровки.СтавкаНДС);
				СтрокаДатаНомерДокументовОплаты.СуммаНДС = СтрокаРасшифровки.СуммаНДС;
				СтрокаДатаНомерДокументовОплаты.ДокументОснование = ДанныеЗаполнения;
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", ДанныеЗаполнения.Метаданные()) Тогда
					СтрокаДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					ДанныеЗаполнения, "НомерВходящегоДокумента");
					СтрокаДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					ДанныеЗаполнения, "ДатаВходящегоДокумента");
				КонецЕсли;
				
				Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса Тогда

				Если ЗначениеЗаполнено(КорректируемыйСчетФактура) Тогда
					СтрокаДатаНомерДокументовОплаты.КорректируемыйСчетФактура = КорректируемыйСчетФактура;
					
					ДанныеСтроки = Новый Структура;
					ДанныеСтроки.Вставить("КорректируемыйСчетФактура");
					ДанныеСтроки.Вставить("Сумма");
					ДанныеСтроки.Вставить("СтавкаНДС");
					ДанныеСтроки.Вставить("СуммаНДС");
					ДанныеСтроки.Вставить("Дата");

					ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаДатаНомерДокументовОплаты);
					ЗаполнитьЗначенияСвойств(ДанныеСтроки, ЭтотОбъект, "Дата");
					ПараметрыДоплаты = Документы.СчетФактура.ПараметрыДоплатыКАвансу(ДанныеСтроки);
					ЗаполнитьЗначенияСвойств(СтрокаДатаНомерДокументовОплаты, ПараметрыДоплаты);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ДатаНомерДокументовОплаты.Очистить();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда

		СтрокаДатаНомерДокументовОплаты = ДатаНомерДокументовОплаты.Добавить();
		СтрокаДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Дата");
		СтрокаДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Номер");

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда

		СтрокаДатаНомерДокументовОплаты = ДатаНомерДокументовОплаты.Добавить();
		СтрокаДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ДатаВходящегоДокумента");
		СтрокаДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "НомерВходящегоДокумента");

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьСведения(ДанныеЗаполнения, СведенияДокументовОснований, СуммыДокументовОснований)

	ТипыДокументовРеализаций = Новый Массив;
	ТипыДокументовРеализаций.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	ТипыДокументовРеализаций.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ТипыДокументовРеализаций.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	ТипыДокументовРеализаций.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ТипыДокументовРеализаций.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") 
		И ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс Тогда

		ЗаполнитьСведенияШапкиПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаАвансПоКорректировке(ДанныеЗаполнения, СуммыДокументовОснований);
		ЗаполнитьДатаНомерДокументовОплатыПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований);
    
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомиссионера")
		И (ВидОперации = Перечисления.ВидыОперацийСчетФактура.СводнаяСправка
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка) Тогда
		
		// см. ЗаполнитьПоПокупателямОтчетаКомиссионера
        ЗаполнитьСведенияШапкиПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований);
		
		Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.СводнаяСправка Тогда
			ЗаполнитьПоПокупателямОтчетаКомиссионераСводнаяСправка(ДанныеЗаполнения, СведенияДокументовОснований,
				СуммыДокументовОснований);
		ИначеЕсли
		ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Тогда
			ЗаполнитьПоПокупателямОтчетаКомиссионераСводнаяСправкаКорректировка(ДанныеЗаполнения,
				СведенияДокументовОснований, СуммыДокументовОснований);
		КонецЕсли;
	ИначеЕсли ТипыДокументовРеализаций.Найти(ТипЗнч(ДанныеЗаполнения)) <> Неопределено Тогда

		ЗаполнитьСведенияШапкиПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаПоРеализации(ДанныеЗаполнения, СуммыДокументовОснований);
		ЗаполнитьДатаНомерДокументовОплатыПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда

		ЗаполнитьСведенияШапкиПоОтчетуКомитента(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаПоОтчетуКомитента(ДанныеЗаполнения, СведенияДокументовОснований,
			СуммыДокументовОснований);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда

		Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.СводнаяСправка Тогда
			ЗаполнитьПоОтчетОРозничныхПродажахСводнаяСправка(ДанныеЗаполнения, СведенияДокументовОснований,
				СуммыДокументовОснований);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Тогда
			ЗаполнитьПоОтчетОРозничныхПродажахСводнаяСправкаКорректировка(ДанныеЗаполнения, СведенияДокументовОснований,
				СуммыДокументовОснований);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс Тогда		
				
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетОПереработке") Тогда

		ЗаполнитьСведенияШапкиПоПереработке(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаПоПереработке(ДанныеЗаполнения, СведенияДокументовОснований, СуммыДокументовОснований);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемИПередачаВРемонт") Тогда

		ЗаполнитьСведенияШапкиПоРемонту(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаПоРемонту(ДанныеЗаполнения, СведенияДокументовОснований, СуммыДокументовОснований);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") Или ТипЗнч(ДанныеЗаполнения) = Тип(
		"ДокументСсылка.ПоступлениеНаСчет") Или ТипЗнч(ДанныеЗаполнения) = Тип(
		"ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда

		ЗаполнитьСведенияШапкиПоАвансу(ДанныеЗаполнения, СведенияДокументовОснований);

		Если СведенияДокументовОснований.ВидОперации <> Перечисления.ВидыОперацийСчетФактура.СуммовыеРазницы Тогда

			ЗаполнитьСуммуДокументаПоАвансу(ДанныеЗаполнения, СуммыДокументовОснований);
			ЗаполнитьРасшифровкуАванса(ДанныеЗаполнения, СуммыДокументовОснований);

		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда

		ЗаполнитьСведенияШапкиПоАвансу(ДанныеЗаполнения, СведенияДокументовОснований);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда

		ЗаполнитьСведенияШапкиПоПередачеТоваровМеждуОрганизациями(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаПоРеализации(ДанныеЗаполнения, СуммыДокументовОснований);
		ЗаполнитьДатаНомерДокументовОплатыПоРеализации(ДанныеЗаполнения, СведенияДокументовОснований);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеЗаполнения, "ПокупателюВыставляетсяКорректировочныйСчетФактура") = Истина Тогда
		ЗаполнитьСведенияШапкиПоПоступлению(ДанныеЗаполнения, СведенияДокументовОснований);
		ЗаполнитьСуммуДокументаПоРеализации(ДанныеЗаполнения, СуммыДокументовОснований);
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьОбработкуЗаполнения()

	СуммыДокументовОснований = СуммыДокументовОснований();

	Если ДокументыОснования.Количество() < 1 Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СуммыДокументовОснований);
		Возврат;

	КонецЕсли;

	СведенияДокументовОснований = Новый Структура();
	СведенияДокументовОснований.Вставить("Организация");
	СведенияДокументовОснований.Вставить("Контрагент");
	СведенияДокументовОснований.Вставить("Договор");
	СведенияДокументовОснований.Вставить("ВалютаДокумента");
	СведенияДокументовОснований.Вставить("Кратность");
	СведенияДокументовОснований.Вставить("Курс");
	СведенияДокументовОснований.Вставить("ОснованиеПечати");
	СведенияДокументовОснований.Вставить("ПодписьРуководителя");
	СведенияДокументовОснований.Вставить("ПодписьГлавногоБухгалтера");
	СведенияДокументовОснований.Вставить("ПодписьКладовщика");
	СведенияДокументовОснований.Вставить("ХозяйственнаяОперация");
	СведенияДокументовОснований.Вставить("ЭтоВозврат");												  

	Если Ссылка.Пустая() Тогда
		СведенияДокументовОснований.Вставить("Автор");
	КонецЕсли;
	СведенияДокументовОснований.Вставить("ЕстьПрослеживаемыеТовары", Ложь);

	УдалитьЗапасы.Очистить();
	
	Если Не ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса Тогда
		Авансы.Очистить();
	КонецЕсли;

	Если Не ДанныеОбОплатеИзмененыВручную Тогда
		ДатаНомерДокументовОплаты.Очистить();
	КонецЕсли;

	Если Не ДополнительныеСвойства.Свойство("ЭтоСинхронизация") Или ДополнительныеСвойства.ЭтоСинхронизация = Ложь Тогда

		ПервыйДокументОснование = ДокументыОснования[0].ДокументОснование;
		Если ТипЗнч(ПервыйДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервыйДокументОснование, "Финиш");
		Иначе
			Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервыйДокументОснование, "Дата");
		КонецЕсли;

	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.СводнаяСправка Или ВидОперации
		= Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Тогда
		СуммаДокумента = 0;
		СуммаНДСДокумента = 0;
	КонецЕсли;

	ЕстьДокументРасчетовСКонтрагентом = Ложь;

	Для Каждого СтрокаТаблицы Из ДокументыОснования Цикл

		ЗаполнитьСведения(СтрокаТаблицы.ДокументОснование, СведенияДокументовОснований, СуммыДокументовОснований);

		Если (ТипЗнч(СтрокаТаблицы.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") И Не ВидОперации
			= Перечисления.ВидыОперацийСчетФактура.Аванс) Или (ТипЗнч(СтрокаТаблицы.ДокументОснование) = Тип(
			"ДокументСсылка.ПриходнаяНакладная")
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.ДокументОснование,
			"ПокупателюВыставляетсяКорректировочныйСчетФактура")) Тогда

			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СведенияДокументовОснований,
				"НомерИсходногоДокумента, ДатаИсходногоДокумента, УчитыватьИсправлениеИсходногоДокумента, НомерИсправленияИсходногоДокумента, ДатаИсправленияИсходногоДокумента");

		КонецЕсли;

		ЕстьДокументРасчетовСКонтрагентом = ?(Не ЕстьДокументРасчетовСКонтрагентом, ТипЗнч(
			СтрокаТаблицы.ДокументОснование) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом"),
			ЕстьДокументРасчетовСКонтрагентом);

	КонецЦикла;

	Если Не ЗначениеЗаполнено(СведенияДокументовОснований.ЭтоВозврат) Тогда

		СведенияДокументовОснований.ЭтоВозврат = Перечисления.ДаНет.Нет;

	КонецЕсли;

	Если Ссылка.Пустая() Тогда
		СведенияДокументовОснований.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияДокументовОснований);

	Если ЕстьДокументРасчетовСКонтрагентом И СуммыДокументовОснований.СуммаДокумента = 0 Тогда
		СуммыДокументовОснований.СуммаДокумента = СуммаДокумента;
		СуммыДокументовОснований.СуммаНДСДокумента = СуммаНДСДокумента;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СуммыДокументовОснований);

	КодВидаОперацииОснованияУменьшение = "";
	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка Тогда
		ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Дата);
		Если ВерсияКодовВидовОпераций > 1 Тогда
			Если КодВидаОперацииОснованияУменьшение <> "" Тогда
				КодВидаОперацииНаУменьшение = КодВидаОперацииОснованияУменьшение;
			Иначе
				Если ЗначениеЗаполнено(Договор) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,
					"УчетАгентскогоНДСПокупателем") Тогда
					КодВидаОперацииНаУменьшение = "34";
				Иначе
					КодВидаОперацииНаУменьшение = "18";
				КонецЕсли;
			КонецЕсли;
		Иначе
			КодВидаОперацииНаУменьшение = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДозаполнитьРеквизитыСводныхСправок()

	Если ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировочнаяСправка Тогда
		НомерДата = Документы.СчетФактура.ДатаНомерДляПечати(ИсправляемыйСчетФактура);
		Если ЗначениеЗаполнено(НомерДата.Номер) Тогда
			НомерИсходногоДокумента = НомерДата.Номер;
			ДатаИсходногоДокумента = НомерДата.Дата;
		Иначе
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсправляемыйСчетФактура, "Номер, Дата");
			НомерИсходногоДокумента = РеквизитыДокумента.Номер;
			ДатаИсходногоДокумента = РеквизитыДокумента.Дата;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

// Суммы документов оснований.
// 
// Возвращаемое значение:
//  Структура:
// * СуммаДокумента - Число 
// * СуммаУвеличение - Число 
// * СуммаУменьшение - Число 
// * СуммаНДСДокумента - Число 
// * СуммаНДСУвеличение - Число 
// * СуммаНДСУменьшение - Число 
// * СуммаДокументаКомиссия - Число 
// * СуммаНДСДокументаКомиссия - Число
// * СуммаУвеличениеКомиссия - Число
// * СуммаУменьшениеКомиссия - Число 
// * СуммаНДСУвеличениеКомиссия - Число 
// * СуммаНДСУменьшениеКомиссия - Число 
Функция СуммыДокументовОснований()
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаДокумента", 0);
	Результат.Вставить("СуммаУвеличение", 0);
	Результат.Вставить("СуммаУменьшение", 0);
	Результат.Вставить("СуммаНДСДокумента", 0);
	Результат.Вставить("СуммаНДСУвеличение", 0);
	Результат.Вставить("СуммаНДСУменьшение", 0);
	Результат.Вставить("СуммаДокументаКомиссия", 0);
	Результат.Вставить("СуммаНДСДокументаКомиссия", 0);
	Результат.Вставить("СуммаУвеличениеКомиссия", 0);
	Результат.Вставить("СуммаУменьшениеКомиссия", 0);
	Результат.Вставить("СуммаНДСУвеличениеКомиссия", 0);
	Результат.Вставить("СуммаНДСУменьшениеКомиссия", 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли