#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак необходимости обновления интерфейса
// для отображения или скрытия раздела Бухгалтерия.
//
Функция УстановитьИспользование(Использование) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Запись = Неопределено;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
	КонецЕсли;
	
	Если Запись.Использование <> Использование Тогда
		Запись.Использование = Использование;
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Функция ДоступныеПриложенияБухгалтерии() Экспорт
	
	Попытка
		ПриложенияПользователя = ПрограммныйИнтерфейсСервиса.Приложения();
	Исключение
		Информация = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация));
	КонецПопытки;
	
	Если ПриложенияПользователя = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СостояниеПриложения", Перечисления.СостоянияПриложений.Используется);
	Отбор.Вставить("ИмяВидаПриложения", "БухгалтерияПредприятия");
	
	Возврат ПриложенияПользователя.Скопировать(Отбор, "Код,АдресПриложения,Наименование");
	
КонецФункции

Функция НовыеПараметрыПодключения() Экспорт
	
	НастройкиИнтеграции = Новый Структура;
	НастройкиИнтеграции.Вставить("АдресПриложения", "");
	НастройкиИнтеграции.Вставить("НомерОбласти", 0);
	НастройкиИнтеграции.Вставить("ВнешняяУчетнаяСистема", Ложь);
	НастройкиИнтеграции.Вставить("ИмяПользователя", "");
	НастройкиИнтеграции.Вставить("Пароль", "");
	НастройкиИнтеграции.Вставить("ПользовательДляИнтеграции", Неопределено);
	
	Возврат НастройкиИнтеграции;
	
КонецФункции

Функция ПолучитьПараметрыПодключения(Знач НастройкаОтражения = Неопределено) Экспорт
	
	Результат = НовыеПараметрыПодключения();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(Результат, НаборЗаписей[0], "АдресПриложения,НомерОбласти,ВнешняяУчетнаяСистема");
	КонецЕсли;
	
	Если НастройкаОтражения = Неопределено Тогда
		НастройкаОтражения = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	КонецЕсли;
	
	Если Не НастройкаОтражения.Пустая() Тогда
		Если Результат.ВнешняяУчетнаяСистема Тогда
			Результат.ВнешняяУчетнаяСистема = Истина;
			
			УстановитьПривилегированныйРежим(Истина);
			ХранимыеНастройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(НастройкаОтражения, Неопределено);
			УстановитьПривилегированныйРежим(Ложь);
			
			Если ХранимыеНастройки <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Результат, ХранимыеНастройки, "ИмяПользователя,Пароль");
			КонецЕсли;
		Иначе
			ПользовательДляИнтеграции = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ПользовательДляИнтеграции(НастройкаОтражения);
			Если Не ПользовательДляИнтеграции.Пустая() Тогда
				Результат.ПользовательДляИнтеграции = ПользовательДляИнтеграции;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрыПодключения(ПараметрыПодключения, Знач НастройкаОтражения = Неопределено) Экспорт
	
	Если НастройкаОтражения = Неопределено Тогда
		НастройкаОтражения = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		ЕстьИзменения = Ложь;
		Запись = Неопределено;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
		Иначе
			Запись = НаборЗаписей.Добавить();
		КонецЕсли;
		
		Если Запись.АдресПриложения <> ПараметрыПодключения.АдресПриложения Тогда
			Запись.АдресПриложения = ПараметрыПодключения.АдресПриложения;
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Запись.НомерОбласти <> ПараметрыПодключения.НомерОбласти Тогда
			Запись.НомерОбласти = ПараметрыПодключения.НомерОбласти;
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Запись.ВнешняяУчетнаяСистема <> ПараметрыПодключения.ВнешняяУчетнаяСистема Тогда
			Запись.ВнешняяУчетнаяСистема = ПараметрыПодключения.ВнешняяУчетнаяСистема;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Если ПараметрыПодключения.ВнешняяУчетнаяСистема Тогда
			ХранимыеНастройки = Новый Структура;
			ХранимыеНастройки.Вставить("ИмяПользователя", ПараметрыПодключения.ИмяПользователя);
			ХранимыеНастройки.Вставить("Пароль", ПараметрыПодключения.Пароль);
			
			УстановитьПривилегированныйРежим(Истина);
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(НастройкаОтражения, ХранимыеНастройки, Неопределено);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Совместное использование.Настройки интеграции с бухгалтерией'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти

#КонецЕсли