#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ИдентификаторПубликации = "" Тогда
		
			ИдентификаторПубликации = Строка(Новый УникальныйИдентификатор());
			Запись.ИдентификаторПубликации =  ИдентификаторПубликации;
			
			Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.Новый;
			
			КатегорияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( 
			Запись.Номенклатура, "КатегорияНоменклатуры" );
			
			Запись.КатегорияНоменклатуры = КатегорияНоменклатуры;
			
			Если ПустаяСтрока( Запись.ПредставлениеТовара ) Тогда
			
				НоменклатураНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Запись.Номенклатура, "Наименование" );
				ХарактеристикаНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Запись.Характеристика, "Наименование" );
				Запись.ПредставлениеТовара = НоменклатураНаименование + ?( ПустаяСтрока( ХарактеристикаНаименование ),
				"", ", " + ХарактеристикаНаименование );
				
			КонецЕсли;
			
		КонецЕсли;
		
		Запись.МаркерСтатуса = ИнтеграцияСЯндексМаркетСервер.МаркерСтатусаПоСтатусуПолучить( Запись.Статус );
		
		Если ЗначениеЗаполнено(Запись.ИдентификаторТовараПлощадки) Тогда
			Запись.ГиперссылкаНаРекомендованныеТовар = "https://pokupki.market.yandex.ru/product/" + СокрЛП(СтрЗаменить(Запись.ИдентификаторТовараПлощадки, Символ(160),""));
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
