
#Область ПрограммныйИнтерфейс

// Обработчики обсуждений по типу внешней системы.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Обработчики обсуждений по типу внешней системы:
//   * Ключ - Строка - Тип внешней системы
//   * Значение - Строка - Имя модуля обработчика
Функция ОбработчикиОбсужденийПоТипуВнешнейСистемы() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("WhatsApp Devino", "МессенджерыWhatsAppКлиент");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Тип внешней системы интеграции WhatsApp
// 
// Возвращаемое значение:
//  Строка
Функция ТипВнешнийСистемыWhatsApp() Экспорт
	
	Возврат "WhatsApp Devino";
	
КонецФункции

// Имя события для журнала регистрации
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	
	ИмяСобытия = НСтр("ru='Отправка сообщений в мессенджеры.'");
	Возврат ИмяСобытия;
	
КонецФункции

#КонецОбласти
