///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ШаблоныЗаданий - Массив Из Строка - В параметр следует добавить имена предопределенных
//   неразделенных регламентных заданий, которые должны использоваться в качестве
//   шаблонов для заданий очереди.
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	//БПО
	ИнтеграцияПодсистемБПО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	//Конец БПО
	
	ШаблоныЗаданий.Добавить("ОчередьРасчетаЦен");
	ШаблоныЗаданий.Добавить("СнятиеПризнакаНовинка");
	
	ШаблоныЗаданий.Добавить("МобильноеПриложениеСервисное");
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОбменТоваромССерверомШтрихМ.Имя);
	
	// ЭДО
	ЭлектронноеВзаимодействие.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ЭДО
	
	// Бонусы
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.АвтоматическоеНачислениеИСписаниеБонусныхБаллов.Имя);
	// Конец Бонусы
	ОбщегоНазначенияБРО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОчисткаТекстаИВложенийСтарыхЭлектронныхПисем.Имя);
	
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ФормированиеСоставаСегментовКонтрагентов.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ФормированиеСоставаСегментовНоменклатуры.Имя);
	
	// Телефония
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОбновлениеПодпискиНаСобытияВАТС.Имя);
	// Конец Телефония
	
	// БЗКБ ЗарплатаКадрыПодсистемы
	ЗарплатаКадры.ПриПолученииСпискаШаблоновОчередиЗаданий(ШаблоныЗаданий);
	// Конец БЗКБ ЗарплатаКадрыПодсистемы
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// КонецРаспознаваниеДокументов
	
	// ИнтеграцияГОСИС
	ИнтеграцияЕГАИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияВЕТИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияИСМП.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияЗЕРНО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияСАТУРН.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ИнтеграцияГОСИС
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  СоответствиеИменПсевдонимам - Соответствие из КлючИЗначение:
//    * Ключ - Строка - псевдоним метода, например "ОчиститьОбластьДанных".
//    * Значение - Строка - Имя метода для вызова, например "РаботаВМоделиСервиса.ОчиститьОбластьДанных".
//        В качестве значения можно указать Неопределено, в этом случае считается что имя 
//        совпадает с псевдонимом.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	ЦенообразованиеСервер.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ОплатаСервисаУНФ.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	СоответствиеИменПсевдонимам.Вставить("ОбменСGoogle.ЗаданиеСинхронизироватьКалендарь");
	СоответствиеИменПсевдонимам.Вставить("ЭлектроннаяПочтаУНФ.ЗаданиеЗагрузитьПочту");
	СоответствиеИменПсевдонимам.Вставить("МассовыеРассылкиУНФ.ЗаданиеОбработатьОчередьРассылок");
	СоответствиеИменПсевдонимам.Вставить("ОбменССайтом.ЗаданиеВыполнитьОбмен");
	СоответствиеИменПсевдонимам.Вставить("РабочиеПроцессы.ОбработатьПравилаРабочихПроцессов");
	СоответствиеИменПсевдонимам.Вставить("МобильноеПриложениеВызовСервера.СервисныеОперацииМобильногоПриложения");
	СоответствиеИменПсевдонимам.Вставить("СостояниеКомпании.ЗаданиеСостояниеКомпании");
	СоответствиеИменПсевдонимам.Вставить("ЯндексДоставка.ЗаданиеЗагрузкаДанныхИзЯндексДоставки");
	СоответствиеИменПсевдонимам.Вставить("АссистентУправления.ВыполнениеЗадачАссистентаУправления");
	СоответствиеИменПсевдонимам.Вставить("АссистентУправления.ВыполнениеРегулярныхЗадачАссистентаУправления");
	СоответствиеИменПсевдонимам.Вставить("РаботаССегментами.ФормированиеСоставаСегментовНоменклатуры");
	СоответствиеИменПсевдонимам.Вставить("РаботаССегментами.ФормированиеСоставаСегментовКонтрагентов");
	СоответствиеИменПсевдонимам.Вставить("ИнтеграцияСМагазинамиСоцСетейСервер.ВыполнитьОбменВФоне");
	СоответствиеИменПсевдонимам.Вставить("ИнтеграцияСИнтернетМагазиномСервер.РегламентноеЗаданиеВыполнитьОбмен");
	СоответствиеИменПсевдонимам.Вставить("ИнтеграцияСЯндексМаркетСервер.ВыполнитьФоновоеЗадание");
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеТоварногоКаталогаOzon.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеПодпискиНаСобытияВАТС.ИмяМетода);
	//БПО
	ИнтеграцияПодсистемБПО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	//Конец БПО
	
	// быстрые остатки для списка номенклатуры
	СоответствиеИменПсевдонимам.Вставить("НоменклатураВДокументахСервер.ОбновитьОстаткиНоменклатурыВФоне");
	
	//Обсуждения
	// Запись отложенных сообщений в СистемаВзаимодействия
	СоответствиеИменПсевдонимам.Вставить("ОбсужденияУНФ.ЗаписьОтложенныхСообщенийВСистемуВзаимодействия");
	//Конец Обсуждения	
	
	ОбщегоНазначенияБРО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	ИнтеграцияОбменШтрихМ.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	// ЭДО
	ЭлектронноеВзаимодействие.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЭДО
	
	// ИнтеграцияГОСИС
	ИнтеграцияСАТУРН.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЕГАИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияВЕТИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияИСМП.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЗЕРНО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ИнтеграцияГОСИС
	
	// Бонусы
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.АвтоматическоеНачислениеИСписаниеБонусныхБаллов.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.УведомлениеОбАвтоматическомНачисленииСписанииБонусов.ИмяМетода);
	// Конец Бонусы
	
	СоответствиеИменПсевдонимам.Вставить("ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы");
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОчисткаТекстаИВложенийСтарыхЭлектронныхПисем.ИмяМетода);
	
	// СерверЛояльности
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СерверЛояльностиОбработкаСостоянияБонусовПодарочныхСертификатов.ИмяМетода);
	// Конец СерверЛояльности
	
	// БРМК
	СоответствиеИменПсевдонимам.Вставить(метаданные.РегламентныеЗадания.ОчисткаЖурналаДействийКассира.ИмяМетода);
	// БРМК
	
	// БЗКБ
	ЗарплатаКадры.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец БЗКБ
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// КонецРаспознаваниеДокументов
	
	ВозможностиПриложения.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	// СовместноеИспользование
	СовместноеИспользование.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец СовместноеИспользование
	
	// 1С:Сверка 2.0
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССервисомСверкиРасчетов.ИмяМетода);
	// Конец 1С:Сверка 2.0
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.АктуализацияСостоянийПодключенныхПодписок.ИмяМетода);
	
КонецПроцедуры

// Заполняет соответствие методов обработчиков ошибок псевдонимам методов, при возникновении
// ошибок в которых они вызываются.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ОбработчикиОшибок - Соответствие из КлючИЗначение:
//    * Ключ - Строка - Псевдоним метода, например ОчиститьОбластьДанных.
//    * Значение - Строка - Имя метода - обработчика ошибок, для вызова при возникновении ошибки. 
//        Обработчик ошибок вызывается в случае завершения выполнения исходного задания
//        с ошибкой. Обработчик ошибок вызывается в той же области данных, что и исходное задание.
//        Метод обработчика ошибок считается разрешенным к вызову механизмами очереди.
//        Параметры обработчика ошибок:
//          ПараметрыЗадания - Структура - параметры задания очереди.
//          Параметры
//          НомерПопытки
//          КоличествоПовторовПриАварийномЗавершении
//          ДатаНачалаПоследнегоЗапуска.
//
Процедура ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок) Экспорт
КонецПроцедуры

// Формирует таблицу регламентных заданий с признаком использования в модели сервиса.
// Параметры:
//  ТаблицаИспользования - ТаблицаЗначений - описание:
// 	* РегламентноеЗадание - Строка - имя регламентного задания.
//   * Использование - Булево - признак использования.
//
Процедура ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования) Экспорт
КонецПроцедуры

#КонецОбласти
