
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеВыбораСостояния(Параметры, ОкончаниеВводаТекста = Ложь) Экспорт
	
	ДанныеВыбора = Справочники[Параметры.ОбъектПолученияДанных].ПолучитьДанныеВыбора(Параметры);
	
	Если Параметры.Свойство("ВыборИзВидаЗаказа") и Параметры.ВыборИзВидаЗаказа = Истина Тогда 
		
		ОсновноеСостояние = Справочники[Параметры.ОбъектПолученияДанных].ПустаяСсылка();
		Наименование = Параметры.СтрокаПоиска;
		
	КонецЕсли;  
	
	НаименованиеСоздаваемогоСостояния = "";
	Параметры.Свойство("ТекущееНаименование", НаименованиеСоздаваемогоСостояния);
	Если НЕ ЗначениеЗаполнено(НаименованиеСоздаваемогоСостояния) Тогда
		НаименованиеСоздаваемогоСостояния = Параметры.СтрокаПоиска;
	КонецЕсли;
	
	ДобавитьВДанныеВыбора(ДанныеВыбора,
	ОсновноеСостояние,
	Наименование,
	НаименованиеСоздаваемогоСостояния);
	
	Если ОкончаниеВводаТекста Тогда
		
		ДанныеВыбора.Добавить(""); // Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
		
	КонецЕсли;	
	
	Возврат ДанныеВыбора;
	
КонецФункции

Процедура ДобавитьВДанныеВыбора(ДанныеВыбора, ОсновноеСостояние, Наименование, СтрокаПоиска)
	
	Если НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	ШрифтКоманды    = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста);
	ШрифтПодСтроки  = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	ЦветПодстроки   = Новый Цвет(0, 175, 0);
	
	Представление = Новый ФорматированнаяСтрока(
				Новый ФорматированнаяСтрока(НСтр("ru='Создать: '"), ШрифтКоманды), 
				Новый ФорматированнаяСтрока(СокрЛП(СтрокаПоиска), ШрифтПодСтроки, ЦветПодстроки));
				
	ДанныеВыбора.Добавить(ОсновноеСостояние, Представление); 
		
КонецПроцедуры

Процедура ПометитьНаУдалениеСостоянияНаСервере(Состояния, ПометкаУдаления) Экспорт
	
	Для Каждого Состояние Из Состояния Цикл
		
		Если ТипЗнч(Состояние.Состояние) <> Тип("Строка") Тогда 
			СостояниеОбъект = Состояние.Состояние.ПолучитьОбъект();
			Попытка
				СостояниеОбъект.Заблокировать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СостояниеОбъект);
			КонецПопытки;
			
			СостояниеОбъект.ПометкаУдаления = ПометкаУдаления;
			
			Попытка
				СостояниеОбъект.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СостояниеОбъект);
			КонецПопытки;
			
			СостояниеОбъект.Разблокировать();
			Состояние.ПометкаУдаления = СостояниеОбъект.ПометкаУдаления;
		Иначе
			Состояние.ПометкаУдаления = ПометкаУдаления;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры  

#КонецОбласти
