////////////////////////////////////////////////////////////////////////////////
// Подсистема "Статистика персонала".
// Процедуры и функции, предназначенные для форм статистической отчетности.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// П-4

Процедура ДобавитьПоказателиФормыП4_2013Кв1(ПоказателиОтчета) Экспорт
	
	СтатистикаПерсоналаБазовый.ДобавитьПоказателиФормыП4_2013Кв1(ПоказателиОтчета);
	
КонецПроцедуры

Процедура ДобавитьПоказателиФормыП4_2025Кв1(ПоказателиОтчета) Экспорт
	
	СтатистикаПерсоналаБазовый.ДобавитьПоказателиФормыП4_2025Кв1(ПоказателиОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4_2013Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4_2013Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4_2017Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4_2017Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4_2022Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4_2022Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4_2023Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4_2023Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4_2025Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4_2025Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

// П-4 (НЗ)

Процедура ДобавитьПоказателиФормыП4НЗ_2015Кв1(ПоказателиОтчета) Экспорт
	
	СтатистикаПерсоналаБазовый.ДобавитьПоказателиФормыП4НЗ_2015Кв1(ПоказателиОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4НЗ_2015Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4НЗ_2015Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ДобавитьПоказателиФормыП4НЗ_2021Кв1(ПоказателиОтчета) Экспорт
	
	СтатистикаПерсоналаБазовый.ДобавитьПоказателиФормыП4НЗ_2021Кв1(ПоказателиОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4НЗ_2021Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4НЗ_2021Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ДобавитьПоказателиФормыП4НЗ_2022Кв1(ПоказателиОтчета) Экспорт
	
	СтатистикаПерсоналаБазовый.ДобавитьПоказателиФормыП4НЗ_2022Кв1(ПоказателиОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4НЗ_2022Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4НЗ_2022Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиФормыП4НЗ_2023Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	СтатистикаПерсоналаБазовый.ЗаполнитьПоказателиФормыП4НЗ_2023Кв1(ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

// См. СтатистикаПерсонала.ЗаполнитьСведенияОЧисленности.
Процедура ЗаполнитьСведенияОЧисленности(СведенияОЧисленности, Знач ПараметрыДляСведенийОЧисленности) Экспорт
	СтатистикаПерсоналаБазовый.ЗаполнитьСведенияОЧисленности(СведенияОЧисленности, ПараметрыДляСведенийОЧисленности);
КонецПроцедуры

// См. СтатистикаПерсоналаБазовый.ПараметрыДляСведенийОЧисленности.
Функция ПараметрыДляСведенийОЧисленности() Экспорт
	Возврат СтатистикаПерсоналаБазовый.ПараметрыДляСведенийОЧисленности();
КонецФункции

// См. СтатистикаПерсоналаБазовый.СведенияОЧисленности.
Функция СведенияОЧисленности(РазрядностьПоказателей = 2) Экспорт
	Возврат СтатистикаПерсоналаБазовый.СведенияОЧисленности(РазрядностьПоказателей);
КонецФункции

// См. СтатистикаПерсонала.СреднесписочнаяЧисленностьРаботающих.
Функция СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода, ПоГоловнойОрганизации = Ложь) Экспорт 
	Возврат СтатистикаПерсоналаБазовый.СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода, ПоГоловнойОрганизации)	
КонецФункции

#КонецОбласти
