
#Область ПрограммныйИнтерфейс

// Функция - Коэффициент единицы
//
// Параметры:
//  ЕдиницаИзмерения - СправочникСсылка.ЕдиницыИзмерения
// 
// Возвращаемое значение:
//  Число - Коэффициент пересчета в базовую единицу измерения номенклатурной позиции
//
Функция КоэффициентЕдиницы(ЕдиницаИзмерения) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Коэффициент");
	
КонецФункции

// Возвращает признак возможности изменения использования серий
//
// Параметры:
//  НоменклатураВладелец - СправочникСсылка.Номенклатура
//  ИзКатегории - Булево - Политика учета серий берется из категории номенклатуры
//
// Возвращаемое значение:
//  Булево - Ппризнак возможности изменения серий.
//
Функция ИзменениеИспользованияСерийПоНоменклатуреВозможно(НоменклатураВладелец, НастройкаИспользованияСерий = Неопределено, КатегорияНоменклатуры = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("ОтказПоДвижениямПоСериям, ОтказПоПолитике, ОтказПоНастройкамСерий", Ложь, Ложь, Ложь);
	
	КатегорияНоменклатурыИзСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец,
		"КатегорияНоменклатуры");
	ИспользоватьСерииИзКатегорииВКатегорииИзСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатурыИзСсылки,
		"ИспользоватьСерииИзКатегории");

	
	// Когда категорию меняют в номенклатуре
	Если Не КатегорияНоменклатуры = Неопределено Тогда
		
		ИспользоватьСерииИзКатегории = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ИспользоватьСерииИзКатегории");
		
		Если ИспользоватьСерииИзКатегории И НастройкаИспользованияСерий = "Индивидуальные" Тогда
		СтруктураВозврата.ОтказПоНастройкамСерий = Истина;
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	КонецЕсли;
	
	// Когда меняют настройку использования серий на индивидуальные
	Если ИспользоватьСерииИзКатегорииВКатегорииИзСсылки И НастройкаИспользованияСерий = "Индивидуальные" Тогда
		СтруктураВозврата.ОтказПоНастройкамСерий = Истина;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ПолитикаИзКатегорииУправлениеОстатками = Ложь;
	
	ИзКатегории = НастройкаИспользованияСерий = "ИзКатегории";
	Если ИзКатегории Тогда

		ПолитикаУчетаСерий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатурыИзСсылки,
			"ПолитикаУчетаСерий");
		ТипПолитики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПолитикаУчетаСерий,
			"ТипПолитики");

		ПолитикаИзКатегорииУправлениеОстатками = ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", НоменклатураВладелец);
	
	Если ПолитикаИзКатегорииУправлениеОстатками Тогда

		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Запасы.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Номенклатура = &Номенклатура";

		Если Не Запрос.Выполнить().Пустой() Тогда
			СтруктураВозврата.ОтказПоПолитике = Истина;
		КонецЕсли;

	Иначе

		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДвиженияСерииНоменклатуры.Серия КАК Серия
		|ИЗ
		|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
		|ГДЕ
		|	ДвиженияСерииНоменклатуры.Номенклатура = &Номенклатура
		|	И НЕ ДвиженияСерииНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";

		Если Не Запрос.Выполнить().Пустой() Тогда
			СтруктураВозврата.ОтказПоДвижениямПоСериям = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

// Возвращает признак возможности изменения использования серий по категории
//
// Параметры:
//  КатегорияВладелец - СправочникСсылка.КатегорииНоменклатуры
//  НастройкаИспользованияСерий - Строка - Строковое обозначение настройки
//
// Возвращаемое значение:
//  Булево - Ппризнак возможности изменения серий.
//
Функция ИзменениеИспользованияСерийПоКатегоииВозможно(КатегорияВладелец, НастройкаИспользованияСерий) Экспорт
	
	СтруктураВозврата = Новый Структура("ОтказПоДвижениямПоСериям, ОтказПоНастройкамСерийОбщиеПоКатегории, ОтказПоНастройкамСерийИндивидуальные", Ложь, Ложь, Ложь);
	
	Запрос = Новый Запрос;
	
	Если НастройкаИспользованияСерий = "ИзКатегории" Тогда
		
		Запрос.УстановитьПараметр("Категория", КатегорияВладелец);
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КатегорияНоменклатуры = &Категория
		|	И Номенклатура.ИспользоватьСерииНоменклатуры
		|	И НЕ Номенклатура.ИспользоватьСерииИзКатегории";
		
		СтруктураВозврата.ОтказПоНастройкамСерийОбщиеПоКатегории = Не Запрос.Выполнить().Пустой();
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если НастройкаИспользованияСерий = "Индивидуальные" Тогда
		
		Запрос.УстановитьПараметр("Категория", КатегорияВладелец);
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КатегорияНоменклатуры = &Категория
		|	И Номенклатура.ИспользоватьСерииНоменклатуры
		|	И Номенклатура.ИспользоватьСерииИзКатегории";
		
		СтруктураВозврата.ОтказПоНастройкамСерийИндивидуальные = Не Запрос.Выполнить().Пустой();
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", КатегорияВладелец);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвиженияСерииНоменклатуры.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
	|ГДЕ
	|	НЕ ДвиженияСерииНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И ДвиженияСерииНоменклатуры.Серия.Владелец = &Категория";
	
	СтруктураВозврата.ОтказПоДвижениямПоСериям = Не Запрос.Выполнить().Пустой();
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
