
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ИспользоватьРасчетПервойПоловиныМесяца.Установить(Значение);
	Константы.ИспользоватьНачислениеЗарплаты.Установить(Значение);
	Константы.ИспользоватьКадровыйУчет.Установить(Значение);
	Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(Значение);

	Справочники.ВидыНачисленийИУдержаний.УстановитьИспользованиеНалоги(Значение);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли