#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЖурналДокументыПоЗарплате");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности	
	
	ПараметрыОткрытия = Новый Структура("ЭтоНачальнаяСтраница", Ложь);
	ОткрытьФорму("ЖурналДокументов.ДокументыПоЗарплате.ФормаСписка", ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
