
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	
	МассивНаименований = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		МассивНаименований.Добавить(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Наименование);
	КонецЦикла;
	
	СписокПередУдалениемНаСервере(МассивНаименований);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	ПометитьНаУдалениеПодключаемоеОборудование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СписокПередУдалениемНаСервере(МассивНаименований)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПодключенияПроверкаЦенников.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияПроверкаЦенников КАК НастройкиПодключенияПроверкаЦенников
	|ГДЕ
	|	НастройкиПодключенияПроверкаЦенников.Наименование В(&МассивНаименований)";
	
	Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокПодключаемыхОборудований.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПодключаемоеОборудование"));
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеПодключаемоеОборудование()
	
	Для каждого ПодключаемоеОборудование Из СписокПодключаемыхОборудований Цикл
		
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ОфлайнОборудование");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ПодключаемоеОборудование.Значение);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			ПодключаемоеОборудованиеОбъект = ПодключаемоеОборудование.Значение.ПолучитьОбъект();  
			ПодключаемоеОборудованиеОбъект.ПометкаУдаления = Истина;
			ПодключаемоеОборудованиеОбъект.Записать();    
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти