#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЭтоСчетФактураНаАвансКорректировкаПоступления", Истина);
	ДанныеЗаполнения.Вставить("Ссылка", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Основание, ЭтоСчетФактураНаАвансКорректировкаПоступления", ДанныеЗаполнения, Истина);
	
	ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти
