////////////////////////////////////////////////////////////////////////////////
// Содержит процедуры для работы с регистром сведений Допустимые цели ВЕТИС.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает дерево значений со списком допустимых целей по каждой продукции
//
// Параметры:
//  МассивПродукции	 - Массив - Массив продукции документа
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево доступных целей с группировкой по продукции
//
Функция ДопустимыеЦелиПоПродукциям(МассивПродукции) Экспорт
	
	ТекстЗапроса = ПользователиВЕТИС.ТекстЗапросаРолейПользователя() +
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПродукцияВЕТИС.Ссылка КАК Продукция,
	|	ЦелиВЕТИС.Ссылка КАК Цель,
	|	ЦелиВЕТИС.ДляНекачественныхГрузов КАК НизкокачественнаяПродукция
	|ИЗ
	|	РегистрСведений.ДопустимыеЦелиПоГруппамВЕТИС КАК ДопустимыеЦелиПоГруппамПриказаВЕТИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыПродукцииПоГруппамВЕТИС КАК ВидыПродукцииПоГруппамПриказаВЕТИС
	|		ПО ВидыПродукцииПоГруппамПриказаВЕТИС.ГруппаПриказа = ДопустимыеЦелиПоГруппамПриказаВЕТИС.ГруппаПриказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|		ПО ПродукцияВЕТИС.Родитель.Идентификатор = ВидыПродукцииПоГруппамПриказаВЕТИС.ВидПродукцииИдентификатор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК РолиПользователяВЕТИС
	|		ПО РолиПользователяВЕТИС.РольПользователя = ВидыПродукцииПоГруппамПриказаВЕТИС.РольПользователя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦелиВЕТИС КАК ЦелиВЕТИС
	|		ПО ДопустимыеЦелиПоГруппамПриказаВЕТИС.ЦельИдентификатор = ЦелиВЕТИС.Идентификатор
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка В(&МассивПродукции)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПродукцияВЕТИС.Ссылка КАК Продукция,
	|	ЦелиВЕТИС.Ссылка КАК Цель,
	|	ЦелиВЕТИС.ДляНекачественныхГрузов КАК НизкокачественнаяПродукция
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК РолиПользователяВЕТИС
	|		ПО ИСТИНА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦелиВЕТИС КАК ЦелиВЕТИС
	|		ПО ИСТИНА
	|ГДЕ
	|	РолиПользователяВЕТИС.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РолиПользователейВЕТИС.ГосударственныйВетеринарныйВрач)
	|	И ПродукцияВЕТИС.Ссылка В(&МассивПродукции)
	|
	|	ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПродукцияВЕТИС.Ссылка,
	|	ЦелиВЕТИС.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦелиВЕТИС КАК ЦелиВЕТИС
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка В (&МассивПродукции)
	|	И ЦелиВЕТИС.Идентификатор В (&ИдентификаторыНизкокачественнойПродукции)
	|
	|	ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПродукцияВЕТИС.Ссылка,
	|	ЦелиВЕТИС.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦелиВЕТИС КАК ЦелиВЕТИС
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка В (&МассивПродукции)
	|	И ЦелиВЕТИС.Идентификатор В (&ИдентификаторыЦелиСырогоМолока)
	|	И ПродукцияВЕТИС.ВидПродукции.Идентификатор В (&ИдентификаторыСырогоМолока)
	|
	|ИТОГИ ПО
	|	Продукция";
	
	ИдентификаторыНизкокачественнойПродукции = ИдентификаторыНизкокачественнойПродукции();
	ИдентификаторыЦелиСырогоМолока           = ИдентификаторыЦелиСырогоМолока();
	
	ИдентификаторыСырогоМолока               = ПользователиВЕТИС.ИдентификаторыСырогоМолока();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивПродукции",                          МассивПродукции);
	Запрос.УстановитьПараметр("Пользователь",                             Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ИдентификаторыНизкокачественнойПродукции", ИдентификаторыНизкокачественнойПродукции);
	Запрос.УстановитьПараметр("ИдентификаторыЦелиСырогоМолока",           ИдентификаторыЦелиСырогоМолока);
	Запрос.УстановитьПараметр("ИдентификаторыСырогоМолока",               ИдентификаторыСырогоМолока);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

// Возвращает пересечение множеств допустимых целей по каждой продукции
//
// Параметры:
//  МассивПродукции	 - Массив - Массив продукции документа.
// 
// Возвращаемое значение:
//  Массив - массив допустимых целей.
//
Функция ПересечениеДопустимыхЦелейПоПродукциям(МассивПродукции, НизкокачественнаяПродукция) Экспорт
	
	Если НизкокачественнаяПродукция Тогда
		
		Возврат ИдентификаторыНизкокачественнойПродукции();
		
	Иначе
		
		МассивУникальнойПродукции = Новый Массив;
		Для Каждого Продукция Из МассивПродукции Цикл
			Если МассивУникальнойПродукции.Найти(Продукция) = Неопределено Тогда 
				МассивУникальнойПродукции.Добавить(Продукция);
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = ПользователиВЕТИС.ТекстЗапросаРолейПользователя() + 
		"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДопустимыеЦелиПоГруппамПриказаВЕТИС.ЦельИдентификатор КАК Цель,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродукцияВЕТИС.Ссылка)           КАК КоличествоПродукции
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ
		|	РегистрСведений.ДопустимыеЦелиПоГруппамВЕТИС КАК ДопустимыеЦелиПоГруппамПриказаВЕТИС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыПродукцииПоГруппамВЕТИС КАК ВидыПродукцииПоГруппамПриказаВЕТИС
		|		ПО (ВидыПродукцииПоГруппамПриказаВЕТИС.ГруппаПриказа = ДопустимыеЦелиПоГруппамПриказаВЕТИС.ГруппаПриказа)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК РолиПользователяВЕТИС
		|		ПО (РолиПользователяВЕТИС.РольПользователя = ВидыПродукцииПоГруппамПриказаВЕТИС.РольПользователя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
		|		ПО (ПродукцияВЕТИС.Родитель.Идентификатор = ВидыПродукцииПоГруппамПриказаВЕТИС.ВидПродукцииИдентификатор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК ПолныеПрава
		|		ПО (ПолныеПрава.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РолиПользователейВЕТИС.ГосударственныйВетеринарныйВрач))
		|ГДЕ
		|	ПолныеПрава.РольПользователя ЕСТЬ NULL
		|	И ПродукцияВЕТИС.Ссылка В(&МассивПродукции)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДопустимыеЦелиПоГруппамПриказаВЕТИС.ЦельИдентификатор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЦелиВЕТИС.Идентификатор,
		|	&КоличествоПродукции
		|ИЗ
		|	Справочник.ЦелиВЕТИС КАК ЦелиВЕТИС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК РолиПользователяВЕТИС
		|		ПО РолиПользователяВЕТИС.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РолиПользователейВЕТИС.ГосударственныйВетеринарныйВрач)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦелиВЕТИС.Идентификатор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДопустимыеЦелиПоГруппамПриказаВЕТИС.ЦельИдентификатор КАК Цель,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродукцияВЕТИС.Ссылка)           КАК КоличествоПродукции
		|ИЗ
		|	РегистрСведений.ДопустимыеЦелиПоГруппамВЕТИС КАК ДопустимыеЦелиПоГруппамПриказаВЕТИС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыПродукцииПоГруппамВЕТИС КАК ВидыПродукцииПоГруппамПриказаВЕТИС
		|		ПО (ВидыПродукцииПоГруппамПриказаВЕТИС.ГруппаПриказа = ДопустимыеЦелиПоГруппамПриказаВЕТИС.ГруппаПриказа)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК РолиПользователяВЕТИС
		|		ПО (РолиПользователяВЕТИС.РольПользователя = ВидыПродукцииПоГруппамПриказаВЕТИС.РольПользователя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
		|			ПО ПродукцияВЕТИС.Ссылка В(&МассивПродукции)
		|			И (ПродукцияВЕТИС.Родитель.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВерсионныхОбъектовВЕТИС.Удален)
		|			ИЛИ ПродукцияВЕТИС.ВидПродукции.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВерсионныхОбъектовВЕТИС.Удален)
		|			ИЛИ ПродукцияВЕТИС.Продукция.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВерсионныхОбъектовВЕТИС.Удален))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРолиПользователяВЕТИС КАК ПолныеПрава
		|		ПО (ПолныеПрава.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РолиПользователейВЕТИС.ГосударственныйВетеринарныйВрач))
		|ГДЕ
		|	ПолныеПрава.РольПользователя ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ДопустимыеЦелиПоГруппамПриказаВЕТИС.ЦельИдентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Итоговая.Цель КАК Цель
		|ИЗ
		|	ВТ_Итоговая КАК ВТ_Итоговая
		|ГДЕ
		|	ВТ_Итоговая.КоличествоПродукции = &КоличествоПродукции";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("МассивПродукции",     МассивУникальнойПродукции);
		Запрос.УстановитьПараметр("КоличествоПродукции", МассивУникальнойПродукции.Количество());
		Запрос.УстановитьПараметр("Пользователь",        Пользователи.ТекущийПользователь());
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Цель");
		
	КонецЕсли;
	
КонецФункции

// Возвращает массив допустимых целей по единственной переданной продукции
//
// Параметры:
//   Продукция - СправочникСсылка.ПродукцияВЕТИС - продукция, по которой необходимо получить цели
//   ДеревоКэш - ДеревоЗначений, Неопределено - дерево с кэшем полученных ранее целей
//   НизкокачественнаяПродукция - Булево, Неопределено - отбор по качеству продукции
//
// Возвращаемое значение:
//  Массив - массив допустимых целей
//
Функция ДопустимыеЦелиПоПродукции(Продукция, ДеревоКэш, НизкокачественнаяПродукция = Неопределено) Экспорт
	
	Если ДеревоКэш = Неопределено Тогда
		ДеревоКэш = Новый ДеревоЗначений;
	КонецЕсли;
	
	Если ДеревоКэш.Строки.Количество() = 0 Тогда
		
		ДеревоКэш = ДопустимыеЦелиПоПродукциям(Продукция);
		Возврат ПолучитьДопустимыеЦелиИзКэша(Продукция, ДеревоКэш, НизкокачественнаяПродукция);
		
	КонецЕсли;
	
	НайденнаяСтрока = ДеревоКэш.Строки.Найти(Продукция, "Продукция");
	Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
		
		Возврат ПолучитьДопустимыеЦелиИзКэша(Продукция, ДеревоКэш, НизкокачественнаяПродукция);
		
	Иначе
		
		ДеревоЦелей = ДопустимыеЦелиПоПродукциям(Продукция);
		МассивЦелей = ПолучитьДопустимыеЦелиИзКэша(Продукция, ДеревоЦелей, НизкокачественнаяПродукция);
		
		ДобавитьВКэш = ДеревоЦелей.Строки.Получить(0);
		
		ДобавляемаяСтрока = ДеревоКэш.Строки.Добавить();
		ДобавляемаяСтрока.Продукция = Продукция;
		Для каждого ДобавитьВКэшСтрокаСЦелью Из ДобавитьВКэш.Строки Цикл
			СтрокаЦели = ДобавляемаяСтрока.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЦели, ДобавитьВКэшСтрокаСЦелью, "Цель, НизкокачественнаяПродукция");
			СтрокаЦели.Продукция = Продукция;
		КонецЦикла;
		
		Возврат МассивЦелей;
		
	КонецЕсли;
	
КонецФункции

// Контролирует корректность указания целей в табличной части
//
// Параметры:
//  Объект	 - ДокументОбъект.* - проверяемый документ
//  Отказ	 - Булево - отказ проверки
//
Процедура ПроконтролироватьКорректностьУказанияЦелей(Объект, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПользователиВЕТИС.НеКонтролироватьДоступныеЦели КАК НеКонтролироватьДоступныеЦели
	|ИЗ
	|	Справочник.ПользователиВЕТИС КАК ПользователиВЕТИС
	|ГДЕ
	|	ПользователиВЕТИС.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	
	НеКонтролироватьДоступныеЦели = Ложь;
	Если Выборка.Следующий() Тогда
		НеКонтролироватьДоступныеЦели = Выборка.НеКонтролироватьДоступныеЦели;
	КонецЕсли;
	
	Если НеКонтролироватьДоступныеЦели Тогда
		Возврат
	КонецЕсли;
	
	ДеревоДопустимыхЦелей = ДопустимыеЦелиПоПродукциям(Объект.Товары.ВыгрузитьКолонку("Продукция"));
	
	Для каждого СтрокаПродукция Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаПродукция.Цель) Тогда
			НайденнаяСтрока = ДеревоДопустимыхЦелей.Строки.Найти(СтрокаПродукция.Продукция, "Продукция");
			Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				НайденнаяЦель = НайденнаяСтрока.Строки.Найти(СтрокаПродукция.Цель, "Цель");
				Если НЕ ЗначениеЗаполнено(НайденнаяЦель) Тогда
					
					ТекстОшибки = НСтр("ru='Указанная цель ""%Цель%"" не разрешена для продукции ""%Продукция%""'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки,"%Цель%", СтрокаПродукция.Цель);
					ТекстОшибки = СтрЗаменить(ТекстОшибки,"%Продукция%", СтрокаПродукция.Продукция);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						Объект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаПродукция.НомерСтроки, "Цель"),
						,
						Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеВРегистрахВидыПродукцииДопустимыеЦелиПоГруппамПриказаВЕТИС(ИсходныеДанныеКлассификатора, РольПользователя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПреобразованныеДанные = ПреобразованныеДанныеКлассификатора(ИсходныеДанныеКлассификатора, РольПользователя);
	
	ЗаполнитьВидыПродукцииПоГруппамПриказаВЕТИС(ПреобразованныеДанные.ВидыПродукцииПоГруппамВЕТИС, РольПользователя);
	ЗаполнитьДопустимыеЦелиПоГруппамПриказаВЕТИС(ПреобразованныеДанные.ДопустимыеЦелиПоГруппамВЕТИС);
	
КонецПроцедуры

Функция ПреобразованныеДанныеКлассификатора(ИсходныеДанные, РольПользователя, ПроверятьНаличиеГруппы = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ВидыПродукцииПоГруппамВЕТИС");
	ВозвращаемоеЗначение.Вставить("ДопустимыеЦелиПоГруппамВЕТИС");
	
	Если РольПользователя = Перечисления.РолиПользователейВЕТИС.УполномоченноеЛицо Тогда
		
		ГруппыПродукции = ГруппыПродукцииУполномоченныхЛиц();
		ВозвращаемоеЗначение.ВидыПродукцииПоГруппамВЕТИС = ПереченьПродукцииУполномоченныхЛиц(
			ГруппыПродукции,
			ИсходныеДанные.Продукция,
			ПроверятьНаличиеГруппы);
		ВозвращаемоеЗначение.ДопустимыеЦелиПоГруппамВЕТИС = ЦелиУполномоченныхЛиц(
			ГруппыПродукции,
			ИсходныеДанные.Цели,
			ПроверятьНаличиеГруппы);
		
	ИначеЕсли РольПользователя = Перечисления.РолиПользователейВЕТИС.АттестованныйСпециалист Тогда
		
		ГруппыПродукции = ГруппыПродукцииАттестованныхСпециалистов();
		ВозвращаемоеЗначение.ВидыПродукцииПоГруппамВЕТИС = ПереченьПродукцииАттестованныхСпециалистов(
			ГруппыПродукции,
			ИсходныеДанные.Продукция,
			ПроверятьНаличиеГруппы);
		ВозвращаемоеЗначение.ДопустимыеЦелиПоГруппамВЕТИС = ЦелиАттестованныхСпециалистов(
			ГруппыПродукции,
			ИсходныеДанные.Цели,
			ПроверятьНаличиеГруппы);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЦелиУполномоченныхЛиц(ГруппыПродукции, Источник, ПроверятьНаличиеГруппы)
	
	ДеревоЦелей = Новый ДеревоЗначений;
	ДеревоЦелей.Колонки.Добавить("ГруппаПриказа",     Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыПродукцииУполномоченныхЛиц"));
	ДеревоЦелей.Колонки.Добавить("ЦельНаименование",  Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип);
	ДеревоЦелей.Колонки.Добавить("ЦельИдентификатор", Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип);
	
	ИмяМетаданных = Метаданные.РегистрыСведений.ДопустимыеЦелиПоГруппамВЕТИС.ПолноеИмя();
	КолонкиДанных = ИнтеграцияВЕТИС.ПоляСтрокиДанныхКлассификатора(ИмяМетаданных);
	
	СтруктураПроверкиДублей = Новый Структура("ЦельНаименование, ЦельИдентификатор");
	ГруппаПриказа           = Неопределено;
	ТекущаяСтрокаГруппа     = Неопределено;
	
	Для Каждого СтрокаДанных Из Источник Цикл
		
		СтрГруппаПриказа                          = СтрокаДанных[КолонкиДанных.ГруппаПриказа];
		СтруктураПроверкиДублей.ЦельНаименование  = СтрокаДанных[КолонкиДанных.ЦельНаименование];
		СтруктураПроверкиДублей.ЦельИдентификатор = СтрокаДанных[КолонкиДанных.ЦельИдентификатор];
		
		Если ГруппаПриказа <> СтрГруппаПриказа Тогда
			
			ГруппаПриказа   = СтрГруппаПриказа;
			ГруппаПродукции = ГруппыПродукции.Получить(ГруппаПриказа);
			
			Если ГруппаПродукции = Неопределено Тогда
				Если ПроверятьНаличиеГруппы Тогда
					ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ТекущаяСтрокаГруппа = ДеревоЦелей.Строки.Найти(ГруппаПродукции, "ГруппаПриказа", Ложь);
			Если ТекущаяСтрокаГруппа = Неопределено Тогда
				ТекущаяСтрокаГруппа = ДеревоЦелей.Строки.Добавить();
				ТекущаяСтрокаГруппа.ГруппаПриказа = ГруппаПродукции;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекущаяСтрокаГруппа.Строки.НайтиСтроки(СтруктураПроверкиДублей).Количество() = 0 Тогда
			НоваяСтрока = ТекущаяСтрокаГруппа.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураПроверкиДублей);
			НоваяСтрока.ГруппаПриказа     = ТекущаяСтрокаГруппа.ГруппаПриказа;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДеревоЦелей;
	
КонецФункции

Функция ЦелиАттестованныхСпециалистов(ГруппыПродукции, Источник, ПроверятьНаличиеГруппы)
	
	ДеревоЦелей = Новый ДеревоЗначений;
	ДеревоЦелей.Колонки.Добавить("ГруппаПриказа",     Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыПродукцииАттестованныхСпециалистов"));
	ДеревоЦелей.Колонки.Добавить("ЦельНаименование",  Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип);
	ДеревоЦелей.Колонки.Добавить("ЦельИдентификатор", Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип);
	
	ИмяМетаданных = Метаданные.РегистрыСведений.ДопустимыеЦелиПоГруппамВЕТИС.ПолноеИмя();
	КолонкиДанных = ИнтеграцияВЕТИС.ПоляСтрокиДанныхКлассификатора(ИмяМетаданных);
	
	СтруктураПроверкиДублей = Новый Структура("ЦельНаименование, ЦельИдентификатор");
	ГруппаПриказа           = Неопределено;
	ТекущаяСтрокаГруппа     = Неопределено;
	
	Для Каждого СтрокаДанных Из Источник Цикл
		
		ЧастиСтрокиГруппыПриказа = СтрРазделить(СтрокаДанных[КолонкиДанных.ГруппаПриказа], ".");
		Если ЧастиСтрокиГруппыПриказа.Количество() = 1 Тогда
			СтрокаТипПродукции  = Неопределено;
			СтрокаГруппаПриказа = СокрЛП(ЧастиСтрокиГруппыПриказа[0]);
		ИначеЕсли ЧастиСтрокиГруппыПриказа.Количество() = 2 Тогда
			СтрокаТипПродукции  = Неопределено;
			СтрокаГруппаПриказа = СокрЛП(ЧастиСтрокиГруппыПриказа[1]);
		Иначе
			СтрокаТипПродукции  = СокрЛП(ЧастиСтрокиГруппыПриказа[2]);
			СтрокаГруппаПриказа = СокрЛП(ЧастиСтрокиГруппыПриказа[1]);
		КонецЕсли;
		
		СтруктураПроверкиДублей.ЦельНаименование  = СтрокаДанных[КолонкиДанных.ЦельНаименование];
		СтруктураПроверкиДублей.ЦельИдентификатор = СтрокаДанных[КолонкиДанных.ЦельИдентификатор];
		
		Если ГруппаПриказа <> СтрокаГруппаПриказа Тогда
			
			ГруппаПриказа = СтрокаГруппаПриказа;
			
			ГруппаПродукции = ГруппыПродукции.Получить(ГруппаПриказа);
			Если ГруппаПродукции = Неопределено И СтрокаТипПродукции <> Неопределено Тогда
				ГруппаПродукции = ГруппыПродукции.Получить(СтрокаГруппаПриказа + " / " + СтрокаТипПродукции);
			КонецЕсли;
			
			Если ГруппаПродукции = Неопределено Тогда
				Если ПроверятьНаличиеГруппы Тогда
					ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ТекущаяСтрокаГруппа = ДеревоЦелей.Строки.Найти(ГруппаПродукции, "ГруппаПриказа", Ложь);
			Если ТекущаяСтрокаГруппа = Неопределено Тогда
				ТекущаяСтрокаГруппа = ДеревоЦелей.Строки.Добавить();
				ТекущаяСтрокаГруппа.ГруппаПриказа = ГруппаПродукции;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекущаяСтрокаГруппа.Строки.НайтиСтроки(СтруктураПроверкиДублей).Количество() = 0 Тогда
			НоваяСтрока = ТекущаяСтрокаГруппа.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПроверкиДублей);
			НоваяСтрока.ГруппаПриказа = ТекущаяСтрокаГруппа.ГруппаПриказа;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДеревоЦелей;
	
КонецФункции

Функция ПереченьПродукцииУполномоченныхЛиц(ГруппыПродукции, Источник, ПроверятьНаличиеГруппы)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ГруппаПриказа",             Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыПродукцииУполномоченныхЛиц"));
	Таблица.Колонки.Добавить("ВидПродукцииИдентификатор", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	Таблица.Колонки.Добавить("ВидПродукцииНаименование",  Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип);
	
	ИмяМетаданных = Метаданные.РегистрыСведений.ВидыПродукцииПоГруппамВЕТИС.ПолноеИмя();
	КолонкиДанных = ИнтеграцияВЕТИС.ПоляСтрокиДанныхКлассификатора(ИмяМетаданных);
	
	ДобавленныеСтроки = Новый Соответствие;
	
	Для Каждого СтрокаДанных Из Источник Цикл
		
		ГруппаПриказаСтрока       = СтрокаДанных[КолонкиДанных.ГруппаПриказа];
		ВидПродукцииИдентификатор = СтрокаДанных[КолонкиДанных.ВидПродукцииИдентификатор];
		ВидПродукцииНаименование  = СтрокаДанных[КолонкиДанных.ВидПродукцииНаименование];
		
		ЗаполненныеВиды = ДобавленныеСтроки.Получить(ГруппаПриказаСтрока);
		Если ЗаполненныеВиды = Неопределено Тогда
			ЗаполненныеВиды = Новый Соответствие;
			ДобавленныеСтроки.Вставить(ГруппаПриказаСтрока, ЗаполненныеВиды);
		КонецЕсли;
		
		СтрокаТаблицы = ЗаполненныеВиды.Получить(ВидПродукцииИдентификатор);
		Если СтрокаТаблицы <> Неопределено Тогда
			Если СтрНайти(СтрокаТаблицы.ВидПродукцииНаименование, ВидПродукцииНаименование) = 0 Тогда
				СтрокаТаблицы.ВидПродукцииНаименование = СтрокаТаблицы.ВидПродукцииНаименование + ", "+ ВидПродукцииНаименование;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ГруппаПриказа = ГруппыПродукции.Получить(ГруппаПриказаСтрока);
		
		Если Не ЗначениеЗаполнено(ГруппаПриказа) Тогда
			Если ПроверятьНаличиеГруппы Тогда
				ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска группы приказа'");
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока                           = Таблица.Добавить();
		НоваяСтрока.ГруппаПриказа             = ГруппаПриказа;
		НоваяСтрока.ВидПродукцииИдентификатор = ВидПродукцииИдентификатор;
		НоваяСтрока.ВидПродукцииНаименование  = ВидПродукцииНаименование;
		
		ЗаполненныеВиды.Вставить(ВидПродукцииИдентификатор, НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПереченьПродукцииАттестованныхСпециалистов(ГруппыПродукции, Источник, ПроверятьНаличиеГруппы)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ГруппаПриказа",             Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыПродукцииАттестованныхСпециалистов"));
	Таблица.Колонки.Добавить("ВидПродукцииИдентификатор", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	Таблица.Колонки.Добавить("ВидПродукцииНаименование",  Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип);
	
	ИмяМетаданных = Метаданные.РегистрыСведений.ВидыПродукцииПоГруппамВЕТИС.ПолноеИмя();
	КолонкиДанных = ИнтеграцияВЕТИС.ПоляСтрокиДанныхКлассификатора(ИмяМетаданных);
	
	ДобавленныеСтроки = Новый Соответствие;
	Для Каждого СтрокаДанных Из Источник Цикл
		
		ЧастиСтрокиГруппыПриказа = СтрРазделить(СтрокаДанных[КолонкиДанных.ГруппаПриказа], ".");
		Если ЧастиСтрокиГруппыПриказа.Количество() = 1 Тогда
			ТипПродукцииНаименование  = Неопределено;
			ГруппаПриказаСтрока       = ЧастиСтрокиГруппыПриказа[0];
		ИначеЕсли ЧастиСтрокиГруппыПриказа.Количество() = 2 Тогда
			ТипПродукцииНаименование = Неопределено;
			ГруппаПриказаСтрока      = СокрЛП(ЧастиСтрокиГруппыПриказа[1]);
		Иначе
			ТипПродукцииНаименование = СокрЛП(ЧастиСтрокиГруппыПриказа[2]);
			ГруппаПриказаСтрока      = СокрЛП(ЧастиСтрокиГруппыПриказа[1]);
		КонецЕсли;
		
		ГруппаПриказа = ГруппыПродукции.Получить(ГруппаПриказаСтрока);
		Если ГруппаПриказа = Неопределено Тогда
			СтрокаПоиска = ГруппаПриказаСтрока + " / " + ТипПродукцииНаименование;
			ГруппаПриказа = ГруппыПродукции.Получить(СтрокаПоиска);
			Если Не ЗначениеЗаполнено(ГруппаПриказа) Тогда
				Если ПроверятьНаличиеГруппы Тогда
					ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска группы приказа'");
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполненныеВиды = ДобавленныеСтроки.Получить(ГруппаПриказа);
		Если ЗаполненныеВиды = Неопределено Тогда
			ЗаполненныеВиды = Новый Соответствие;
			ДобавленныеСтроки.Вставить(ГруппаПриказа, ЗаполненныеВиды);
		КонецЕсли;
		
		ВидПродукцииИдентификатор = СтрокаДанных[КолонкиДанных.ВидПродукцииИдентификатор];
		ВидПродукцииНаименование  = СтрокаДанных[КолонкиДанных.ВидПродукцииНаименование];
		
		СтрокаТаблицы = ЗаполненныеВиды.Получить(ВидПродукцииИдентификатор);
		Если СтрокаТаблицы <> Неопределено Тогда
			Если СтрНайти(СтрокаТаблицы.ВидПродукцииНаименование, ВидПродукцииНаименование) = 0 Тогда
				СтрокаТаблицы.ВидПродукцииНаименование = СтрокаТаблицы.ВидПродукцииНаименование + ", "+ ВидПродукцииНаименование;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ГруппаПриказа) Тогда
			Если ПроверятьНаличиеГруппы Тогда
				Продолжить;
			Иначе
				ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска группы приказа'");
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		
		НоваяСтрока.ГруппаПриказа             = ГруппаПриказа;
		НоваяСтрока.ВидПродукцииИдентификатор = ВидПродукцииИдентификатор;
		НоваяСтрока.ВидПродукцииНаименование  = ВидПродукцииНаименование;
		
		ЗаполненныеВиды.Вставить(ВидПродукцииИдентификатор, НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ГруппыПродукцииУполномоченныхЛиц() Экспорт
	
	ГруппыПродукции = Новый Соответствие;
	
	Для каждого ПеречислениеСсылка Из Перечисления.ГруппыПродукцииУполномоченныхЛиц Цикл
		
		ГруппыПродукции.Вставить(Строка(ПеречислениеСсылка), ПеречислениеСсылка);
		
	КонецЦикла;
	
	Возврат ГруппыПродукции;
	
КонецФункции

Функция ГруппыПродукцииАттестованныхСпециалистов() Экспорт
	
	ГруппыПродукции = Новый Соответствие;
	
	Для каждого ПеречислениеСсылка Из Перечисления.ГруппыПродукцииАттестованныхСпециалистов Цикл
		
		ГруппыПродукции.Вставить(Строка(ПеречислениеСсылка), ПеречислениеСсылка);
		
	КонецЦикла;
	
	Возврат ГруппыПродукции;
	
КонецФункции

Процедура ЗаполнитьВидыПродукцииПоГруппамПриказаВЕТИС(ТаблицаПеречень, РольПользователя)
	
	НаборЗаписей = РегистрыСведений.ВидыПродукцииПоГруппамВЕТИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РольПользователя.Установить(РольПользователя);
	
	Для каждого СтрокаТаблицы Из ТаблицаПеречень Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
		НоваяЗапись.РольПользователя = РольПользователя;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьДопустимыеЦелиПоГруппамПриказаВЕТИС(ДеревоЦелей)
	
	Для каждого СтрокаДерева Из ДеревоЦелей.Строки Цикл
		
		НаборЗаписей = РегистрыСведений.ДопустимыеЦелиПоГруппамВЕТИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ГруппаПриказа.Установить(СтрокаДерева.ГруппаПриказа);
		Для каждого СтрокаЦели Из СтрокаДерева.Строки Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаЦели);
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДопустимыеЦелиИзКэша(Продукция, ДеревоКэш, НизкокачественнаяПродукция)
	
	СтрокаПродукции = ДеревоКэш.Строки.Найти(Продукция, "Продукция");
	
	Если СтрокаПродукции = Неопределено Тогда
		ДеревоКэш.Строки.Добавить().Продукция = Продукция;
		Возврат Новый Массив;
	КонецЕсли;
	
	Если НизкокачественнаяПродукция = Неопределено Тогда
		Возврат СтрокаПродукции.Строки.ВыгрузитьКолонку("Цель");
	Иначе
		РезультатСУчетомКачества = Новый Массив;
		Для Каждого СтрокаЦели Из СтрокаПродукции.Строки Цикл
			Если СтрокаЦели.НизкокачественнаяПродукция = НизкокачественнаяПродукция Тогда
				РезультатСУчетомКачества.Добавить(СтрокаЦели.Цель);
			КонецЕсли;
		КонецЦикла;
		Возврат РезультатСУчетомКачества;
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторыНизкокачественнойПродукции() Экспорт
	
	ИдентификаторыНизкокачественнойПродукции = Новый Массив;
	ИдентификаторыНизкокачественнойПродукции.Добавить("8670b7f0-5274-4d68-02a1-30262a34402f"); // Утилизация.
	ИдентификаторыНизкокачественнойПродукции.Добавить("5b90d858-e089-11e1-bcf3-b499babae7ea"); // Переработка.
	
	Возврат ИдентификаторыНизкокачественнойПродукции;
	
КонецФункции

Функция ИдентификаторыЦелиСырогоМолока() Экспорт
	
	ИдентификаторыЦелиСырогоМолока = Новый Массив;
	ИдентификаторыЦелиСырогоМолока.Добавить("f13b0cc7-1ea1-417f-aa8f-2da419113057"); // Для производства детского питания.
	ИдентификаторыЦелиСырогоМолока.Добавить("5b910aa4-e089-11e1-bcf3-b499babae7ea"); // Использование в пищевой промышленности.
	ИдентификаторыЦелиСырогоМолока.Добавить("5b90d858-e089-11e1-bcf3-b499babae7ea"); // Переработка.
	ИдентификаторыЦелиСырогоМолока.Добавить("a8a8180f-f40c-48ba-a70e-c533c806f2c8"); // Переработка в пищу людям.
	ИдентификаторыЦелиСырогоМолока.Добавить("95a023e1-6971-48c1-be9d-e18dc6c99366"); // Промышленная переработка.
	
	Возврат ИдентификаторыЦелиСырогоМолока;
	
КонецФункции

#КонецОбласти
