
#Область ПрограммныйИнтерфейс

// Завершение фискализация чека в очереди
//
// Параметры:
//  ИдентификаторФискальнойЗаписи - Строка - Идентификатор фискальной записи
//  ПараметрыФискализации - Структура - Параметры операции
//  ОборудованиеККТ - СправочникСсылка.ПодключаемоеОборудование -
//  РезультатФискализации - Структура - Результат Фискализации
//  РезультатВыполненияПакетнойОперации - Структура -
//    * Результат - Булево - Результат выполнения пакета операций.
//    * ОписаниеОшибки - ИнформацияОбОшибке - Описание ошибки выполнения пакета операции.
//    * РезультатВыполненияЭквайринговойОперации - Структура - 
//                                   См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании()
//    * РезультатФискализацииЧека - Структура - 
//                                   См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании()
//    * РезультатФискализацииЧекаВыдачи - Структура - 
//                                   См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании()
//    * РезультатФискализацииЧекаКоррекции - Структура - 
//                                   См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании()
//    * РезультатАварийнойОтменыОперации - Структура - 
//                                   См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании()
//    * ПараметрыЭквайринговойОперации - Структура - структура для передачи данных в пакетной операции
//                                   См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков()
//    * ПараметрыПродажаСВыдачейНаличных - Структура - структура для передачи данных в пакетной операции
//                                   См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков()
Процедура ФискализацияЧекаВОчереди(ИдентификаторФискальнойЗаписи, ПараметрыФискализации, ОборудованиеККТ, РезультатФискализации, РезультатВыполненияПакетнойОперации, ОбъектОбработан = Истина) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ФискализироватьЧекЗавершение(
		РезультатФискализации, 
		ПараметрыФискализации,
		ОбъектОбработан);
		
	ОбщегоНазначенияРМКПереопределяемый.ФискализироватьЧекЗавершение(РезультатФискализации, ПараметрыФискализации,
		РезультатВыполненияПакетнойОперации);
	
КонецПроцедуры

// Завершение фискализация чека в очереди
//
// Параметры:
//  РеквизитыЧека - Структура - Данные документа основания.
//  СтатусДокументаИзменен - Булево - признак изменения статуса документа.
//
Процедура ПроверитьСтатусДокументаОснования(РеквизитыЧека, СтатусДокументаИзменен) Экспорт
	
КонецПроцедуры

// Возвращает доступность распределенной фискализации.
//  
// Параметры:
//  РаспределеннаяФискализацииДоступна - Булево - Доступность распределенной фискализации.
//  СтандартнаяОбработка - Булево - Стандартная обработка.
//
Процедура ДоступноРаспределеннаяФискализация(РаспределеннаяФискализацииДоступна, СтандартнаяОбработка) Экспорт
	
	РаспределеннаяФискализацииДоступна = Ложь;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Обрабатывает результат взаимодействия чека с сервисом облачных касс.
//
// Параметры:
//  Документ - ОпределяемыйТип.ОснованиеФискальнойОперацииБПО - Документ операции.
//  СтатусДокументаВСервисе - Строка - статус документа в сервисе.
//  РеквизитыЧека - Структура - Данные документа основания.
//  ТекстОшибки - Строка - текст ошибки сервиса.
//
Процедура ОбработатьСтатусПостановкиЧекаВОблачныйСервис(Документ, СтатусДокументаВСервисе, РеквизитыЧека, ТекстОшибки = "") Экспорт

КонецПроцедуры

// Заполняет данные по чеку для создания фискальной операции, если чек не был помещен в очередь.
//
// Параметры:
//  ПараметрыОперацииЧека - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека - структура данных по чеку для заполнения.
//  ДокументОперации - ОпределяемыйТип.ОснованиеФискальнойОперацииБПО - документ для формирования данных по чеку.
//
Процедура ЗаполнитьДанныеФискализации(ПараметрыОперацииЧека, ДокументОперации) Экспорт

КонецПроцедуры

#КонецОбласти

