Функция РеквизитыЗаказа(ПараметрыЗаказа) Экспорт
	
	Заказ = ?(ТипЗнч(ПараметрыЗаказа) = Тип("Массив"), ПараметрыЗаказа[0], ПараметрыЗаказа);
	
	РеквизитыЗаказа = Новый Структура();
	РеквизитыЗаказа.Вставить("Организация", 			"Организация");
	РеквизитыЗаказа.Вставить("Префикс",					"Организация.Префикс");
	РеквизитыЗаказа.Вставить("Номер",					"Номер");
	РеквизитыЗаказа.Вставить("ДатаДокумента",			"Дата");

	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда

		РеквизитыЗаказа.Вставить("ЗаказПокупателя", 	"Ссылка");
		РеквизитыЗаказа.Вставить("ВидОперации", "ВидОперации");
		
	ИначеЕсли ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда

		РеквизитыЗаказа.Вставить("ЗаказПокупателя", 	"Запасы.ЗаказПокупателя");
		РеквизитыЗаказа.Вставить("ЗаказНаПроизводство", "Ссылка");

	ИначеЕсли ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		РеквизитыЗаказа.Вставить("ЗаказНаПеремещение",  "Ссылка");
		
	КонецЕсли;
	
	ПустойЗаказ			= Документы.ЗаказПокупателя.ПустаяСсылка();
	РеквизитыЗаказа 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заказ, РеквизитыЗаказа);	

	Представление		= Заказ.Метаданные().Представление();
	НомерДокумента  	= ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(
		РеквизитыЗаказа.ДатаДокумента,
		РеквизитыЗаказа.Номер, 
		РеквизитыЗаказа.Префикс);
		
	ДатаДокумента 		= Формат(РеквизитыЗаказа.ДатаДокумента, "ДЛФ=DD");

	Если РеквизитыЗаказа.Свойство("ЗаказПокупателя")
		И ТипЗнч(РеквизитыЗаказа.ЗаказПокупателя) = Тип("РезультатЗапроса") Тогда
		
		РеквизитыЗаказа.ЗаказПокупателя = РеквизитыЗаказа.ЗаказПокупателя.Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(РеквизитыЗаказа.ЗаказПокупателя, ПустойЗаказ);
		РеквизитыЗаказа.ЗаказПокупателя = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РеквизитыЗаказа.ЗаказПокупателя);
		
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗаказа) = Тип("Массив") Тогда

		ШаблонЗаголовка		= НСтр("ru='Создание заказов поставщикам по выбранным документам (%1)'");
		ЗаголовокПодборки	= СтрШаблон(ШаблонЗаголовка, ПараметрыЗаказа.Количество());
		
		РеквизитыЗаказа.Вставить(ПараметрыЗаказа[0].Метаданные().Имя, ПараметрыЗаказа);
		
	Иначе
		
		ШаблонЗаголовка		= НСтр("ru='%1 № %2 от %3: Создание заказов поставщикам'");
		ЗаголовокПодборки	= СтрШаблон(ШаблонЗаголовка, Представление, НомерДокумента, ДатаДокумента);

	КонецЕсли;

	РеквизитыЗаказа.Вставить("ЗаголовокПодборки", 		ЗаголовокПодборки); 
	РеквизитыЗаказа.Вставить("СпособПополнения",  		"Закупки");
	РеквизитыЗаказа.Вставить("СформироватьПриОткрытии", Истина);
	
	Возврат РеквизитыЗаказа;
	
КонецФункции
