
#Область ПрограммныйИнтерфейс

// См. процедуру ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы.
//
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ЭтоМобильныйКлиент = Ложь;
	
	#Если МобильныйКлиент Тогда
		ЭтоМобильныйКлиент = Истина;
	#КонецЕсли
	
	Если ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Копирует в буфер обмена операционной системы указанный текст. Не работает в режиме веб-клиента и мобильного клиента.
// 
// Параметры:
// 	Текст - Строка - текст, который нужно скопировать.
// 	ТекстОповещения - Строка - текст, который нужно вывести в оповещении после успешного копирования.
Процедура СкопироватьВБуферОбмена(Текст, ТекстОповещения) Экспорт

#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	
	Попытка
		ОбъектЗапись = Новый COMОбъект("htmlfile");
		ОбъектЗапись.ParentWindow.ClipboardData.Setdata("Text", Текст);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Успешно'"),
				, ТекстОповещения);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Возникла ошибка при копировании в буфер обмена.
				|Воспользуйтесь комбинацией клавиш Ctrl+C.'"));
	КонецПопытки;
	
#КонецЕсли

КонецПроцедуры

#КонецОбласти
