#Область ПрограммныйИнтерфейс

// Показывает состояние выполнения действия.
//
// Параметры:
//  Результат - Структура   - любая структура, ожидаются ключи "КодОшибки", "ОписаниеОшибки".
//  ДополнительныеПараметры  - Структура - 
//  ВывестиСообщениеОбОшибке - Булево - Признак вывода сообщения.
//
Процедура ВывестиСостояние(Результат, ДополнительныеПараметры, ВывестиСообщениеОбОшибке = Ложь) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ПустаяСтрока(Результат.КодОшибки) Тогда
		Если ВывестиСообщениеОбОшибке И Результат.Свойство("ОписаниеОшибки") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ОписаниеОшибки);
		КонецЕсли;

		Если ДополнительныеПараметры <> Неопределено Тогда
			Состояние(ДополнительныеПараметры.ОписаниеДействия,, ДополнительныеПараметры.РезультатСОшибками);
		КонецЕсли;
	ИначеЕсли ДополнительныеПараметры <> Неопределено Тогда
		Состояние(ДополнительныеПараметры.ОписаниеДействия,, ДополнительныеПараметры.УспешныйРезультат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


