#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьИзмененияПодразделенийИЗарегистрироватьНеобходимостьОтправки(СистемаБронирования, 
	Источник, 
	ИспользуетсяОтборПоПодразделениям) Экспорт

	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();

	Если ИзменившиесяДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивСотрудниковДляДобавления = Новый Массив;
	МассивСотрудниковДляУдаления = Новый Массив;

	ПричинаПоУсловию = Перечисления.ПричиныОтправкиСотрудниковБронированияКомандировок.ПоУсловию;

	Для Каждого СтрокаИзменения Из ИзменившиесяДанные Цикл
		Если СтрокаИзменения.Добавление Тогда
			ФизическоеЛицо = СтрокаИзменения.НовоеЗначениеГоловнойСотрудник.ФизическоеЛицо;
			Если СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
				РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляДобавления, ФизическоеЛицо);
			ИначеЕсли СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
				РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляУдаления, ФизическоеЛицо);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Если МассивСотрудниковДляДобавления.Количество() > 0 Тогда
		РегистрыСведений.ФизическиеЛицаБронированияКомандировок.ЗарегистрироватьИзмененияСотрудниковВСпискеОтправляемых(
			СистемаБронирования, МассивСотрудниковДляДобавления, ПричинаПоУсловию, Истина);
	КонецЕсли;
	Если МассивСотрудниковДляУдаления.Количество() > 0 Тогда
		РегистрыСведений.ФизическиеЛицаБронированияКомандировок.УдалитьСотрудниковИзСпискаОтправляемых(
			СистемаБронирования, МассивСотрудниковДляУдаления);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьОтборПоДолжностиПоШтатномуРасписанию(Параметры, СписокПодразделений) Экспорт
	
	
КонецПроцедуры

Функция ПодразделенияБронированияКомандировок(СистемаБронирования) Экспорт
	
	
КонецФункции

#КонецОбласти