#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ОснованиеПечатиЗаказПокупателя", Константы.ОснованиеПечатиЗаказПокупателя.Получить());
	КэшЗначений.Вставить("ОснованиеПечатиСчетНаОплату", Константы.ОснованиеПечатиСчетНаОплату.Получить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТекущийОбъект.ОснованиеПечатиЗаказПокупателя <> КэшЗначений.ОснованиеПечатиЗаказПокупателя Тогда
		
		Константы.ОснованиеПечатиЗаказПокупателя.Установить(ТекущийОбъект.ОснованиеПечатиЗаказПокупателя);
		
	КонецЕсли;
	
	Если ТекущийОбъект.ОснованиеПечатиСчетНаОплату <> КэшЗначений.ОснованиеПечатиСчетНаОплату Тогда
		
		Константы.ОснованиеПечатиСчетНаОплату.Установить(ТекущийОбъект.ОснованиеПечатиСчетНаОплату);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
