#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗаголовокФормы", НСтр("ru = 'Инструкция ""Как создать факсимиле печати""'"));

	ПараметрыКомандыПечати = Новый Массив;
	ПараметрыКомандыПечати.Добавить(ПараметрКоманды);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Организации",
		"НапечататьПомощникСозданияФаксимилеПечати", ПараметрыКомандыПечати, ПараметрыВыполненияКоманды.Источник,
		ДополнительныеПараметры);

КонецПроцедуры

#КонецОбласти
