#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Будет удалена в следующей версии программы.
// @skip-warning ПустойМетод - переопределяемый метод.
//
Процедура ОбработкаЗакрытияФормыНачалаРаботы(ЗначенияРеквизитов, ПараметрыНачалаРаботы, ОбработкаЗавершена) Экспорт
	
КонецПроцедуры

// Устарела. Будет удалена в следующей версии программы.
// @skip-warning ПустойМетод - переопределяемый метод.
//
Процедура ДозаполнитьПараметрыОткрытияФормы(ПараметрыОткрытия, ПараметрыНачалаРаботы) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

