#Область СлужебныйПрограммныйИнтерфейс

// ЭлектронноеВзаимодействие.БазоваяФункциональность.ОбработкаНеисправностей

// См. ОбработкаНеисправностейБЭДСобытияКлиент.ПриИнициализацииКонтекстаДиагностики
Процедура ПриИнициализацииКонтекстаДиагностики(КонтекстДиагностики) Экспорт
	
	ОбменСКонтрагентамиИнтеграцияКлиентСерверСобытия.ПриИнициализацииКонтекстаДиагностики(КонтекстДиагностики);
	
КонецПроцедуры

// См. ОбработкаНеисправностейБЭДСобытияКлиент.ПриИнициализацииОшибки
Процедура ПриИнициализацииОшибки(Ошибка) Экспорт
	
	ОбменСКонтрагентамиИнтеграцияКлиентСерверСобытия.ПриИнициализацииОшибки(Ошибка);
	
КонецПроцедуры

// См. ОбработкаНеисправностейБЭДСобытияКлиент.ПриДобавленииОшибки
Процедура ПриДобавленииОшибки(КонтекстДиагностики, Ошибка) Экспорт
	
	ОбменСКонтрагентамиИнтеграцияКлиентСерверСобытия.ПриДобавленииОшибки(КонтекстДиагностики, Ошибка);
	
КонецПроцедуры

// См. ОбработкаНеисправностейБЭДСобытияКлиент.ПередФормированиемФайлаДляТехподдержки
Процедура ПередФормированиемФайлаДляТехподдержки(ТехническаяИнформация, ОповещениеОЗавершении) Экспорт
	
	ДиагностикаЭДОКлиент.ПередФормированиемФайлаДляТехподдержки(ТехническаяИнформация, ОповещениеОЗавершении);
	
КонецПроцедуры

// См. ОбработкаНеисправностейБЭДСобытияКлиент.ПриОпределенииПараметровОбращенияВТехподдержку
Процедура ПриОпределенииПараметровОбращенияВТехподдержку(ПараметрыОбращения, КонтекстДиагностики) Экспорт
	
	ДиагностикаЭДОКлиент.ПриОпределенииПараметровОбращенияВТехподдержку(ПараметрыОбращения, КонтекстДиагностики);
	
КонецПроцедуры

// Конец ЭлектронноеВзаимодействие.БазоваяФункциональность.ОбработкаНеисправностей

// СтандартныеПодсистемы.УправлениеПечатью

// См. ЭлектронноеВзаимодействиеКлиент.ОбработкаНавигационнойСсылкиВФормеПечатиБСП.
Процедура ОбработкаНавигационнойСсылкиВФормеПечатиБСП(НавигационнаяСсылка, Параметры = Неопределено) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ОбработкаНавигационнойСсылкиВФормеПечатиБСП(НавигационнаяСсылка, Параметры);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеКлиент.ПечатьДокументовОбработкаНавигационнойСсылки
Процедура ПечатьДокументовОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ПечатьДокументовОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеКлиент.ПечатьДокументовВыполнитьКоманду
Процедура ПечатьДокументовВыполнитьКоманду(Форма, Команда, ПродолжитьВыполнениеНаСервере, ДополнительныеПараметры) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ПечатьДокументовВыполнитьКоманду(Форма, Команда, ПродолжитьВыполнениеНаСервере, ДополнительныеПараметры);
		
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеКлиент.ПечатьДокументовОбработкаОповещения
Процедура ПечатьДокументовОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ПечатьДокументовОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеПечатью

// СтандартныеПодсистемы.ОбщегоНазначения

// См. ЭлектронноеВзаимодействиеКлиент.ПослеНачалаРаботыСистемы
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ИнтеграцияЭДОСобытияКлиент.ПослеНачалаРаботыСистемы();
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеКлиент.ОбработкаПереходаПоНавигационнойСсылке
//
Процедура ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка) Экспорт
	
	ИнтеграцияЭДОСобытияКлиент.ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, 
		СтандартнаяОбработка);
	
КонецПроцедуры

// См. ОбщегоНазначенияКлиентПереопределяемый.ПередПериодическойОтправкойДанныхКлиентаНаСервер
//
Процедура ПередПериодическойОтправкойДанныхКлиентаНаСервер(Параметры) Экспорт
	
	АвтоматическоеПолучениеЭДОКлиент.ПередПериодическойОтправкойДанныхКлиентаНаСервер(Параметры);
	
КонецПроцедуры

// См. ОбщегоНазначенияКлиентПереопределяемый.ПослеПериодическогоПолученияДанныхКлиентаНаСервере
//
Процедура ПослеПериодическогоПолученияДанныхКлиентаНаСервере(Результаты) Экспорт
	
	АвтоматическоеПолучениеЭДОКлиент.ПослеПериодическогоПолученияДанныхКлиентаНаСервере(Результаты);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбщегоНазначения

#КонецОбласти