#Область ПрограммныйИнтерфейс

// Подписка на события при копировании документа.
//
// Параметры:
// 	Источник - ДокументОбъект
Процедура ПриКопированииОбъекта(Источник) Экспорт

	Если Не ПустаяСтрока(Источник.Комментарий) Тогда
		Источник.Комментарий = "";
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ИдентификаторПлатежа", Источник.Метаданные()) Тогда
		Источник.ИдентификаторПлатежа = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Список выбора типов оснований электронного письма.
// 
// Возвращаемое значение:
//  СписокЗначений - Список выбора типов оснований электронного письма
//
Функция СписокВыбораТиповОснованийЭлектронногоПисьма() Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	ТипыОснования = ДоступныеТипыМенюВыбораОснованияЭлектронногоПисьма();
	
	Для Каждого ТипОснования Из ТипыОснования Цикл

		МетаданныеТипа = Метаданные.НайтиПоТипу(ТипОснования);
		Если Не ПравоДоступа("Чтение", МетаданныеТипа) Или МетаданныеТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеОбъекта = МетаданныеТипа.ПредставлениеОбъекта;
		Представление = ?(ПустаяСтрока(ПредставлениеОбъекта), МетаданныеТипа.Синоним, ПредставлениеОбъекта);
		
		Если ТипОснования = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			Представление = НСтр("ru = 'Отчет комитенту'");
		КонецЕсли;
		
		ФормаВыбора = СтрШаблон("%1.ФормаВыбора", МетаданныеТипа.ПолноеИмя()); 
		
		СписокВыбора.Добавить(ФормаВыбора, Представление);
		
	КонецЦикла;
	
	СписокВыбора.СортироватьПоПредставлению();
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеТипыМенюВыбораОснованияЭлектронногоПисьма()

	ТипыОснований = ТипыОснованийМенюПодбораОснованияЭлектронногоПисьма();
	
	ФункциональныеОпцииТиповОснований = ФункциональныеОпцииТиповОснованийМенюПодбора();
	
	ДоступныеТипы = ФункциональныеОпцииУНФ.ДоступныеТипыПоФункциональнымОпциям(
		ТипыОснований, ФункциональныеОпцииТиповОснований);
	
	Возврат ДоступныеТипы;

КонецФункции

Функция ТипыОснованийМенюПодбораОснованияЭлектронногоПисьма()
	
	ТипыОснований = Новый Массив;
	
	Для Каждого ТипОснования Из Метаданные.ОпределяемыеТипы.ОснованиеСобытия.Тип.Типы() Цикл
		Если ОбщегоНазначения.ЭтоСсылка(ТипОснования) Тогда
			ТипыОснований.Добавить(ТипОснования);
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ТипыОснований;
	
КонецФункции

Функция ФункциональныеОпцииТиповОснованийМенюПодбора()

	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АвансовыйОтчет"),        "ИспользоватьАвансовыеОтчеты");

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктВыполненныхРабот"),   "ИспользоватьАктыВыполненныхРабот");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Взаимозачет"),           "КорректировкиДолга");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Доверенность"),          "ИспользоватьПодсистемуЗакупки");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаданиеНаРаботу"),       "ИспользоватьЗаданияНаРаботу");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПеремещение"),    "УчетПоНесколькимСкладам");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомитенту"),        "ПриемТоваровНаКомиссию");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетОПереработке"), 	   "ПереработкаДавальческогоСырья");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетПереработчика"),    "ПередачаСырьяВПереработку");	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПриемИПередачаВРемонт"), "ИспользоватьРемонты");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПеремещениеПоЯчейкам"),  "УчетПоЯчейкам");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.РасходДСПлан"), 		   "ПлатежныйКалендарь");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"), 			   "ИспользоватьСобытия");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СверкаВзаиморасчетов"),  "СверкиВзаиморасчетов");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СдельныйНаряд"), 	       "ИспользоватьТехоперации");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетФактураПолученный"), "ИспользоватьСчетаФактурыВходящие");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетНаОплату"),          "ИспользоватьСчетаНаОплату");

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктОРасхождениях"), "ИспользоватьКорректировкиПоступлений");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОперацияПоПлатежнымКартам"), "ИспользоватьОплатуКартами");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.УстановкаЦенНоменклатуры"),  "ИспользоватьУстановкуЦен");
	
	ИмяФункциональнойОпции = "ИспользоватьКорректировкиРеализаций"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктОРасхожденияхПолученный"),  ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.КорректировкаРеализации"), 	 ИмяФункциональнойОпции);
		
	ИмяФункциональнойОпции = "ИспользоватьПодсистемуЗакупки"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПоставщику"), 		     ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика"),      ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "ИспользоватьПодсистемуЗарплата"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПлатежнаяВедомость"), 	     ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Табель"), 			         ИмяФункциональнойОпции);

	ИмяФункциональнойОпции = "ИспользоватьБанкИКассу"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПлатежноеПоручение"),          ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПоступлениеВКассу"),           ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПоступлениеНаСчет"),           ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.РасходИзКассы"),               ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.РасходСоСчета"),               ИмяФункциональнойОпции);

	ИмяФункциональнойОпции = "ИспользоватьПодсистемуПроизводство"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"),         ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СборкаЗапасов"),               ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.УчетВремени"),                 ИмяФункциональнойОпции);

	ИмяФункциональнойОпции = "ИспользоватьПодсистемуСклад"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ИнвентаризацияЗапасов"),       ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОприходованиеЗапасов"),        ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПеремещениеЗапасов"),          ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПересортицаЗапасов"),          ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СписаниеЗапасов"),             ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "ПередачаТоваровНаКомиссию"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионера"),           ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"),  ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПереоценкаТоваровНаКомиссии"), ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "УчетРозничныхПродаж"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"),     ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЧекККМ"),                      ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЧекККМВозврат"),               ИмяФункциональнойОпции);

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.РасходыПредпринимателя"), 
		"ИспользоватьДокументРасходыПредпринимателя");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"),
		"ПередачаТоваровМеждуОрганизациями");
		
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), "ИспользоватьДоговорыКонтрагентов");

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

#КонецОбласти