
#Область ПрограммныйИнтерфейс

// Открывает помощник выбора контактной информации контактов
//  и дальнейшего экспорта данных в адресные книги сервиса рассылок.
//
// Параметры:
//  Контакты - 	 - Массив из ОпределяемыйТип.КонтактСобытия - Выбранные контакты.
//
Процедура ЭкспортКонтактовВСервисРассылок(Контакты) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипКоманды", "ЭкспортВСервис");
	ПараметрыФормы.Вставить("Адресаты", Контакты);
	ОткрытьФорму("ОбщаяФорма.ДобавлениеПолучателейВРассылки", ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму экспорта данных в адресные книги сервиса рассылок.
//
// Параметры:
//  АдресВХранилище	 - Строка	 - Адрес временного хранилища, содержащего таблицу значений:
//  	* Контакт - ОпределяемыйТип.КонтактСобытия - Выбранный контакт.
//  	* КакСвязаться - Строка - Контактная информация контакта.
//
Процедура ЭкспортКонтактнойИнформацииВСервисРассылок(АдресВХранилище) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипКоманды", "ДобавлениеВАдреснуюКнигу");
	ПараметрыФормы.Вставить("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("ОбщаяФорма.ДобавлениеПолучателейВРассылки", ПараметрыФормы);
	
КонецПроцедуры

// Открывает помощник выбора контактной информации контактов
//  и дальнейшего добавления данных в созданные массовые рассылки.
//
// Параметры:
//  Контакты - Массив из ОпределяемыйТип.КонтактСобытия - Выбранные контакты.
//  СпособОтправки - ПеречислениеСсылка.ВидыКаналовСвязи - Способ отправки массовой рассылки.
//
Процедура ДобавитьКонтактыВМассовыеРассылки(Контакты, СпособОтправки) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипКоманды", "ДобавлениеВРассылку");
	ПараметрыФормы.Вставить("Адресаты", Контакты);
	ПараметрыФормы.Вставить("СпособОтправки", СпособОтправки);
	ОткрытьФорму("ОбщаяФорма.ДобавлениеПолучателейВРассылки", ПараметрыФормы);
	
КонецПроцедуры

// См. СтандартныеПодсистемыКлиент.ПриПолученииСерверногоОповещения.
//
// Параметры:
//  ИмяОповещения - Строка - имя оповещения, полученное от сервера для идентификации оповещения
//  Результат - Произвольные - данные от сервера
//
Процедура ПриПолученииСерверногоОповещения(ИмяОповещения, Результат) Экспорт
	
	Если ИмяОповещения <> МассовыеРассылкиУНФКлиентСервер.ИмяСерверногоОповещения() Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("МассовыеРассылки_Отправить", Результат);
	
КонецПроцедуры

#КонецОбласти