#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ОбъектДОТип) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ПричинаПрерывания", ПричинаПрерывания);
	
	МассивТекстСообщения = Новый Массив;
	
	Если Параметры.ОбъектДОТип = "DMDocument" Тогда
		МассивТекстСообщения.Добавить(НСтр("ru = 'Будет выполнено прерывание обработки документа'"));
		
	ИначеЕсли Параметры.ОбъектДОТип = "DMMeeting" Тогда
		МассивТекстСообщения.Добавить(НСтр("ru = 'Будет выполнено прерывание обработки мероприятия'"));
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип объекта обработки %1.'"), Параметры.ОбъектДОТип);
		
	КонецЕсли;
	
	МассивТекстСообщения.Добавить(" ");
	МассивТекстСообщения.Добавить("""");
	МассивТекстСообщения.Добавить(Параметры.ОбъектДО);
	МассивТекстСообщения.Добавить("""");
	МассивТекстСообщения.Добавить(".");
	МассивТекстСообщения.Добавить(Символы.ПС);
	МассивТекстСообщения.Добавить(Символы.ПС);
	МассивТекстСообщения.Добавить(НСтр("ru = 'Информация о выполнении будет помещена в историю.'"));
	МассивТекстСообщения.Добавить(Символы.ПС);
	МассивТекстСообщения.Добавить(Символы.ПС);
	МассивТекстСообщения.Добавить(НСтр("ru = 'Внимание! Все внесенные изменения будут необратимыми.'"));
	
	ТекстСообщения = СтрСоединить(МассивТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрерватьОбработку(Команда)
	
	Результат = Новый Структура("ПричинаПрерывания", СтрЗаменить(ПричинаПрерывания, Символы.ПС, " "));
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти