
#Область ПрограммныйИнтерфейс

Процедура Подключаемый_ОсуществитьОбменПоОрганизацииИзПанелиОтправки() Экспорт
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОсуществитьОбменПоОрганизацииИзПанелиОтправки();
	
КонецПроцедуры

Процедура Подключаемый_ОтложенноПоказатьРезультатОбновления() Экспорт
	
	ДлительнаяОтправкаКлиент.ПоказатьРезультатОбмена();
	
КонецПроцедуры

Процедура Подключаемый_ОсуществитьОбменПоОрганизациям() Экспорт
	
	ИнтерфейсыВзаимодействияБРОКлиент.ОсуществитьОбменПоОрганизациямОбъекта();
	
КонецПроцедуры

Процедура Подключаемый_ЗарегистрироватьМЧДРРВыгрузка() Экспорт
	
	ДокументооборотСКОКлиент.ЗарегистрироватьМЧДРРВыгрузка();
	
КонецПроцедуры

Процедура Подключаемый_ОтменитьМЧДРРВыгрузка() Экспорт
	
	ДокументооборотСКОКлиент.ОтменитьМЧДРРВыгрузка();
	
КонецПроцедуры

Процедура Подключаемый_ИмпортироватьСертификатКриптографии() Экспорт
	
	КриптографияЭДКОСлужебныйКлиент.ИмпортироватьСертификатКриптографии();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


