///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИНН = Параметры.ИНН;
	Контрагент = Параметры.Контрагент;
	ВидКонтрагента = СПАРКРискиКлиентСервер.ВидКонтрагента(ИНН);
	ПараметрыПроцедуры = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
	ПараметрыПроцедуры.ВариантОтображения = "ВКарточке";
	ПараметрыПроцедуры.ВариантОтображенияФакторовРиска = "ВКарточке";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СПАРКРиски.ПриСозданииНаСервере(
			ЭтотОбъект,
			Неопределено,
			Контрагент,
			ВидКонтрагента,
			ПараметрыПроцедуры);
	Иначе
		СПАРКРиски.ПриСозданииНаСервере(
			ЭтотОбъект,
			Неопределено,
			ИНН,
			ВидКонтрагента,
			ПараметрыПроцедуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СПАРКРискиКлиент.ПриОткрытии(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СПАРКРискиКлиент.ОбработкаОповещения(
		ЭтотОбъект,
		Неопределено,
		ИмяСобытия,
		Параметр,
		Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИндексыСПАРКРискиОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПереданаБухгалтерскаяОтчетностьОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура КартинкаИндексОбщийНажатие(Элемент, СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		"SPARK:WhatIsCompositeIndex",
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСводныйИндикаторОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИндексДОНажатие(Элемент, СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		"SPARK:WhatIsIndexOfDueDiligence",
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИндексФРНажатие(Элемент, СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		"SPARK:WhatIsFailureScore",
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИндексПДНажатие(Элемент, СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		"SPARK:WhatIsPaymentIndex",
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИДОЗначениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИФРЗначениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИПДЗначениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИндексыСПАРКРискиСтатусЗначениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеИндексыСПАРК()
	ОбновитьОтображениеИндексыСПАРК();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИндексыСПАРК()
	
	ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
	ПараметрыОтображения.ВариантОтображения = "ВКарточке";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
			ИндексыСПАРКРиски,
			Неопределено,
			Контрагент,
			ВидКонтрагента,
			ЭтотОбъект,
			ПараметрыОтображения);
	Иначе
		СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
			ИндексыСПАРКРиски,
			Неопределено,
			ИНН,
			ВидКонтрагента,
			ЭтотОбъект,
			ПараметрыОтображения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеФакторовРискаСПАРК()
	ОбновитьОтображениеФакторовРискаСПАРК();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеФакторовРискаСПАРК()
	ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
	ПараметрыОтображения.ВариантОтображенияФакторовРиска = "ВКарточке";
	СПАРКФакторыРискаКлиент.ОтобразитьФакторыРиска(
		ФакторыРискаСПАРК,
		Объект,
		Объект.ИНН,
		ЭтотОбъект,
		ПараметрыОтображения);
КонецПроцедуры

#КонецОбласти
