#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	ТребуетсяУстановитьРабочийСтолПользователя = ТребуетсяУстановитьРабочийСтолПользователя();
	Параметры.Вставить(
	"ТребуетсяУстановитьРабочийСтолПользователяУНФ", ТребуетсяУстановитьРабочийСтолПользователя);
	
	ТребуетсяУстановитьНастройкиСоставаИнтерфейса = ТребуетсяУстановитьНастройкиСоставаИнтерфейса();
	Параметры.Вставить(
	"ТребуетсяУстановитьНастройкиСоставаИнтерфейсаПользователяУНФ", ТребуетсяУстановитьНастройкиСоставаИнтерфейса);
	
КонецПроцедуры

// Определяет состав форм рабочего стола в зависимости от прав доступа пользователя.
//
// Параметры:
//  СоставФормИзменен	 - Булево	 - Признак изменения состава форм рабочего стола в процедуре
//
Процедура УстановитьРабочийСтолПользователя(СоставФормИзменен = Ложь) Экспорт
	
	УстановитьСоставФорм(СоставФормИзменен, , Истина);
	
КонецПроцедуры

// Определяет состав форм рабочего стола в зависимости от прав доступа пользователя.
//
// Параметры:
//  СоставФормИзменен	 - Булево	 - Признак изменения состава форм рабочего стола в процедуре
//  ИмяПользователя		 - Строка	 - Имя пользователя, для которого следует изменить состав форм рабочего стола
//  ПроверятьНеобходимостьУстановки - Булево - если Истина, то проверяется необходимость установки форм перед
//                                             непосредственной установкой
//
Процедура УстановитьСоставФорм(
	СоставФормИзменен = Ложь, ИмяПользователя = "", ПроверятьНеобходимостьУстановки = Ложь) Экспорт
	
	Если ПроверятьНеобходимостьУстановки И Не ТребуетсяУстановитьРабочийСтолПользователя() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	СоставФорм.ЛеваяКолонка.Очистить();
	
	ТребуетсяУстановитьСоставФормПравойКолонки = Истина;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.ВиджетНаНачальнойСтранице");
	ИначеЕсли МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность20() Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.ВиджетНаНачальнойСтраницеМПУНФ");
	// Конец МобильноеПриложение
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.Обработки.ПульсБизнеса)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ОтображатьПульсБизнеса") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПульсБизнеса.Форма.ПульсБизнеса");
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ДокументыПоПродажам)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьПодсистемуПродажи") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ДокументыПоПродажам.ФормаСписка");
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ДокументыПоЗакупкам)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьПодсистемуЗакупки") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ДокументыПоЗакупкам.ФормаСписка");
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ДокументыПоСкладу)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьПодсистемуСклад") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ДокументыПоСкладу.ФормаСписка");
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ДокументыПоПроизводству)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ФункциональнаяОпцияИспользоватьПодсистемуПроизводство") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ДокументыПоПроизводству.ФормаСписка");
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ДокументыПоЗарплате) 
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ФункциональнаяОпцияИспользоватьПодсистемуЗарплата") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ДокументыПоЗарплате.ФормаСписка");
	ИначеЕсли ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ДокументыПоБанку)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ОтображатьДокументыПоБанку") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ЖурналДокументов.ДокументыПоБанку.ФормаСписка");
	ИначеЕсли ПравоДоступа("Изменение", Метаданные.Справочники.ЗаписиКалендаряПодготовкиОтчетности)
		И ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьКалендарьПодготовкиОтчетности") Тогда
		СоставФорм.ЛеваяКолонка.Добавить(
		"Справочник.ЗаписиКалендаряПодготовкиОтчетности.Форма.КалендарьНалоговИОтчетности");
	ИначеЕсли ВозможностиПриложения.КонстантаДоступнаВПриложении("ИнтерфейсВыставлениеСчетов") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("Документ.ЗаказПокупателя.Форма.ФормаСписка");
	ИначеЕсли ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьРаботуСПоискомКонтрагентовВСписке") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("Справочник.Контрагенты.Форма.ФормаСписка");
	КонецЕсли;
	
	СоставФорм.ПраваяКолонка.Очистить();
	Если ВозможностиПриложения.КонстантаДоступнаВПриложении("ИспользоватьРаботуСНовостями") Тогда
		СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.НовостиИИнформационныйЦентр");
	КонецЕсли;
	Если ВозможностиПриложения.КонстантаДоступнаВПриложении("ОтображатьТекущиеДела") Тогда
		СоставФорм.ПраваяКолонка.Добавить("Обработка.ТекущиеДела.Форма");
	КонецЕсли;
	
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
		"Общее/НастройкиНачальнойСтраницы", "", НастройкиНачальнойСтраницы, , ИмяПользователя);
	Иначе
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
		"Общее/НастройкиНачальнойСтраницы", "", НастройкиНачальнойСтраницы);
	КонецЕсли;
	
	СоставФормИзменен = Истина;
	
КонецПроцедуры

// Определяет состав клиентского интерфейса приложения.
//
// Параметры:
//  ИмяПользователя		 - Строка	 - Имя пользователя, для которого следует изменить состав клиентского интерфейса
//  ПроверятьНеобходимостьУстановки - Булево - если Истина, то проверяется необходимость установки интерфейса перед
//                                             непосредственной установкой
//
Процедура УстановитьНастройкиСоставаИнтерфейса(ИмяПользователя = "", ПроверятьНеобходимостьУстановки = Ложь) Экспорт
	
	Если ПроверятьНеобходимостьУстановки И Не ТребуетсяУстановитьНастройкиСоставаИнтерфейса() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРаботуСПоискомКонтрагентовВСписке") Тогда
		Лево = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
		Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
		НастройкиСостава.Лево.Добавить(Лево);
	КонецЕсли;
	
	Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	Настройки.УстановитьСостав(НастройкиСостава);
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
		"Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки, ,ИмяПользователя);
	Иначе
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
		"Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки);
	КонецЕсли;
	
КонецПроцедуры

// Изменяет начальную страницу и клиентский интерфейс по функциональным опциям
//
// Параметры:
//  ИмяПользователя - Строка - если не указано, то используется текущий пользователь
//  ПроверятьНеобходимостьУстановки - Булево - если Истина, то проверяется необходимость установки перед
//                                             непосредственной установкой
//
Процедура УстановитьНачальнуюСтраницуИИнтерфейс(ИмяПользователя = "", ПроверятьНеобходимостьУстановки = Ложь) Экспорт
	
	УстановитьСоставФорм(, ИмяПользователя, ПроверятьНеобходимостьУстановки);
	УстановитьНастройкиСоставаИнтерфейса(ИмяПользователя, ПроверятьНеобходимостьУстановки);
	
КонецПроцедуры

// Очищение настроек состава форм рабочего стола для всех пользователей ИБ
//
Процедура ОчиститьРабочийСтол() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь Из ПользователиИБ Цикл
		
		НастройкиНачальнойСтраницы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
		"Общее/НастройкиНачальнойСтраницы", "",,, Пользователь.Имя);
		
		Если НастройкиНачальнойСтраницы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
		"Общее/НастройкиНачальнойСтраницы", "", Неопределено, , Пользователь.Имя);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Очищение настроек состава форм клиенствого интерфейса для всех пользователей ИБ
//
Процедура ОчиститьНастройкиСоставаИнтерфейса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь Из ПользователиИБ Цикл
		
		НастройкиНачальнойСтраницы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
		"Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "",,, Пользователь.Имя);
		
		Если НастройкиНачальнойСтраницы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
		"Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Неопределено, , Пользователь.Имя);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Установить форму на начальную страницу.
// 
// Параметры:
//  ИмяФормы - Строка
Процедура УстановитьФормуНаНачальнуюСтраницу(ИмяФормы) Экспорт
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	СоставФорм = Новый СоставФормНачальнойСтраницы;
	СоставФорм.ЛеваяКолонка.Добавить(ИмяФормы);
	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
	
КонецПроцедуры

// Установить пустую настройку интерфейса.
Процедура УстановитьПустуюНастройкуИнтерфейса() Экспорт
	
	Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	Настройки.УстановитьСостав(НастройкиСостава);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки);
	
КонецПроцедуры

// Установить пустую начальную страницу.
Процедура УстановитьПустуюНачальнуюСтраницу() Экспорт
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	СоставФорм = Новый СоставФормНачальнойСтраницы;
	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
	
КонецПроцедуры

// Установлена пустая начальная страница.
// 
// Возвращаемое значение:
//  Булево - Установлена пустая начальная страница
Функция УстановленаПустаяНачальнаяСтраница() Экспорт
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы", "");
	Если Настройки = Неопределено Или ТипЗнч(Настройки) <> Тип("НастройкиНачальнойСтраницы") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставФорм = Настройки.ПолучитьСоставФорм();
	Возврат СоставФорм.ЛеваяКолонка.Количество() = 0 И СоставФорм.ПраваяКолонка.Количество() = 0;
	
КонецФункции

// Проверяет наличие настройки рабочего стола
// 
// Возвращаемое значение:
//  Булево - Требуется установить рабочий стол пользователя
Функция ТребуетсяУстановитьРабочийСтолПользователя() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено()
		И Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиНачальнойСтраницы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
	"Общее/НастройкиНачальнойСтраницы", "");
	
	Возврат НастройкиНачальнойСтраницы = Неопределено;
	
КонецФункции

// Проверяет наличие настройки интерфейса
// 
// Возвращаемое значение:
//  Булево - Требуется установить настройки состава интерфейса
Функция ТребуетсяУстановитьНастройкиСоставаИнтерфейса() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено()
		И Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиИнтерфейсаКлиентскогоПриложения = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
	"Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "");
	
	Возврат НастройкиИнтерфейсаКлиентскогоПриложения = Неопределено;
	
КонецФункции

#КонецОбласти
