
#Область ПрограммныйИнтерфейс

// Проверка возможности установки реквизита "Состояние" объекта
// 
// Параметры:
//  Объект - ДокументСсылка
// 
// Возвращаемое значение:
//  Булево- Установка состояния возможна
Функция ПроверитьВозможностьУстановкиСостояния(Объект) Экспорт
	
	ДопустимыеТипыДокументов = ДопустимыеТипыДокументовИзмененияСостояния();
	ТипОбъекта = ТипЗнч(Объект);
	
	Результат = ДопустимыеТипыДокументов.Найти(ТипОбъекта) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Возвращает типы документов, для которых предусмотрено изменение реквизита "Состояние".
// 
// Возвращаемое значение:
//  Массив из Тип
Функция ДопустимыеТипыДокументовИзмененияСостояния() Экспорт
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.Событие"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаданиеНаРаботу"));
	
	Возврат ТипыДокументов;
	
КонецФункции

// Возвращает типы документов, для которых предусмотрено изменение реквизита "Выполнена" (булево).
// 
// Возвращаемое значение:
//  Массив из Тип
Функция ДопустимыеТипыДокументовИзмененияРеквизитаВыполнена() Экспорт
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗадачаСотрудника"));
	
	Возврат ТипыДокументов;
	
КонецФункции

#КонецОбласти
