#Область СлужебныйПрограммныйИнтерфейс

Функция ВидОшибкиНедействительныйПользователь() Экспорт
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "НедействительныйПользователь";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Пользователь недействителен'");
	ВидОшибки.ОписаниеПроблемы = НСтр("ru = 'Обработка электронных документов запрещена'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Обратитесь к администратору для настройки параметров пользователя.'");
	
	Возврат ВидОшибки;
	
КонецФункции

// См. КриптографияБЭДСлужебныйКлиентСервер.РежимыПроверкиСертификата
Функция РежимыПроверкиСертификата() Экспорт
	Режимы = Новый Структура;
	Режимы.Вставить("ТолькоКвалифицированные", ЭлектроннаяПодписьСлужебныйКлиентСервер.ТолькоКвалифицированные());
	Режимы.Вставить("ПроверятьКвалифицированные", ЭлектроннаяПодписьСлужебныйКлиентСервер.ПроверятьКвалифицированные());
	Режимы.Вставить("НеПроверятьСертификат", ЭлектроннаяПодписьСлужебныйКлиентСервер.НеПроверятьСертификат());
	Возврат Режимы;
КонецФункции

#КонецОбласти