#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере( Отказ, СтандартнаяОбработка )

	Если Не ЗначениеЗаполнено( Запись.ИсходныйКлючЗаписи ) Тогда
	
    	Запись.ЛогированиеВключено = Истина;
		Запись.ДлительностьХраненияЗаписейДней = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейПоУмолчанию();
		Запись.ПлановаяДатаОтключения = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаПоУмолчанию();
    	
  	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаОтключенияПриИзменении(Элемент)

	ДлительностьОтключенияЛогаДнейМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьОтключенияЛогаДнейМаксимальная();
	ПлановаяДатаОтключенияРасчет = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаМаксимальная();
	Если Запись.ПлановаяДатаОтключения > ПлановаяДатаОтключенияРасчет Тогда

		Запись.ПлановаяДатаОтключения = ПлановаяДатаОтключенияРасчет;
		
		СообщениеТекстШаблон = НСтр( "ru = 'Изменена плановая дата отключения лога.
		|Максимальное количество дней: %1'" );
		СообщениеТекст = СтрШаблон( СообщениеТекстШаблон, ДлительностьОтключенияЛогаДнейМаксимальная );

		ПоказатьПредупреждение( , СообщениеТекст );

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьХраненияЗаписейДнейПриИзменении(Элемент)

	ДлительностьХраненияЗаписейДнейМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейМаксимальная();
	Если Запись.ДлительностьХраненияЗаписейДней > ДлительностьХраненияЗаписейДнейМаксимальная Тогда

		Запись.ДлительностьХраненияЗаписейДней = ДлительностьХраненияЗаписейДнейМаксимальная;
		
		СообщениеТекстШаблон = НСтр( "ru = 'Изменена длительность хранения дней.
		|Максимальное количество дней: %1'" );
		СообщениеТекст = СтрШаблон(СообщениеТекстШаблон, ДлительностьХраненияЗаписейДнейМаксимальная );
		
		ПоказатьПредупреждение( , СообщениеТекст );

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере( Отказ, ТекущийОбъект, ПараметрыЗаписи )

	ОбменСВнешнимиСистемамиЛогирование.ЛогНастройкиПроверитьИЗаполнить( ТекущийОбъект );
	
КонецПроцедуры

#КонецОбласти