#Область ПрограммныйИнтерфейс

// Заполняет соответствие полей документов-оснований и накладной САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных, например "РеализацияТоваровУслуг"
//  * Значение - Соответствие из КлючИЗначение:
//    ** ГрузоотправительОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации грузоотправителя
//    ** ГрузоотправительМестоХранения     - Строка - имя поля документа, которое соответствует месту хранения грузоотправителя
//    ** ГрузополучательОрганизацияСАТУРН  - Строка - имя поля документа, которое соответствует организации грузополучателя
//    ** ГрузополучательМестоХранения      - Строка - имя поля документа, которое соответствует месту хранения грузополучателя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийНакладнойСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и акта инвентаризации САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных, например "ОприходованиеТоваров"
//  * Значение - Соответствие из КлючИЗначение:
//    ** ОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации САТУРН
//    ** МестоХранения     - Строка - имя поля документа, которое соответствует месту хранения грузоотправителя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийАктаИнвентаризацииСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и акта применения САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных, например "ПроизводствоТоваров"
//  * Значение - Соответствие из КлючИЗначение:
//    ** ОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации САТУРН
//    ** МестоХранения     - Строка - имя поля документа, которое соответствует месту хранения грузоотправителя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийАктаПримененияСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и импорта продукции САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных, например "РеализацияТоваровУслуг"
//  * Значение - Соответствие из КлючИЗначение:
//    ** ОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации САТУРН
//    ** МестоХранения     - Строка - имя поля документа, которое соответствует месту хранения грузоотправителя
//    ** Грузоотправитель  - Строка - имя поля документа, которое соответствует грузоотправителю импорта.
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийИмпортаПродукцииСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и плана применения САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных, например "РеализацияТоваровУслуг"
//  * Значение - Соответствие из КлючИЗначение:
//    ** ОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации САТУРН
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийПланаПримененияСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и производственной операции САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных
//  * Значение - Соответствие из КлючИЗначение:
//    ** ОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации САТУРН
//    ** МестоХранения     - Строка - имя поля документа, которое соответствует месту хранения грузоотправителя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийЗапросаОстатковПартийСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и производственной операции САТУРН
// 
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * Ключ - Строка - имя документа в метаданных, например "ПроизводствоТоваров"
//  * Значение - Соответствие из КлючИЗначение:
//    ** ОрганизацияСАТУРН - Строка - имя поля документа, которое соответствует организации САТУРН
//    ** МестоХранения     - Строка - имя поля документа, которое соответствует месту хранения грузоотправителя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийПроизводственнойОперацииСАТУРН(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
