
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоУстановкиКонстанты = ПравоДоступа("Изменение", Метаданные.Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки)
		Или ПравоДоступа("Изменение", Метаданные.Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи);
	
	Если ЕстьПравоУстановкиКонстанты Тогда
		ТекстДействие = ""; 
	Иначе
		ТекстДействие = "Для включения обратитесь к своему администратору.";
		Элементы.Да.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Надпись.Заголовок = СтрШаблон(Элементы.Надпись.Заголовок, ТекстДействие);
	
КонецПроцедуры
