
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПодсказкиЭтаповЗакрытия();
	
	ТекДата = ТекущаяДатаСеанса();
	ТекГод = Год(ТекДата);
	Если Параметры.Свойство("ТекущиеДела") Тогда
		ПрошлыйМесяц = ДобавитьМесяц(ТекДата, -1);
		ТекГод = Год(ПрошлыйМесяц);
		ТекМесяц = Месяц(ПрошлыйМесяц);
	ИначеЕсли Параметры.Свойство("Месяц") И ЗначениеЗаполнено(Параметры.Месяц) Тогда
		ТекГод = Год(Параметры.Месяц);
		ТекМесяц = Месяц(Параметры.Месяц);
	Иначе
		ТекМесяц = Месяц(ТекДата);
	КонецЕсли;
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	КонецЕсли; 
	Для ии = 1 По 12 Цикл
		Для каждого ИмяСекции Из ВсеСекцииПроверки() Цикл
			ИмяРеквизита = СтрШаблон("%1%2", ИмяСекции, ии);
			ЭтотОбъект[ИмяРеквизита] = Истина;
		КонецЦикла; 
		ИмяРеквизита = СтрШаблон("ПредварительныйАнализ%1", ии);
		ЭтотОбъект[ИмяРеквизита] = 1;
	КонецЦикла; 
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.Организация.Видимость = Ложь;
	ИначеЕсли Константы.УчетПоКомпании.Получить() Тогда
		Организация = Справочники.Организации.ОрганизацияКомпания();
		Элементы.Организация.Доступность = Ложь;
		Элементы.Организация.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;		
	КонецЕсли;
	
	ЗакрыватьПоМесяцам = Истина;
	
	УстановитьТекстНадписей();
	
	УчетИмущества = Константы.ФункциональнаяОпцияУчетВнеоборотныхАктивов.Получить();
	УчетРозничныхПродаж = Константы.ФункциональнаяОпцияСуммовойУчетВРознице.Получить();
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	РасчетФинансовогоРезультата = ПолучитьФункциональнуюОпцию("ИспользоватьРасчетФинансовогоРезультата");
	ИспользоватьРаспределениеЗатрат = ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеЗатрат");
	УчетВРазличныхЕдиницахИзмерения = ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения");
	ЗачетАвансаПоЕдиномуНалоговомуСчету =  ТекДата > '20230101'; 
	
	Для Сч = 1 По 12 Цикл
		Элементы.Найти("ГруппаНачислениеАмортизации" + Сч).Видимость = УчетИмущества;
		Элементы.Найти("ГруппаРасчетСебестоимостиВРознице" + Сч).Видимость = УчетРозничныхПродаж;
		Элементы.Найти("ГруппаРасчетКурсовыхРазниц" + Сч).Видимость = УчетВалютныхОпераций;
		Элементы.Найти("ГруппаРасчетФинансовогоРезультата" + Сч).Видимость = РасчетФинансовогоРезультата;
		Элементы.Найти("ГруппаРаспределениеЗатрат" + Сч).Видимость = ИспользоватьРаспределениеЗатрат;
		Элементы.Найти("ГруппаПроверкаЕдиницИзмерения" + Сч).Видимость = УчетВРазличныхЕдиницахИзмерения;
	КонецЦикла;
	
	НастроитьОтображенияДатыЗапретаРедактирования();
	УстановитьВидимостьЭлементовДляМобильногоКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПометкуТекМесяц();
	ОбновитьОтображениеПоВариантуЗакрытия();
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьФоновоеЗаданиеПолучениеДанных", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ФоновоеЗаданиеЗакрытиеМесяцаЗапущено Тогда
		ПредупредитьОАктивномФоновомЗадании(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДатыЗапретаИзмененияПриЗакрытии" Тогда
		
		ДатаЗапрета = ПолучитьДатуЗапретаРедактирования();
		
		Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
			ДатаЗапретаРедактирования = ДатаЗапрета;
		Иначе
			Элементы.ДатаЗапретаРедактирования.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Элементы.Месяцы.Доступность = ЗначениеЗаполнено(Организация);
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияExtendedTooltipОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = Новый Структура("СтрокаПоиска", НСтр("ru = 'в целом'"));
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыФормы);		

КонецПроцедуры

&НаКлиенте
Процедура ДатаЗапретаРедактированияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.ДатыЗапретаИзменения", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ФоновоеЗаданиеЗакрытиеМесяцаЗапущено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Месяцы.ТекущаяСтраница = Элементы.М1 Тогда
		ТекМесяц = 1;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М2 Тогда
		ТекМесяц = 2;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М3 Тогда
		ТекМесяц = 3;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М4 Тогда
		ТекМесяц = 4;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М5 Тогда
		ТекМесяц = 5;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М6 Тогда
		ТекМесяц = 6;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М7 Тогда
		ТекМесяц = 7;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М8 Тогда
		ТекМесяц = 8;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М9 Тогда
		ТекМесяц = 9;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М10 Тогда
		ТекМесяц = 10;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М11 Тогда
		ТекМесяц = 11;
	ИначеЕсли Элементы.Месяцы.ТекущаяСтраница = Элементы.М12 Тогда
		ТекМесяц = 12;
	КонецЕсли;
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробноНажатие(Элемент)
	
	ЭтоКартинка = (Элемент.Вид = ВидДекорацииФормы.Картинка);
	Если ЭтоКартинка Тогда
		ИмяГруппы = СтрШаблон("Группа%1", СтрЗаменить(Элемент.Имя, "Картинка", "Подробно"));
	Иначе
		ИмяГруппы = СтрШаблон("Группа%1", СтрЗаменить(Элемент.Имя, "Описание", "Подробно"));
	КонецЕсли; 
	ВидимостьГруппы = НЕ Элементы[ИмяГруппы].Видимость;
	
	// Сворачиваем все развернутые группы подробностей
	Для ии = 1 По 12 Цикл
		НомерМесяца = Строка(ии);
		Для каждого ИмяСекции Из ВсеСекции() Цикл
			ИмяГруппыСвернуть = СтрШаблон("Группа%1Подробно%2", ИмяСекции, НомерМесяца);
			Если Элементы[ИмяГруппыСвернуть].Видимость Тогда
				Элементы[ИмяГруппыСвернуть].Видимость = Ложь;
				ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, ии);
				СтрокаСекция = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ии, ИмяСекции);
				Если СтрокаСекция <> Неопределено И СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрыт() Тогда
					Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеВыполненоСОшибками();
				ИначеЕсли СтрокаСекция <> Неопределено Тогда 
					Элементы[ИмяЭлементаОписание].Заголовок = ТекстОшибкиПередЗакрытием();
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
	Элементы[ИмяГруппы].Видимость = ВидимостьГруппы;
	Если ВидимостьГруппы Тогда
		Если ЭтоКартинка Тогда
			ИмяЭлементаОписание = СтрЗаменить(Элемент.Имя, "Картинка", "Описание");
			Элементы[ИмяЭлементаОписание].Заголовок = НСтр("ru = 'скрыть детали'");
		Иначе
			Элемент.Заголовок = НСтр("ru = 'скрыть детали'");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйАнализПриИзменении(Элемент)

	ИмяИзменяемогоРеквизита = СтрШаблон("ПредварительныйАнализ%1", ТекМесяц);
	Если ЭтотОбъект[ИмяИзменяемогоРеквизита] = 2 Тогда
		ЭтотОбъект[ИмяИзменяемогоРеквизита] = 0;
	КонецЕсли; 
	Для каждого ИмяСекции Из ВсеСекцииПроверки() Цикл
		ИмяРеквизита = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
		ЭтотОбъект[ИмяРеквизита] = (ЭтотОбъект[ИмяИзменяемогоРеквизита] = 1);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПредварительногоАнализаПриИзменении(Элемент)
	
	ОбновитьЗначениеПереключателяГруппы(ЭтотОбъект, ВсеСекцииПроверки(), ТекМесяц, "ПредварительныйАнализ");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеМесяцаПриИзменении(Элемент)
	
	ИмяИзменяемогоРеквизита = СтрШаблон("ЗакрытиеМесяца%1", ТекМесяц);
	Если ЭтотОбъект[ИмяИзменяемогоРеквизита] = 2 Тогда
		ЭтотОбъект[ИмяИзменяемогоРеквизита] = 0;
	КонецЕсли; 
	Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
		Если СекцияНедоступна(ИмяСекции, ЭтотОбъект) Тогда
			Продолжить;
		КонецЕсли; 
		ИмяРеквизита = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
		ЭтотОбъект[ИмяРеквизита] = (ЭтотОбъект[ИмяИзменяемогоРеквизита] = 1);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗакрытияМесяцаПриИзменении(Элемент)
	
	ПроверяемыеСекции = Новый Массив;
	Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
		Если СекцияНедоступна(ИмяСекции, ЭтотОбъект) Тогда
			Продолжить;
		КонецЕсли; 
		ПроверяемыеСекции.Добавить(ИмяСекции);
	КонецЦикла; 
	ОбновитьЗначениеПереключателяГруппы(ЭтотОбъект, ПроверяемыеСекции, ТекМесяц, "ЗакрытиеМесяца");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекГодНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ГодНачала = ТекГод - 5;
	ГодКонца = ТекГод + 5;
	ТекущаяДата = ТекущаяДатаСервер();
	Если ГодКонца > Год(ТекущаяДата) Тогда
		ГодКонца = Год(ТекущаяДата);
	КонецЕсли; 
	СписокГодов = Новый СписокЗначений;
	Для НомерГода = ГодНачала По ГодКонца Цикл
		СписокГодов.Добавить(НомерГода, Формат(НомерГода, "ЧГ=0"));
	КонецЦикла;
	Оповещение = Новый ОписаниеОповещения("ТекГодНажатиеЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокГодов, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекГодНажатиеЗавершение(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекГод = ЭлементСписка.Значение;
	УстановитьТекстНадписей();
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрыватьЗаПериодПриИзменении(Элемент)
	
	ОбновитьОтображениеПоВариантуЗакрытия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ПериодЗакрытия;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатиеЗавершение(ВыбранныйПериод, Параметры) Экспорт
	
	Если ВыбранныйПериод <> Неопределено Тогда
		
		ПериодЗакрытия = ВыбранныйПериод;
		ПериодЗакрытия.ДатаНачала = НачалоМесяца(ПериодЗакрытия.ДатаНачала);
		ПериодЗакрытия.ДатаОкончания = КонецМесяца(ПериодЗакрытия.ДатаОкончания);
		
		ПроверитьВыбранныйПериод();
		
		ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ПериодЗакрытия);
		
		Если НачалоМесяца(ПериодЗакрытия.ДатаНачала) <= ДатаЗапретаРедактирования Тогда
			ТекстСообщения = НСтр("ru='Выбран период закрытый для редактирования'");
			ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГодНазадНажатие(Элемент)
	
	ТекГод = ?(ТекГод = 1, ТекГод, ТекГод - 1);
	УстановитьТекстНадписей();
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГодВпередНажатие(Элемент)
	
	ТекГод = ТекГод + 1;
	УстановитьТекстНадписей();
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

#Область Подключаемые

&НаКлиенте
Процедура Подключаемый_ОтрицательныеОстаткиНажатие(Элемент)
	
	ОтборРасшифровки = Новый Структура;
	Месяц = Дата(ТекГод, ТекМесяц, 1);
	ОтборРасшифровки.Вставить("ПериодРасшифровки", Новый СтандартныйПериод(НачалоМесяца(Месяц), КонецМесяца(Месяц)));
	ОтборРасшифровки.Вставить("Организация", Организация);
	ОткрытьФорму("Отчет.ЗакрытиеМесяцаАнализОтрицательныхОстатков.Форма", Новый Структура("Отбор, СформироватьПриОткрытии", 
		ОтборРасшифровки, Истина), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПереносРезерваНажатие(Элемент)
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Организация", Организация);
	СтруктураОткрытия.Вставить("Месяц", Дата(ТекГод, ТекМесяц, 1));
	Оповещение = Новый ОписаниеОповещения("ПереносРезерваНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.ПереносРезервов", СтруктураОткрытия, ЭтотОбъект, , , , 
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОстаткиСебестоимостиБезКоличестваНажатие(Элемент)
	
	ОтборРасшифровки = Новый Структура;
	Месяц = Дата(ТекГод, ТекМесяц, 1);
	ОтборРасшифровки.Вставить("ПериодРасшифровки", Новый СтандартныйПериод(НачалоМесяца(Месяц), КонецМесяца(Месяц)));
	ОтборРасшифровки.Вставить("Организация", Организация);
	ОткрытьФорму("Отчет.Запасы.Форма", Новый Структура("Отбор, КлючВарианта, СформироватьПриОткрытии", 
		ОтборРасшифровки, "ОстаткиСебестоимостиБезКоличества", Истина), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИспользоватьЗакрытиеСуммБезКоличестваНажатие(Элемент)
	
	ПереключитьИспользованиеЗакрытияСуммБезКоличества(Истина);
	
	ТекстСообщения = НСтр("ru = 'Автоматическое списание остатков сумм без количества включено'");
	ПоказатьОповещениеПользователя(ТекстСообщения);
	
	ЗапуститьФоновоеЗаданиеЗакрытиеМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносРезерваНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытыеКассовыеСменыНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияРасчетФактическойСебестоимости());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Месяц = Дата(ТекГод, ТекМесяц, 1);
	Период = Новый СтандартныйПериод(НачалоМесяца(Месяц), КонецМесяца(Месяц));
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияОткрытыеКассовыеСмены());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрокаОшибки.Подробности.Тип <> ТипСообщенияОткрытыеКассовыеСмены() Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Документы", СтрокаОшибки.Подробности.Документы);
	КонецЦикла; 
	Оповещение = Новый ОписаниеОповещения("ОткрытыеКассовыеСменыНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокДокументов", СтруктураОткрытия, ЭтотОбъект, , , , Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытыеКассовыеСменыНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЧекиВСостоянииРезерваНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияРасчетФактическойСебестоимости());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Месяц = Дата(ТекГод, ТекМесяц, 1);
	Период = Новый СтандартныйПериод(НачалоМесяца(Месяц), КонецМесяца(Месяц));
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияЧекиВСостоянииРезерва());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрокаОшибки.Подробности.Тип <> ТипСообщенияЧекиВСостоянииРезерва() Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Документы", СтрокаОшибки.Подробности.Документы);
	КонецЦикла; 
	Оповещение = Новый ОписаниеОповещения("ЧекиВСостоянииРезерваНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокДокументов", СтруктураОткрытия, ЭтотОбъект, , , , Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиВСостоянииРезерваНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЧекиСДвижениямиНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияРасчетФактическойСебестоимости());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Месяц = Дата(ТекГод, ТекМесяц, 1);
	Период = Новый СтандартныйПериод(НачалоМесяца(Месяц), КонецМесяца(Месяц));
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияЧекиСДвижениями());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрокаОшибки.Подробности.Тип <> ТипСообщенияЧекиСДвижениями() Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Документы", СтрокаОшибки.Подробности.Документы);
	КонецЦикла; 
	Оповещение = Новый ОписаниеОповещения("ЧекиСДвижениямиНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокДокументов", СтруктураОткрытия, ЭтотОбъект, , , , Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиСДвижениямиНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИзмененныеДокументыНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияРасчетФактическойСебестоимости());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияИзмененныеДокументы());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрокаОшибки.Подробности.Тип <> ТипСообщенияИзмененныеДокументы() Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Документы", СтрокаОшибки.Подробности.Документы);
	КонецЦикла; 
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокДокументов", СтруктураОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОшибкаИнтеркампаниНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияРасчетФактическойСебестоимости());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("ИзФормыЗакрытияМесяца", Истина);
	СтруктураОткрытия.Вставить("Организация", Организация);
	СтруктураОткрытия.Вставить("ПериодРегистрации", КонецМесяца(Дата(ТекГод, ТекМесяц, 1)));
	ОткрытьФорму("Обработка.ПомощникПередачиТоваровМеждуОрганизациями.Форма", СтруктураОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НезачтенныеАвансыПокупателейНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияПроверкаАвансыПокупателей());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", "Покупатели");
	СтруктураОткрытия.Вставить("Организация", Организация);
	СтруктураОткрытия.Вставить("Месяц", Дата(ТекГод, ТекМесяц, 1));
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрокаОшибки.Подробности.Тип <> ТипСообщенияНезачтенныеАвансыПокупателей() Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Контрагенты", СтрокаОшибки.Подробности.Контрагенты);
	КонецЦикла; 
	Оповещение = Новый ОписаниеОповещения("НезачтенныеАвансыПокупателейЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокКонтрагентов", СтруктураОткрытия, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НезачтенныеАвансыПокупателейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	ЗапуститьФоновоеЗаданиеПредварительныйАнализ();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НезачтенныеАвансыПоставщикамНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияПроверкаАвансыПоставщикам());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", "Поставщики");
	СтруктураОткрытия.Вставить("Организация", Организация);
	СтруктураОткрытия.Вставить("Месяц", Дата(ТекГод, ТекМесяц, 1));
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрокаОшибки.Подробности.Тип <> ТипСообщенияНезачтенныеАвансыПоставщикам() Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Контрагенты", СтрокаОшибки.Подробности.Контрагенты);
	КонецЦикла; 
	Оповещение = Новый ОписаниеОповещения("НезачтенныеАвансыПоставщикамЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокКонтрагентов", СтруктураОткрытия, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НезачтенныеАвансыПоставщикамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	ЗапуститьФоновоеЗаданиеПредварительныйАнализ();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НеверноВыбранаСтатьяДДСНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияПроверкаСтатьиДДС());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияНеверноВыбранаСтатьяДДС());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрНайти(Элемент.Имя, СтрокаОшибки.Подробности.Тип) = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Тип", СтрокаОшибки.Подробности.Тип);
		СтруктураОткрытия.Вставить("Документы", СтрокаОшибки.Подробности.Документы);
	КонецЦикла; 
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокДокументов", СтруктураОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НесоответствиеДоговоровОрганизацийНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияПроверкаОрганизацииИДоговоры());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияНесоответствиеДоговоровОрганизаций());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрНайти(Элемент.Имя, СтрокаОшибки.Подробности.Тип) = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Тип", СтрокаОшибки.Подробности.Тип);
		СтруктураОткрытия.Вставить("Документы", СтрокаОшибки.Подробности.Документы);
	КонецЦикла; 
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокДокументов", СтруктураОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриблизительноеОкруглениеКоличестваНажатие(Элемент)
	
	СтрокаСекции = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ТекМесяц, СекцияПроверкаЕдиницИзмерения());
	Если СтрокаСекции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Режим", ТипСообщенияПриблизительноеОкруглениеКоличества());
	Для каждого СтрокаОшибки Из СтрокаСекции.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаОшибки.Подробности) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли; 
		Если СтрНайти(Элемент.Имя, СтрокаОшибки.Подробности.Тип) = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОткрытия.Вставить("Тип", СтрокаОшибки.Подробности.Тип);
		СтруктураОткрытия.Вставить("Номенклатура", СтрокаОшибки.Подробности.Номенклатура);
	КонецЦикла; 
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.СписокНоменклатуры", СтруктураОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредварительныйАнализ(Команда)
	
	Если ФоновоеЗаданиеПредварительныйАнализЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеПредварительныйАнализИдентификатор);
		ФоновоеЗаданиеПредварительныйАнализЗапущено = Ложь;
		УстановитьДоступностьПредварительныйАнализ();
	Иначе
		ЗапуститьФоновоеЗаданиеПредварительныйАнализ();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗакрытиеМесяца(Команда)
	
	Если КонецМесяца(Дата(ТекГод, ТекМесяц, 1)) <= КонецДня(ДатаЗапретаРедактирования) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Нельзя отменить закрытие месяца, т.к. он относится к запрещенному для редактирования периоду.'"));
		Возврат;
	КонецЕсли;
	ПроверяемыеСекции = Новый Массив;
	Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
		ИмяРеквизита = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
		ЭтотОбъект[ИмяРеквизита] = Ложь;
		Если СекцияНедоступна(ИмяСекции, ЭтотОбъект) Тогда
			Продолжить;
		КонецЕсли; 
		ПроверяемыеСекции.Добавить(ИмяСекции);
	КонецЦикла;
	ОбновитьЗначениеПереключателяГруппы(ЭтотОбъект, ПроверяемыеСекции, ТекМесяц, "ЗакрытиеМесяца");
	ЗапуститьФоновоеЗаданиеЗакрытиеМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытиеМесяца(Команда)
	
	Если ФоновоеЗаданиеЗакрытиеМесяцаЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеЗакрытиеМесяцаИдентификатор);
		ФоновоеЗаданиеЗакрытиеМесяцаЗапущено = Ложь;
		УстановитьДоступностьПриЗакрытииМесяца();
		ЗапуститьФоновоеЗаданиеПолучениеДанных();
	Иначе
		Если КонецМесяца(Дата(ТекГод, ТекМесяц, 1)) <= КонецДня(ДатаЗапретаРедактирования) Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru='Нельзя закрыть месяц, т.к. он относится к запрещенному для редактирования периоду.'"));
			Возврат;
		КонецЕсли;
		ЗапуститьФоновоеЗаданиеЗакрытиеМесяца();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГодВперед(Команда)
	
	ТекГод = ТекГод + 1;
	УстановитьТекстНадписей();
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ГодНазад(Команда)
	
	ТекГод = ?(ТекГод = 1, ТекГод, ТекГод - 1);
	УстановитьТекстНадписей();
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
	ОбновитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытиеЗаПериод(Команда)
	
	ОтменаЗакрытияЗаПериод = Ложь;
	ЗапуститьОперациюЗаПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗакрытиеЗаПериод(Команда)
	
	ОтменаЗакрытияЗаПериод = Истина;
	ЗапуститьОперациюЗаПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьЗакрытиеЗаПериод(Команда)
	
	ФоновоеЗаданиеОтменить(ФоновоеЗаданиеЗакрытиеМесяцаИдентификатор);
	ФоновоеЗаданиеЗакрытиеМесяцаЗапущено = Ложь;
	ПроцессЗакрытияЗаПериодАктивен = Ложь;
	ОперацияПрервана = Истина;
	НастроитьФормуОкончаниеЗакрытияЗаПериод(Ложь);
	УстановитьДоступностьПриЗакрытииМесяца();
	
КонецПроцедуры

#Область ДлительныеОперации


#КонецОбласти 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область УправлениеВнешнимВидомФормы

&НаКлиенте
Процедура ОбновитьИндикаторЗакрытияМесяцев()
	
	Если ОтменаЗакрытияЗаПериод Тогда
		ТекстЗаголовка = НСтр("ru = 'Выполняется отмена закрытия месяца: %1'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Выполняется закрытие месяца: %1'");
	КонецЕсли;
	
	ПредставлениеПериодаДляДекорации = Формат(Дата(ТекГод, ТекМесяц, 1),НСтр("ru='ДФ=''MMMM yyyy'''"));
	Элементы.ДекорацияСостояниеЗакрытияЗаПериод.Заголовок = СтрШаблон(ТекстЗаголовка, ПредставлениеПериодаДляДекорации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовДляМобильногоКлиента()
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстНадписей()
	
	Элементы.ГодНазад.Заголовок = СтрШаблон("%1 <<", Формат(ТекГод - 1, "ЧГ="));
	Элементы.ГодВперед.Заголовок = СтрШаблон(">> %1", Формат(ТекГод + 1, "ЧГ="));
	Элементы.ГодВперед.Доступность = НЕ (ТекГод + 1 > Год(ТекущаяДатаСеанса()));
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуТекМесяц()
	
	Элементы.Месяцы.ТекущаяСтраница = Элементы.Найти("М" + ТекМесяц);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПоВариантуЗакрытия()
	
	Если НЕ ЗначениеЗаполнено(ПериодЗакрытия.ДатаНачала)
		И НЕ ЗначениеЗаполнено(ПериодЗакрытия.ДатаОкончания) Тогда
		
		ДатаТекущегоМесяца = Дата(ТекГод, ТекМесяц, 1);
		ПериодЗакрытия.ДатаНачала = НачалоМесяца(ДатаТекущегоМесяца);
		ПериодЗакрытия.ДатаОкончания = КонецМесяца(ДатаТекущегоМесяца);
		
		ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ПериодЗакрытия);
		
	КонецЕсли;
	
	УстановитьВидимостьЗакрытияЗаПериодИсходноеСостояние();
	
	Если ЗакрыватьПоМесяцам Тогда
		Элементы.ГруппаВариантыЗакрытия.ТекущаяСтраница = Элементы.ВариантПоМесяцам;
		Элементы.ПредставлениеПериода.Видимость = Ложь;
		Элементы.ГруппаУправлениеПериодом.Видимость = Истина;
	Иначе
		Элементы.ГруппаВариантыЗакрытия.ТекущаяСтраница = Элементы.ВариантЗаПериод;
		Элементы.ПредставлениеПериода.Видимость = Истина;
		Элементы.ГруппаУправлениеПериодом.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюДоступностьЭлементовФормы(ДоступностьЭлемента)
	
	Элементы.ГодНазад.Доступность = ДоступностьЭлемента;
	Элементы.ГодВперед.Доступность = ДоступностьЭлемента;
	Элементы.ТекГод.Доступность = ДоступностьЭлемента;
	Элементы.ДекорацияГодНазад.Доступность = ДоступностьЭлемента;
	Элементы.ДекорацияГодВперед.Доступность = ДоступностьЭлемента;
	Элементы.ДекорацияГод.Доступность = ДоступностьЭлемента;
	Элементы.ДекорацияЗа.Доступность = ДоступностьЭлемента;
	Элементы.ЗакрыватьПоМесяцам.Доступность = ДоступностьЭлемента;
	Элементы.ПредставлениеПериода.Доступность = ДоступностьЭлемента;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуОкончаниеЗакрытияЗаПериод(Успешно)
	
	Если ОтменаЗакрытияЗаПериод Тогда
		ТекстУспешно = НСтр("ru='Отмена закрытия месяцев за выбранный период выполнена успешно'");
	Иначе
		ТекстУспешно = НСтр("ru='Закрытие месяцев за выбранный период выполнено успешно'");
	КонецЕсли;
	
	Элементы.ДекорацияТекстУспешногоЗакрытия.Заголовок = ТекстУспешно;
	Элементы.ГруппаУспешноеЗакрытиеЗаПериод.Видимость = Успешно;
	Элементы.ГруппаПрерванноеЗакрытиеЗаПериод.Видимость = НЕ Успешно;
	Элементы.ГруппаХодЗакрытия.Видимость = Ложь;
	Элементы.ОтменитьЗакрытиеЗаПериод.Видимость = Истина;
	Элементы.ВыполнитьЗакрытиеЗаПериод.Видимость = Истина;
	Элементы.ПрерватьЗакрытиеЗаПериод.Видимость = Ложь;
	
	СнятьНедоступностьПослеВыполненияОперацииЗаПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНачалоЗакрытияЗаПериод()
	
	Элементы.ГруппаХодЗакрытия.Видимость = Истина;
	Элементы.ДекорацияПояснениеКЗакрытиюЗаПериод.Видимость = Ложь;
	Элементы.ГруппаУспешноеЗакрытиеЗаПериод.Видимость = Ложь;
	Элементы.ГруппаПрерванноеЗакрытиеЗаПериод.Видимость = Ложь;
	Элементы.ОтменитьЗакрытиеЗаПериод.Видимость = Ложь;
	Элементы.ВыполнитьЗакрытиеЗаПериод.Видимость = Ложь;
	Элементы.ПрерватьЗакрытиеЗаПериод.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЗакрытияЗаПериодИсходноеСостояние()
	
	Элементы.ДекорацияПояснениеКЗакрытиюЗаПериод.Видимость = Истина;
	Элементы.ОтменитьЗакрытиеЗаПериод.Видимость = Истина;
	Элементы.ВыполнитьЗакрытиеЗаПериод.Видимость = Истина;
	Элементы.ГруппаХодЗакрытия.Видимость = Ложь;
	Элементы.ГруппаУспешноеЗакрытиеЗаПериод.Видимость = Ложь;
	Элементы.ГруппаПрерванноеЗакрытиеЗаПериод.Видимость = Ложь;
	Элементы.ПрерватьЗакрытиеЗаПериод.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьНедоступностьПослеВыполненияОперацииЗаПериод()
	
	Для МесяцОбработки = 1 По 12 Цикл
		
		Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
			ИмяЭлементаПереключатель = СтрШаблон("%1%2", ИмяСекции, МесяцОбработки);
			Элементы[ИмяЭлементаПереключатель].ТолькоПросмотр = Ложь;
		КонецЦикла;
		ИмяЭлементаПереключательГруппы = СтрШаблон("ЗакрытиеМесяца%1", МесяцОбработки);
		Элементы[ИмяЭлементаПереключательГруппы].ТолькоПросмотр = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыбранныйПериод(Отказ = Ложь)
	
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Если 	Год(ТекущаяДата) - Год(ПериодЗакрытия.ДатаНачала) > 10
		ИЛИ Год(ТекущаяДата) - Год(ПериодЗакрытия.ДатаНачала) < -10 
		ИЛИ Год(ТекущаяДата) - Год(ПериодЗакрытия.ДатаОкончания) > 10 
		ИЛИ Год(ТекущаяДата) - Год(ПериодЗакрытия.ДатаОкончания) < -10 Тогда
		
		ТекстСообщения = НСтр("ru='Выбран слишком большой период. Период закрытия не может быть меньше или больше 10 лет от текущей даты.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанных

&НаСервере
Процедура ОбновитьДанные(АдресХранилища, ДополнениеДанных = Ложь)
	
	Если АдресХранилища = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнениеДанных Тогда
		
		ИзмененныеСтроки = ОбновитьДанныеДерева(ДанныеЗаполнения.ОшибкиЗакрытияМесяца);
		Для каждого СтрокаСекция Из ИзмененныеСтроки Цикл
			ВывестиСообщенияСекции(СтрокаСекция);
		КонецЦикла;
		
	Иначе
		
		ЗначениеВРеквизитФормы(ДанныеЗаполнения.ОшибкиЗакрытияМесяца, "ОшибкиЗакрытияМесяца");
		Для каждого СтрокаМесяц Из ОшибкиЗакрытияМесяца.ПолучитьЭлементы() Цикл
			Год = Год(СтрокаМесяц.Месяц);
			НомерМесяца = Строка(Месяц(СтрокаМесяц.Месяц));
			ПериодДетальногоАнализа = (Год = ТекГод);
			Если НЕ ПериодДетальногоАнализа Тогда
				Продолжить;
			КонецЕсли; 
			ТребуетсяЗакрытие = Ложь;
			ОбщееСостояние = СостояниеЗакрыт();
			Для каждого СтрокаСекция Из СтрокаМесяц.ПолучитьЭлементы() Цикл
				ВывестиСообщенияСекции(СтрокаСекция, ТребуетсяЗакрытие, ОбщееСостояние);
			КонецЦикла;
			ИмяГруппыСтраницы = СтрШаблон("Страницы%1", НомерМесяца);
			Если ТребуетсяЗакрытие Тогда
				ИмяСтраницы = СтрШаблон("Операции%1", НомерМесяца);
			Иначе
				ИмяСтраницы = СтрШаблон("ЗакрытиеНеТребуется%1", НомерМесяца);
			КонецЕсли; 
			Элементы[ИмяГруппыСтраницы].ТекущаяСтраница = Элементы[ИмяСтраницы];
			СтраницаМесяц = Элементы[СтрШаблон("М%1", НомерМесяца)];
			Если НЕ ТребуетсяЗакрытие Тогда
				СтраницаМесяц.Картинка = БиблиотекаКартинок.ЗеленыйШар;
			ИначеЕсли ОбщееСостояние = СостояниеЗакрыт() Тогда 
				СтраницаМесяц.Картинка = БиблиотекаКартинок.ЗеленыйШар;
			ИначеЕсли ОбщееСостояние = СостояниеНеЗакрыт() Тогда 
				СтраницаМесяц.Картинка = БиблиотекаКартинок.СерыйШар;
			ИначеЕсли ОбщееСостояние = СостояниеОшибки() Тогда
				СтраницаМесяц.Картинка = БиблиотекаКартинок.Внимание16;
				
				Если НЕ ЗакрыватьПоМесяцам И ПроцессЗакрытияЗаПериодАктивен
					И Строка(ТекМесяц) = НомерМесяца Тогда
					ЕстьОшибкиЗакрытияЗаПериод = Истина;
				КонецЕсли;
				
			Иначе
				СтраницаМесяц.Картинка = БиблиотекаКартинок.ЗеленыйШар;
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
	ИменаСекций = Новый Массив;
	Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
		Если СекцияНедоступна(ИмяСекции, ЭтотОбъект) Тогда
			Продолжить;
		КонецЕсли; 
		ИменаСекций.Добавить(ИмяСекции);
	КонецЦикла; 
	Для ии = 1 По 12 Цикл
		ОбновитьЗначениеПереключателяГруппы(ЭтотОбъект, ИменаСекций, ии, "ЗакрытиеМесяца");
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеДерева(Дерево)
	
	Результат = Новый Массив;
	Для каждого СтрокаДереваМесяц Из Дерево.Строки Цикл
		СтрокаМесяц = Неопределено;
		Для каждого Строка Из ОшибкиЗакрытияМесяца.ПолучитьЭлементы() Цикл
			Если Строка.Месяц = СтрокаДереваМесяц.Месяц Тогда
				СтрокаМесяц = Строка;
			КонецЕсли; 
		КонецЦикла;
		Если СтрокаМесяц = Неопределено Тогда
			Прервать;
		КонецЕсли; 
		Для каждого СтрокаДереваСекция Из СтрокаДереваМесяц.Строки Цикл
			СтрокаСекция = Неопределено;
			Для каждого Строка Из СтрокаМесяц.ПолучитьЭлементы() Цикл
				Если Строка.Секция = СтрокаДереваСекция.Секция Тогда
					СтрокаСекция = Строка;
				КонецЕсли; 
			КонецЦикла;
			Если СтрокаСекция = Неопределено Тогда
				СтрокаСекция = СтрокаМесяц.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСекция, СтрокаМесяц);
				СтрокаСекция.Секция = СтрокаДереваСекция.Секция;
			КонецЕсли;
			СтрокаСекция.СостояниеЗакрытия = СтрокаДереваСекция.СостояниеЗакрытия;
			СтрокаСекция.ТекстСообщения = СтрокаДереваСекция.ТекстСообщения;
			СтрокаСекция.ПолучитьЭлементы().Очистить();
			Для каждого СтрокаДереваСообщение Из СтрокаДереваСекция.Строки Цикл
				НоваяСтрока = СтрокаСекция.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДереваСообщение);
			КонецЦикла;
			Результат.Добавить(СтрокаСекция);
		КонецЦикла; 
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиСообщенияСекции(СтрокаСекция, ТребуетсяЗакрытие = Неопределено, ОбщееСостояние = Неопределено)
	
	НомерМесяца = Строка(Месяц(СтрокаСекция.Месяц));
	ИмяСекции = СтрокаСекция.Секция;
	ИмяЭлементаКартинка = СтрШаблон("%1Картинка%2", ИмяСекции, НомерМесяца);
	ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, НомерМесяца);
	ИмяРеквизита = СтрШаблон("%1%2", ИмяСекции, НомерМесяца);
	Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
	Если СтрокаСекция.ПолучитьЭлементы().Количество() <> 0 Тогда
		Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.Внимание16;
		Элементы[ИмяЭлементаКартинка].Гиперссылка = Истина;
		Если СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрыт() Тогда
			Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеВыполненоСОшибками();
		Иначе
			Элементы[ИмяЭлементаОписание].Заголовок = ТекстОшибкиПередЗакрытием();
		КонецЕсли;
		Элементы[ИмяЭлементаОписание].Гиперссылка = Истина;
		Если СтрокаСекция.СостояниеЗакрытия <> СостояниеЗакрытиеНеТребуется() Тогда
			ТребуетсяЗакрытие = Истина;
		КонецЕсли; 
		ОбщееСостояние = СостояниеОшибки();
	ИначеЕсли СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрыт() Тогда
		Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.ЗеленыйШар;
		Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
		Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеВыполненоУспешно();
		Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
		ТребуетсяЗакрытие = Истина;
	ИначеЕсли СтрокаСекция.СостояниеЗакрытия = СостояниеНеЗакрыт() Тогда
		Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.СерыйШар;
		Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
		Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеНеВыполнено();
		Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
		ТребуетсяЗакрытие = Истина;
		Если ОбщееСостояние = СостояниеЗакрыт() Тогда
			ОбщееСостояние = СостояниеНеЗакрыт();
		КонецЕсли; 
	ИначеЕсли СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрытиеНеТребуется() Тогда
		Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.ЗеленыйШар;
		Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
		Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеНеТребуется();
		Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
	Иначе
		Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.ЗеленыйШар;
		Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
		Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеНеТребуется();
		Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
	КонецЕсли;
	ЭтотОбъект[ИмяРеквизита] = (СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрыт());
	Если СтрокаСекция.ПолучитьЭлементы().Количество() <> 0 Тогда
		ИмяГруппыПодробно = СтрШаблон("Группа%1Подробно%2", ИмяСекции, НомерМесяца);
		ВывестиСообщения(Элементы[ИмяГруппыПодробно], СтрокаСекция.ПолучитьЭлементы());
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Процедура УдалитьСообщения(УдалитьПроверки = Истина, УдалитьЗакрытия = Истина, ТолькоТекущийМесяц = Ложь)
	
	СекцииПроверки = ВсеСекцииПроверки();
	СекцииЗакрытие = ВсеСекцииЗакрытияМесяца();
	Если ТолькоТекущийМесяц Тогда
		МесяцНачало = ТекМесяц;
		МесяцКонец = ТекМесяц;
	Иначе
		МесяцНачало = 1;
		МесяцКонец = 12;
	КонецЕсли;
	ЭлементыКУдалению = Новый Массив;
	Для каждого ИмяСекции Из ВсеСекции() Цикл
		Если НЕ УдалитьПроверки И СекцииПроверки.Найти(ИмяСекции) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Если НЕ УдалитьЗакрытия И СекцииЗакрытие.Найти(ИмяСекции) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для ии = МесяцНачало По МесяцКонец Цикл
			ИмяГруппыПодробно = СтрШаблон("Группа%1Подробно%2", ИмяСекции, ии);
			ГруппаПодробно = Элементы[ИмяГруппыПодробно];
			ЭлементыКУдалению.Добавить(ГруппаПодробно);
		КонецЦикла; 
	КонецЦикла;
	Для каждого Элемент Из ЭлементыКУдалению Цикл
		УдалитьЭлементыРекурсивно(Элемент);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыРекурсивно(Группа)
	
	ЭлементыКУдалению = Новый Массив;
	Для каждого Элемент Из Группа.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			УдалитьЭлементыРекурсивно(Элемент);
		КонецЕсли;
		ЭлементыКУдалению.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из ЭлементыКУдалению Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСообщения(Группа, СтрокиОшибки)
	
	Для каждого СтрокаОшибка Из СтрокиОшибки Цикл
		НомерМесяца = Строка(Месяц(СтрокаОшибка.Месяц));
		ИмяСекции = СтрокаОшибка.Секция;
		Если ТипЗнч(СтрокаОшибка.Подробности) = Тип("Структура") И СтрокаОшибка.Подробности.Свойство("Тип") Тогда
			ТипСообщения = СтрокаОшибка.Подробности.Тип;
		Иначе
			ТипСообщения = "Прочее";
		КонецЕсли; 
		ИмяСообщения = СтрШаблон("%1%2%3", ИмяСекции, ТипСообщения, НомерМесяца);
		ИмяГруппы = СтрШаблон("Группа%1", ИмяСообщения);
		ИмяЭлементаОписание = СтрШаблон("Описание%1", ИмяСообщения);
		ИмяЭлементаСсылка = СтрШаблон("Ссылка%1", ИмяСообщения);
		Если Элементы.Найти(ИмяЭлементаОписание) = Неопределено Тогда
			// Новое сообщение
			ГруппаСообщение = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Группа);
			ГруппаСообщение.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСообщение.ОтображатьЗаголовок = Ложь;
			ГруппаСообщение.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСообщение.РастягиватьПоВертикали = Ложь;
			ГруппаСообщение.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаСообщение.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			ГруппаСообщение.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
			ЭлементОписание = Элементы.Добавить(ИмяЭлементаОписание, Тип("ДекорацияФормы"), ГруппаСообщение);
			ЭлементОписание.Вид = ВидДекорацииФормы.Надпись;
			ЭлементОписание.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
			ЭлементОписание.РастягиватьПоГоризонтали = Истина;
			ЭлементОписание.АвтоМаксимальнаяШирина = Ложь;
			ЭлементОписание.МаксимальнаяШирина = 62;
			ЭлементОписание.Заголовок = СтрокаОшибка.ТекстСообщения;
			Если ТипСообщения = ТипСообщенияОтрицательныеОстатки() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Анализ отрицательных остатков'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ОтрицательныеОстаткиНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияПереносРезерва() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список резервов'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ПереносРезерваНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияОстаткиСебестоимостиБезКоличества() Тогда
				
				ГруппаВариантыСписания = Элементы.Добавить(ИмяГруппы +"Гиперссылки", Тип("ГруппаФормы"), ГруппаСообщение);
				ГруппаВариантыСписания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаВариантыСписания.ОтображатьЗаголовок = Ложь;
				ГруппаВариантыСписания.Отображение = ОтображениеОбычнойГруппы.Нет;
				ГруппаВариантыСписания.РастягиватьПоВертикали = Ложь;
				ГруппаВариантыСписания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
				Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЭтапыПроизводства") 
					И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЗакрытиеСуммБезКоличества")  Тогда
					
					ЭлементВключениеСписания = Элементы.Добавить("ВключениеСписания" + ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаВариантыСписания);
					ЭлементВключениеСписания.Вид = ВидДекорацииФормы.Надпись;
					ЭлементВключениеСписания.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
					ЭлементВключениеСписания.Заголовок = НСтр("ru = 'Включить автоматическое списание'");
					ЭлементВключениеСписания.Гиперссылка = Истина;
					ЭлементВключениеСписания.УстановитьДействие("Нажатие", "Подключаемый_ИспользоватьЗакрытиеСуммБезКоличестваНажатие");
					
				КонецЕсли;
				
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаВариантыСписания);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Открыть отчет'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ОстаткиСебестоимостиБезКоличестваНажатие");
				
			ИначеЕсли ТипСообщения = ТипСообщенияОткрытыеКассовыеСмены() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Открытые кассовые смены'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ОткрытыеКассовыеСменыНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияЧекиВСостоянииРезерва() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Чеки в состоянии резерва'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ЧекиВСостоянииРезерваНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияЧекиСДвижениями() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Чеки с незавершенной архивацией'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ЧекиСДвижениямиНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияИзмененныеДокументы() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список измененных документов'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ИзмененныеДокументыНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияОшибкаИнтеркампани() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Помощник передачи товаров'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ОшибкаИнтеркампаниНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияНезачтенныеАвансыПокупателей() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список покупателей'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_НезачтенныеАвансыПокупателейНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияНезачтенныеАвансыПоставщикам() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список поставщиков'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_НезачтенныеАвансыПоставщикамНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияНеверноВыбранаСтатьяДДСПлатежи() 
				ИЛИ ТипСообщения = ТипСообщенияНеверноВыбранаСтатьяДДСПоступления() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список документов'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_НеверноВыбранаСтатьяДДСНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияНесоответствиеДоговораВПодчиненномДокументе() 
				ИЛИ ТипСообщения = ТипСообщенияНесоответствиеОрганизацииВДокументеИДоговоре()
				ИЛИ ТипСообщения = ТипСообщенияНесоответствиеОрганизацииВПодчиненномДокументе() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список документов'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_НесоответствиеДоговоровОрганизацийНажатие");
			ИначеЕсли ТипСообщения = ТипСообщенияПриблизительноеОкруглениеКоличества() Тогда
				ЭлементСсылка = Элементы.Добавить(ИмяЭлементаСсылка, Тип("ДекорацияФормы"), ГруппаСообщение);
				ЭлементСсылка.Вид = ВидДекорацииФормы.Надпись;
				ЭлементСсылка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементСсылка.Заголовок = НСтр("ru = 'Список номенклатуры'");
				ЭлементСсылка.Гиперссылка = Истина;
				ЭлементСсылка.УстановитьДействие("Нажатие", "Подключаемый_ПриблизительноеОкруглениеКоличестваНажатие");
			КонецЕсли; 
		Иначе
			// Одинаковые типы сообщений
			ГруппаСообщение = Элементы[ИмяГруппы];
			ЭлементОписание = Элементы[ИмяЭлементаОписание];
			ЭлементОписание.Заголовок = ЭлементОписание.Заголовок 
			+ ?(ПустаяСтрока(ЭлементОписание.Заголовок), "", Символы.ПС) 
			+ СтрокаОшибка.ТекстСообщения; 
		КонецЕсли; 
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти 

#Область ДатаЗапретаРедактирования

&НаСервере
Процедура НастроитьОтображенияДатыЗапретаРедактирования()
	
	ИспользоватьДатыЗапретаИзменения = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	ПереноситьДатуЗапретаРедактирования = Константы.ПереноситьДатуЗапретаРедактирования.Получить();
	
	ДатаЗапрета = ПолучитьДатуЗапретаРедактирования();
	
	Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
		ДатаЗапретаРедактирования = ДатаЗапрета;
	Иначе
		Элементы.ДатаЗапретаРедактирования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьДатуЗапретаРедактирования()
	
	Если ИспользоватьДатыЗапретаИзменения
		И НЕ ЗначениеЗаполнено(ПереноситьДатуЗапретаРедактирования) Тогда
		ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.ПереноситьДатуЗапретаРедактирования", , , , , , 
			Новый ОписаниеОповещения("АктуализироватьДатуЗапретаРедактированияЗавершение", ЭтотОбъект));
		Возврат;
	ИначеЕсли ИспользоватьДатыЗапретаИзменения
		И ПереноситьДатуЗапретаРедактирования = ПредопределенноеЗначение("Перечисление.ДаНет.Да") Тогда
		ВыполнитьПереносДатыЗапретаРедактирования(КонецМесяца(Дата(ТекГод, ТекМесяц, 1)));
	КонецЕсли;
	
	АктуализироватьДатуЗапретаРедактированияФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьДатуЗапретаРедактированияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если ЗначениеЗаполнено(Ответ) И Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьПереносДатыЗапретаРедактирования(КонецМесяца(Дата(ТекГод, ТекМесяц, 1)));
	КонецЕсли;
	
	АктуализироватьДатуЗапретаРедактированияФрагмент();
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьДатуЗапретаРедактированияФрагмент()
	
	ПереноситьДатуЗапретаРедактирования = Константы.ПереноситьДатуЗапретаРедактирования.Получить();
	
КонецПроцедуры // АктуализироватьДатуЗапретаРедактирования()

&НаСервере
Функция ПолучитьДатуЗапретаРедактирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения,
	|	Константа.ИспользоватьДатыЗапретаИзменения КАК ИспользоватьДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Пользователь = &ТекПользователь
	|	И ДатыЗапретаИзменения.Объект = &Объект
	|	И ИспользоватьДатыЗапретаИзменения.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения,
	|	Константа.ИспользоватьДатыЗапретаИзменения КАК ИспользоватьДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Пользователь = &Пользователь
	|	И ДатыЗапретаИзменения.Объект = &Объект
	|	И ИспользоватьДатыЗапретаИзменения.Значение";
	
	Запрос.УстановитьПараметр("ТекПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Пользователь", Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
	Запрос.УстановитьПараметр("Объект", ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаТекПользователь = РезультатЗапроса[0].Выбрать();
	ВыборкаВсеПользователи = РезультатЗапроса[1].Выбрать();
	НачалоДня = НачалоДня(ТекущаяДатаСеанса());
	Если ВыборкаТекПользователь.Следующий() Тогда
		ДатаЗапрета = ВыборкаТекПользователь.ДатаЗапрета;
		Если ЗначениеЗаполнено(ВыборкаТекПользователь.ОписаниеДатыЗапрета) Тогда
			ДатаЗапрета = ДатыЗапретаИзмененияСлужебный.ДатаЗапретаПоОписанию(
					ВыборкаТекПользователь.ОписаниеДатыЗапрета, ВыборкаТекПользователь.ДатаЗапрета, НачалоДня);
		КонецЕсли;
		Возврат ДатаЗапрета;
	ИначеЕсли ВыборкаВсеПользователи.Следующий() Тогда
		ДатаЗапрета = ВыборкаВсеПользователи.ДатаЗапрета;
		Если ЗначениеЗаполнено(ВыборкаВсеПользователи.ОписаниеДатыЗапрета) Тогда
			ДатаЗапрета = ДатыЗапретаИзмененияСлужебный.ДатаЗапретаПоОписанию(
					ВыборкаВсеПользователи.ОписаниеДатыЗапрета, ВыборкаВсеПользователи.ДатаЗапрета, НачалоДня);
		КонецЕсли;
		Возврат ДатаЗапрета;
	Иначе
		ПереноситьДатуЗапретаРедактирования = Перечисления.ДаНет.Нет;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ВыполнитьПереносДатыЗапретаРедактирования(Дата)
	
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);

	Запись = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
	Запись.Объект = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	Запись.ДатаЗапрета = Дата;
	Запись.Комментарий = "(По умолчанию)";
	Запись.Записать(Истина);
	
	ДатаЗапретаРедактирования = Дата;
	Элементы.ДатаЗапретаРедактирования.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область ФоновоеЗаданиеСборДанных

&НаКлиенте
Процедура Подключаемый_ЗапуститьФоновоеЗаданиеПолучениеДанных()
	
	ЗапуститьФоновоеЗаданиеПолучениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновоеЗаданиеПолучениеДанных()
	
	РезультатФоновогоЗадания = ПолучитьДанныеНаСервере();
	Если РезультатФоновогоЗадания = Неопределено Тогда
		// Выполнено без ожидания
		Возврат;
	КонецЕсли; 
	
	Если РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеПолучениеДанныхВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
		
	КонецЕсли;
	
	УстановитьДоступностьПриПолученииДанных();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНаСервере()
	
	Если ФоновоеЗаданиеПолучениеДанныхЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеПолучениеДанныхИдентификатор);
	КонецЕсли;
	
	ОшибкиЗакрытияМесяца.ПолучитьЭлементы().Очистить();
	УдалитьСообщения(Истина, Истина, Ложь);
	// Сворачиваем все развернутые группы подробностей
	Для ии = 1 По 12 Цикл
		НомерМесяца = Строка(ии);
		Для каждого ИмяСекции Из ВсеСекции() Цикл
			ИмяГруппыПодробно = СтрШаблон("Группа%1Подробно%2", ИмяСекции, НомерМесяца);
			Элементы[ИмяГруппыПодробно].Видимость = Ложь;
		КонецЦикла;
		Для каждого ИмяСекции Из ВсеСекцииПроверки() Цикл
			ИмяЭлементаКартинка = СтрШаблон("%1Картинка%2", ИмяСекции, НомерМесяца);
			ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, НомерМесяца);
			Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.СерыйШар;
			Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
			Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеНеВыполнено();
			Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
		КонецЦикла;
	КонецЦикла;
		
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТекМесяц", ТекМесяц);
	ПараметрыПроцедуры.Вставить("ТекГод", ТекГод);
	ПараметрыПроцедуры.Вставить("Организация", Организация);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ЗакрытиеМесяца.ПолучитьДанные",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
		
	ФоновоеЗаданиеПолучениеДанныхИдентификатор   = РезультатФоновогоЗадания.ИдентификаторЗадания;
	ФоновоеЗаданиеПолучениеДанныхАдресРезультата = РезультатФоновогоЗадания.АдресРезультата;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		// Ошибка за время вызова
		ОбщегоНазначения.СообщитьПользователю(РезультатФоновогоЗадания.КраткоеПредставлениеОшибки);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда
		// Завершено за время вызова, данные получены
		ОбновитьДанные(ФоновоеЗаданиеПолучениеДанныхАдресРезультата);
	Иначе
		// иначе начнем ожидания завершения фонового задания
		ФоновоеЗаданиеПолучениеДанныхЗапущено = Истина;
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеПолучениеДанныхВыполнено(Результат, ЗагрузитьРезультат) Экспорт
	
	ФоновоеЗаданиеПолучениеДанныхЗапущено = Ложь;
	УстановитьДоступностьПриПолученииДанных();
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ОбновитьДанные(ФоновоеЗаданиеПолучениеДанныхАдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПриПолученииДанных()
	
	Если ФоновоеЗаданиеПолучениеДанныхЗапущено Тогда
		
		УстановитьОбщуюДоступностьЭлементовФормы(Ложь);
		
		Для ии = 1 По 12 Цикл
			Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
				ИмяЭлементаКартинка = СтрШаблон("%1Картинка%2", ИмяСекции, ии);
				ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, ии);
				Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
				Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
				Элементы[ИмяЭлементаОписание].Заголовок = НСтр("ru = 'анализ'");
				Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
			КонецЦикла;
			ИмяЭлементаКнопкаАнализ = СтрШаблон("ВыполнитьПредварительныйАнализ%1", ии);
			Элементы[ИмяЭлементаКнопкаАнализ].Доступность = Ложь;
		КонецЦикла;  
		
	Иначе
		
		УстановитьОбщуюДоступностьЭлементовФормы(Истина);
		
		Для ии = 1 По 12 Цикл
			ИмяЭлементаКнопкаАнализ = СтрШаблон("ВыполнитьПредварительныйАнализ%1", ии);
			Элементы[ИмяЭлементаКнопкаАнализ].Доступность = Истина;
		КонецЦикла;  
		
	КонецЕсли;
	
	Для ии = 1 По 12 Цикл
		ИмяКнопки = СтрШаблон("ВыполнитьЗакрытиеМесяца%1", ии);
		Элементы[ИмяКнопки].Доступность = НЕ ФоновоеЗаданиеПолучениеДанныхЗапущено И НЕ ФоновоеЗаданиеЗакрытиеМесяцаЗапущено;
		ИмяКнопки = СтрШаблон("ОтменитьЗакрытиеМесяца%1", ии);
		Элементы[ИмяКнопки].Доступность = НЕ ФоновоеЗаданиеПолучениеДанныхЗапущено И НЕ ФоновоеЗаданиеЗакрытиеМесяцаЗапущено;
	КонецЦикла; 
		
КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗаданиеВыполнениеОбщихПроверок

&НаКлиенте
Процедура ЗапуститьФоновоеЗаданиеПредварительныйАнализ()
	
	РезультатФоновогоЗадания = ВыполнитьПредварительныйАнализНаСервере();
	Если РезультатФоновогоЗадания = Неопределено Тогда
		// Выполнено без ожидания
		Возврат;
	КонецЕсли; 
	
	Если РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеПредварительныйАнализВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
		
	КонецЕсли;
	
	УстановитьДоступностьПредварительныйАнализ();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПредварительныйАнализНаСервере()
	
	Если ФоновоеЗаданиеПредварительныйАнализЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеПредварительныйАнализЗапущено);
	КонецЕсли;
	
	УдалитьСообщения(Истина, Ложь, Истина);
	// Сворачиваем все развернутые группы подробностей
	Для ии = 1 По 12 Цикл
		НомерМесяца = Строка(ии);
		Для каждого ИмяСекции Из ВсеСекцииПроверки() Цикл
			ИмяГруппыПодробно = СтрШаблон("Группа%1Подробно%2", ИмяСекции, НомерМесяца);
			Элементы[ИмяГруппыПодробно].Видимость = Ложь;
			ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, НомерМесяца);
			СтрокаСекция = СтрокаДерева(ОшибкиЗакрытияМесяца, ТекГод, ии, ИмяСекции);
			Если СтрокаСекция <> Неопределено Тогда
				Если СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрыт() И СтрокаСекция.ПолучитьЭлементы().Количество() > 0 Тогда
					Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеВыполненоСОшибками();
				ИначеЕсли СтрокаСекция.СостояниеЗакрытия = СостояниеЗакрыт() Тогда
					Элементы[ИмяЭлементаОписание].Заголовок = ТекстЗакрытиеВыполненоУспешно();
				Иначе 
					Элементы[ИмяЭлементаОписание].Заголовок = ТекстОшибкиПередЗакрытием();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТекМесяц", ТекМесяц);
	ПараметрыПроцедуры.Вставить("ТекГод", ТекГод);
	ПараметрыПроцедуры.Вставить("Организация", Организация);
	МассивОпераций = Новый Массив;
	Для каждого Секция Из ВсеСекцииПроверки() Цикл
		Если ЗначениеРеквизитаФормыПоЗначениюМесяца(ЭтотОбъект, Секция, ТекМесяц) Тогда
			МассивОпераций.Добавить(Секция);
		КонецЕсли; 
	КонецЦикла; 
	ПараметрыПроцедуры.Вставить("Операции", МассивОпераций);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ЗакрытиеМесяца.ВыполнитьПроверки",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
		
	ФоновоеЗаданиеПредварительныйАнализИдентификатор   = РезультатФоновогоЗадания.ИдентификаторЗадания;
	ФоновоеЗаданиеПредварительныйАнализАдресРезультата = РезультатФоновогоЗадания.АдресРезультата;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		// Ошибка за время вызова
		ОбщегоНазначения.СообщитьПользователю(РезультатФоновогоЗадания.КраткоеПредставлениеОшибки);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда
		// Завершено за время вызова, данные получены
		ОбновитьДанные(ФоновоеЗаданиеПредварительныйАнализАдресРезультата, Истина);
	Иначе
		// иначе начнем ожидания завершения фонового задания
		ФоновоеЗаданиеПредварительныйАнализЗапущено = Истина;
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеПредварительныйАнализВыполнено(Результат, ЗагрузитьРезультат) Экспорт
	
	ФоновоеЗаданиеПредварительныйАнализЗапущено = Ложь;
	УстановитьДоступностьПредварительныйАнализ();
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ОбновитьДанные(ФоновоеЗаданиеПредварительныйАнализАдресРезультата, Истина);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПредварительныйАнализ()
	
	Если ФоновоеЗаданиеПредварительныйАнализЗапущено Тогда
		
		УстановитьОбщуюДоступностьЭлементовФормы(Ложь);
		
		Для каждого ИмяСекции Из ВсеСекцииПроверки() Цикл
			ИмяЭлементаКартинка = СтрШаблон("%1Картинка%2", ИмяСекции, ТекМесяц);
			ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, ТекМесяц);
			ИмяЭлементаПереключатель = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
			Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
			Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
			Элементы[ИмяЭлементаОписание].Заголовок = НСтр("ru = 'анализ'");
			Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
			Элементы[ИмяЭлементаПереключатель].ТолькоПросмотр = Истина;
		КонецЦикла;
		ИмяЭлементаПереключательГруппы = СтрШаблон("ПредварительныйАнализ%1", ТекМесяц);
		Элементы[ИмяЭлементаПереключательГруппы].ТолькоПросмотр = Истина;
		
	Иначе
		
		УстановитьОбщуюДоступностьЭлементовФормы(Истина);
		
		Для каждого ИмяСекции Из ВсеСекцииПроверки() Цикл
			ИмяЭлементаПереключатель = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
			Элементы[ИмяЭлементаПереключатель].ТолькоПросмотр = Ложь;
		КонецЦикла; 
		ИмяЭлементаПереключательГруппы = СтрШаблон("ПредварительныйАнализ%1", ТекМесяц);
		Элементы[ИмяЭлементаПереключательГруппы].ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
	Для ии = 1 По 12 Цикл
		ИмяКнопки = СтрШаблон("ВыполнитьПредварительныйАнализ%1", ии);
		Если ии = ТекМесяц И ФоновоеЗаданиеПредварительныйАнализЗапущено Тогда
			Элементы[ИмяКнопки].Заголовок = НСтр("ru = 'Прервать'");
		Иначе
			Элементы[ИмяКнопки].Заголовок = НСтр("ru = 'Выполнить'");
			Элементы[ИмяКнопки].Доступность = НЕ ФоновоеЗаданиеПредварительныйАнализЗапущено;
		КонецЕсли; 
	КонецЦикла; 
		
КонецПроцедуры

#КонецОбласти 

#Область ФоновоеЗаданиеЗакрытиеМесяца

&НаКлиенте
Процедура ЗапуститьФоновоеЗаданиеЗакрытиеМесяца()
	
	РезультатФоновогоЗадания = ВыполнитьЗакрытиеМесяцаНаСервере();
	
	Если РезультатФоновогоЗадания = Неопределено Тогда
		АктуализироватьДатуЗапретаРедактирования();
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		ФоновоеЗаданиеЗакрытиеМесяцаВыполнено(РезультатФоновогоЗадания, Неопределено);
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеЗакрытиеМесяцаВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
		
		УстановитьДоступностьПриЗакрытииМесяца();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьОАктивномФоновомЗадании(Отказ = Истина)
	
	Отказ = Истина;
	ТекстПредупреждения = НСтр("ru = 'Дождитесь окончания рабочего процесса (рекомендуется) либо прервите его самостоятельно.'");
	ПоказатьПредупреждение(Неопределено,ТекстПредупреждения, 10, НСтр("ru = 'Невозможно закрыть форму.'"));
	
КонецПроцедуры // ПредупредитьОАктивномФоновомЗадании()

&НаСервере
Функция ВыполнитьЗакрытиеМесяцаНаСервере()
	
	Если ФоновоеЗаданиеЗакрытиеМесяцаЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеЗакрытиеМесяцаИдентификатор);
	КонецЕсли;
	
	УдалитьСообщения(Ложь, Истина, Ложь);
	// Сворачиваем все развернутые группы подробностей
	Для ии = 1 По 12 Цикл
		НомерМесяца = Строка(ии);
		Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
			ИмяГруппыПодробно = СтрШаблон("Группа%1Подробно%2", ИмяСекции, НомерМесяца);
			Элементы[ИмяГруппыПодробно].Видимость = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	ПараметрыПроцедуры = СтруктураПараметровЗакрытиеМесяца();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗакрытиеМесяца.ВыполнитьЗакрытиеМесяца",
																ПараметрыПроцедуры,
																ПараметрыВыполнения);
	
	ФоновоеЗаданиеЗакрытиеМесяцаИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
	ФоновоеЗаданиеЗакрытиеМесяцаАдресРезультата = РезультатФоновогоЗадания.АдресРезультата;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		// Ошибка за время вызова
		ОбщегоНазначения.СообщитьПользователю(РезультатФоновогоЗадания.КраткоеПредставлениеОшибки);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда
		// Завершено за время вызова, данные получены
		ОбновитьДанные(ФоновоеЗаданиеЗакрытиеМесяцаАдресРезультата);
	Иначе
		// иначе начнем ожидания завершения фонового задания
		ФоновоеЗаданиеЗакрытиеМесяцаЗапущено = Истина;
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеЗакрытиеМесяцаВыполнено(Результат, ЗагрузитьРезультат) Экспорт
	
	ФоновоеЗаданиеЗакрытиеМесяцаЗапущено = Ложь;
	УстановитьДоступностьПриЗакрытииМесяца();
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ОбновитьДанные(ФоновоеЗаданиеЗакрытиеМесяцаАдресРезультата);
		АктуализироватьДатуЗапретаРедактирования();
		Если ЗакрыватьПоМесяцам Тогда
			Оповестить("ЗакрытиеМесяца", Дата(ТекГод, ТекМесяц, 1), ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	Если НЕ ЗакрыватьПоМесяцам Тогда
		ЗапуститьЗакрытиеСледующегоПериода(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПриЗакрытииМесяца()
	
	Если ФоновоеЗаданиеЗакрытиеМесяцаЗапущено 
		ИЛИ ПроцессЗакрытияЗаПериодАктивен Тогда
		
		УстановитьОбщуюДоступностьЭлементовФормы(Ложь);
		
		Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
			ИмяЭлементаКартинка = СтрШаблон("%1Картинка%2", ИмяСекции, ТекМесяц);
			ИмяЭлементаОписание = СтрШаблон("%1Описание%2", ИмяСекции, ТекМесяц);
			ИмяЭлементаПереключатель = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
			Элементы[ИмяЭлементаКартинка].Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
			Элементы[ИмяЭлементаКартинка].Гиперссылка = Ложь;
			Если ЭтотОбъект[ИмяЭлементаПереключатель] Тогда
				Элементы[ИмяЭлементаОписание].Заголовок = НСтр("ru = 'закрытие'");
			Иначе
				Элементы[ИмяЭлементаОписание].Заголовок = НСтр("ru = 'отмена'");
			КонецЕсли; 
			Элементы[ИмяЭлементаОписание].Гиперссылка = Ложь;
			Элементы[ИмяЭлементаПереключатель].ТолькоПросмотр = Истина;
		КонецЦикла; 
		ИмяЭлементаПереключательГруппы = СтрШаблон("ЗакрытиеМесяца%1", ТекМесяц);
		Элементы[ИмяЭлементаПереключательГруппы].ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.Месяцы.ТекущаяСтраница = Элементы["М" + Строка(ТекМесяц)];
		УстановитьОбщуюДоступностьЭлементовФормы(Истина);
		
		Для каждого ИмяСекции Из ВсеСекцииЗакрытияМесяца() Цикл
			ИмяЭлементаПереключатель = СтрШаблон("%1%2", ИмяСекции, ТекМесяц);
			Элементы[ИмяЭлементаПереключатель].ТолькоПросмотр = Ложь;
		КонецЦикла;
		ИмяЭлементаПереключательГруппы = СтрШаблон("ЗакрытиеМесяца%1", ТекМесяц);
		Элементы[ИмяЭлементаПереключательГруппы].ТолькоПросмотр = Ложь;
		
	КонецЕсли; 
	
	Для ии = 1 По 12 Цикл
		Если ии = ТекМесяц И ФоновоеЗаданиеЗакрытиеМесяцаЗапущено Тогда
			ИмяКнопки = СтрШаблон("ВыполнитьЗакрытиеМесяца%1", ии);
			Элементы[ИмяКнопки].Заголовок = НСтр("ru = 'Прервать'");
			ИмяКнопки = СтрШаблон("ОтменитьЗакрытиеМесяца%1", ии);
			Элементы[ИмяКнопки].Видимость = Ложь;
		Иначе
			ИмяКнопки = СтрШаблон("ВыполнитьЗакрытиеМесяца%1", ии);
			Элементы[ИмяКнопки].Заголовок = НСтр("ru = 'Выполнить'");
			Элементы[ИмяКнопки].Доступность = НЕ ФоновоеЗаданиеЗакрытиеМесяцаЗапущено;
			ИмяКнопки = СтрШаблон("ОтменитьЗакрытиеМесяца%1", ии);
			Элементы[ИмяКнопки].Доступность = НЕ ФоновоеЗаданиеЗакрытиеМесяцаЗапущено;
			Элементы[ИмяКнопки].Видимость = Истина;
		КонецЕсли; 
	КонецЦикла; 
		
КонецПроцедуры

// Функция формирует структуру параметров из значений реквизитов формы
//
&НаСервере
Функция СтруктураПараметровЗакрытиеМесяца()
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ТекМесяц", ТекМесяц);
	СтруктураПараметров.Вставить("ТекГод", ТекГод);
	СтруктураПараметров.Вставить("Организация", Организация);
	
	ВыполнитьРасчетАмортизации = ЗначениеРеквизитаФормыПоЗначениюМесяца(ЭтотОбъект, "НачислениеАмортизации", ТекМесяц);
	СтруктураПараметров.Вставить("ВыполнитьРасчетАмортизации", ВыполнитьРасчетАмортизации);
	
	Если НЕ ЗакрыватьПоМесяцам Тогда
		СтруктураПараметров.ВыполнитьРасчетАмортизации = Истина;
	КонецЕсли;
	
	МассивОпераций = Новый Массив;
	Для каждого Секция Из ВсеСекцииЗакрытияМесяца() Цикл
		Если ЗначениеРеквизитаФормыПоЗначениюМесяца(ЭтотОбъект, Секция, ТекМесяц) ИЛИ НЕ ЗакрыватьПоМесяцам Тогда
			МассивОпераций.Добавить(Секция);
		КонецЕсли; 
	КонецЦикла; 
	СтруктураПараметров.Вставить("Операции", МассивОпераций);
	
	Если НЕ ЗакрыватьПоМесяцам И ОтменаЗакрытияЗаПериод Тогда
		СтруктураПараметров.ВыполнитьРасчетАмортизации = Ложь;
		СтруктураПараметров.Операции.Очистить();
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьЗакрытиеСледующегоПериода(Результат)
	
	Если ОперацияПрервана Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьОшибкиЗакрытияЗаПериод Тогда
		
		ПроцессЗакрытияЗаПериодАктивен = Ложь;
		ЗакрыватьПоМесяцам = Истина;
		
		ТекстПредупреждения = НСтр("ru='При закрытии месяца возникли проблемы.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		
		Элементы.Месяцы.ТекущаяСтраница = Элементы["М"+ТекМесяц];
		УстановитьДоступностьПриЗакрытииМесяца();
		ЗакрыватьЗаПериодПриИзменении(Неопределено);
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда 
		
		СледующийГодЗакрытия = ТекГод;
		СледующийМесяцЗакрытия = ТекМесяц + 1;
		
		Если СледующийМесяцЗакрытия > 12 Тогда
			СледующийМесяцЗакрытия = 1;
			СледующийГодЗакрытия = СледующийГодЗакрытия + 1;
		КонецЕсли;
		
		Если ПериодЗакрытия.ДатаОкончания < Дата(СледующийГодЗакрытия, СледующийМесяцЗакрытия, 1) Тогда
			
			ОбновитьДанные(ФоновоеЗаданиеЗакрытиеМесяцаАдресРезультата);
			АктуализироватьДатуЗапретаРедактирования();
			
			ПроцессЗакрытияЗаПериодАктивен = Ложь;
			НастроитьФормуОкончаниеЗакрытияЗаПериод(Истина);
			
			УстановитьДоступностьПриЗакрытииМесяца();
			Оповестить("ЗакрытиеМесяца", Дата(ТекГод, ТекМесяц, 1), ЭтотОбъект);
			
			Возврат;
			
		Иначе
			
			ТекМесяц = СледующийМесяцЗакрытия;
			ТекГод = СледующийГодЗакрытия;
			
			Если КонецМесяца(Дата(ТекГод, ТекМесяц, 1)) <= КонецДня(ДатаЗапретаРедактирования) Тогда
				ПоказатьПредупреждение(Неопределено, НСтр("ru='Нельзя закрыть месяц, т.к. он относится к запрещенному для редактирования периоду.'"));
				Возврат;
			КонецЕсли;
			
			ОбновитьИндикаторЗакрытияМесяцев();
			ЗапуститьФоновоеЗаданиеЗакрытиеМесяца();
			
		КонецЕсли;
		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
		ПроцессЗакрытияЗаПериодАктивен = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОперациюЗаПериод()
	
	Если ФоновоеЗаданиеЗакрытиеМесяцаЗапущено Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеЗакрытиеМесяцаИдентификатор);
		ФоновоеЗаданиеЗакрытиеМесяцаЗапущено = Ложь;
		ПроцессЗакрытияЗаПериодАктивен = Ложь;
	Иначе
		
		Отказ = Ложь;
		ПроверитьВыбранныйПериод(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ЕстьОшибкиЗакрытияЗаПериод = Ложь;
		ПроцессЗакрытияЗаПериодАктивен = Истина;
		ОперацияПрервана = Ложь;
		ТекГод = Год(ПериодЗакрытия.ДатаНачала);
		ТекМесяц = Месяц(ПериодЗакрытия.ДатаНачала);
		
		Если ОтменаЗакрытияЗаПериод Тогда
			ТекстСообщения = НСтр("ru='Нельзя отменить закрытие месяца, т.к. он относится к запрещенному для редактирования периоду.'");
		Иначе
			ТекстСообщения = НСтр("ru='Нельзя закрыть месяц, т.к. он относится к запрещенному для редактирования периоду.'");
		КонецЕсли;
		
		Если КонецМесяца(Дата(ТекГод, ТекМесяц, 1)) <= КонецДня(ДатаЗапретаРедактирования) Тогда
			ПоказатьПредупреждение(Неопределено, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ОбновитьИндикаторЗакрытияМесяцев();
		УстановитьВидимостьНачалоЗакрытияЗаПериод();
		ЗапуститьФоновоеЗаданиеЗакрытиеМесяца();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗаданиеОбщее

&НаСервереБезКонтекста
Процедура ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор)
	
	Если ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеИдентификатор);
	
КонецПроцедуры

#КонецОбласти 

#Область СвязанныеОтчеты

&НаКлиенте
Процедура ОбновитьСписокОтчетов()
	
	Для каждого ВстроенноеОкно Из Окно.Содержимое Цикл
		Если ВстроенноеОкно.ИмяФормы <> "ОбщаяФорма.ФормаСпискаОтчетов" Тогда
			Продолжить;
		КонецЕсли; 
		СтруктураПараметров = Новый Структура("ТекГод, ТекМесяц, Организация");
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтотОбъект);
		СтруктураОткрытия = Новый Структура;
		ДополнитьСтруктуруОткрытияНаСервере(СтруктураПараметров, СтруктураОткрытия);
		ВстроенноеОкно.ПоОбъекту = СтруктураОткрытия;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьСтруктуруОткрытияНаСервере(СтруктураПараметров, СтруктураОткрытия)

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ТекГод) Тогда
		СтруктураПараметров.ТекГод = Год(ТекущаяДатаСеанса());
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ТекМесяц) Тогда
		СтруктураПараметров.ТекМесяц = Месяц(ТекущаяДатаСеанса());
	КонецЕсли; 
	Месяц = Дата(СтруктураПараметров.ТекГод, СтруктураПараметров.ТекМесяц, 1);
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		Если Константы.УчетПоКомпании.Получить() Тогда
			СтруктураПараметров.Организация = Справочники.Организации.ОрганизацияКомпания();
		Иначе
			СтруктураПараметров.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	СтруктураОткрытия.Вставить("ПериодРасшифровки", Новый СтандартныйПериод(НачалоМесяца(Месяц), КонецМесяца(Месяц)));
	СтруктураОткрытия.Вставить("Организация", СтруктураПараметров.Организация);
	СтруктураОткрытия.Вставить("Контекст", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Обработки.ЗакрытиеМесяца));
	
КонецПроцедуры 

#КонецОбласти 

#Область ФиксированныеСтроки

#Область Секции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияПроверкаАвансыПокупателей()
	
	Возврат "ПроверкаАвансыПокупателей";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияПроверкаАвансыПоставщикам()
	
	Возврат "ПроверкаАвансыПоставщикам";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияПроверкаСтатьиДДС()
	
	Возврат "ПроверкаСтатьиДДС";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияПроверкаОрганизацииИДоговоры()
	
	Возврат "ПроверкаОрганизацииИДоговоры";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияПроверкаЕдиницИзмерения()
	
	Возврат "ПроверкаЕдиницИзмерения";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВсеСекцииПроверки()
	
	Результат = Новый Массив;
	Результат.Добавить(СекцияПроверкаАвансыПокупателей());
	Результат.Добавить(СекцияПроверкаАвансыПоставщикам());
	Результат.Добавить(СекцияПроверкаСтатьиДДС());
	Результат.Добавить(СекцияПроверкаОрганизацииИДоговоры());
	Результат.Добавить(СекцияПроверкаЕдиницИзмерения());
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияНачислениеАмортизации()
	
	Возврат "НачислениеАмортизации";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияРасчетПрямыхЗатрат()
	
	Возврат "РасчетПрямыхЗатрат";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияРаспределениеЗатрат()
	
	Возврат "РаспределениеЗатрат";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияРасчетФактическойСебестоимости()
	
	Возврат "РасчетФактическойСебестоимости";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияРасчетСебестоимостиВРознице()
	
	Возврат "РасчетСебестоимостиВРознице";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияРасчетКурсовыхРазниц()
	
	Возврат "РасчетКурсовыхРазниц";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияРасчетФинансовогоРезультата()
	
	Возврат "РасчетФинансовогоРезультата";
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СекцияЗачетАвансаПоЕдиномуНалоговомуСчету()
	
	Возврат "ЗачетАвансаПоЕдиномуНалоговомуСчету";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВсеСекцииЗакрытияМесяца()
	
	Результат = Новый Массив;
	Результат.Добавить(СекцияНачислениеАмортизации());
	Результат.Добавить(СекцияРасчетПрямыхЗатрат());
	Результат.Добавить(СекцияРаспределениеЗатрат());
	Результат.Добавить(СекцияРасчетФактическойСебестоимости());
	Результат.Добавить(СекцияРасчетСебестоимостиВРознице());
	Результат.Добавить(СекцияРасчетКурсовыхРазниц());
	Результат.Добавить(СекцияРасчетФинансовогоРезультата());
	Результат.Добавить(СекцияЗачетАвансаПоЕдиномуНалоговомуСчету());
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВсеСекции()
	
	Результат = ВсеСекцииПроверки();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ВсеСекцииЗакрытияМесяца());
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СекцияНедоступна(ИмяСекции, Форма)
	
	Если НЕ Форма.УчетИмущества И ИмяСекции = СекцияНачислениеАмортизации() Тогда
		Возврат Истина;
	ИначеЕсли НЕ Форма.УчетРозничныхПродаж И ИмяСекции = СекцияРасчетСебестоимостиВРознице() Тогда
		Возврат Истина;
	ИначеЕсли НЕ Форма.УчетВалютныхОпераций И ИмяСекции = СекцияРасчетКурсовыхРазниц() Тогда
		Возврат Истина;
	ИначеЕсли НЕ Форма.РасчетФинансовогоРезультата И ИмяСекции = СекцияРасчетФинансовогоРезультата() Тогда
		Возврат Истина;
	ИначеЕсли НЕ Форма.ИспользоватьРаспределениеЗатрат И ИмяСекции = СекцияРаспределениеЗатрат() Тогда
		Возврат Истина; 
	ИначеЕсли НЕ Форма.ЗачетАвансаПоЕдиномуНалоговомуСчету И ИмяСекции = СекцияЗачетАвансаПоЕдиномуНалоговомуСчету() Тогда
		Возврат Истина; 		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

#КонецОбласти 

#Область СостоянияЗакрытия

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеЗакрыт()
	
	Возврат "Закрыт";
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция СостояниеНеЗакрыт()
	
	Возврат "НеЗакрыт";
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция СостояниеЗакрытиеНеТребуется()
	
	Возврат "ЗакрытиеНеТребуется";
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция СостояниеОшибки()
	
	Возврат "Ошибки";
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТекстОшибкиПередЗакрытием()
	
	Возврат НСтр("ru = 'не выполнено'");
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗакрытиеНеВыполнено()
	
	Возврат НСтр("ru = 'не выполнено'");
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗакрытиеВыполненоУспешно()
	
	Возврат НСтр("ru = 'успешно'");
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗакрытиеВыполненоСОшибками()
	
	Возврат НСтр("ru = 'ошибки'");
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗакрытиеНеТребуется()
	
	Возврат НСтр("ru = 'не требуется'");
	
КонецФункции

#КонецОбласти 

#Область ТипыСообщений

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияПереносРезерва()
	
	Возврат "ПереносРезерва";
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияОтрицательныеОстатки()
	
	Возврат "ОтрицательныеОстатки";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияИзмененныеДокументы()
	
	Возврат "ИзмененныеДокументы";
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияОшибкаИнтеркампани()
	
	Возврат "ОшибкаИнтеркампани";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНезачтенныеАвансыПокупателей()
	
	Возврат "НезачтенныеАвансыПокупателей";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНезачтенныеАвансыПоставщикам()
	
	Возврат "НезачтенныеАвансыПоставщикам";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНеверноВыбранаСтатьяДДСПлатежи()
	
	Возврат "НеверноВыбранаСтатьяДДСПлатежи";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНеверноВыбранаСтатьяДДСПоступления()
	
	Возврат "НеверноВыбранаСтатьяДДСПоступления";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНеверноВыбранаСтатьяДДС()
	
	Возврат "НеверноВыбранаСтатьяДДС";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНесоответствиеОрганизацииВДокументеИДоговоре()
	
	Возврат "НесоответствиеОрганизацииВДокументеИДоговоре";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНесоответствиеОрганизацииВПодчиненномДокументе()
	
	Возврат "НесоответствиеОрганизацииВПодчиненномДокументе";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНесоответствиеДоговораВПодчиненномДокументе()
	
	Возврат "НесоответствиеДоговораВПодчиненномДокументе";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияНесоответствиеДоговоровОрганизаций()
	
	Возврат "НесоответствиеДоговоровОрганизаций";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияОстаткиСебестоимостиБезКоличества()
	
	Возврат "ОстаткиСебестоимостиБезКоличества";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияОткрытыеКассовыеСмены()
	
	Возврат "ОткрытыеКассовыеСмены";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияЧекиВСостоянииРезерва()
	
	Возврат "ЧекиВСостоянииРезерва";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияЧекиСДвижениями()
	
	Возврат "ЧекиСДвижениями";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСообщенияПриблизительноеОкруглениеКоличества()
	
	Возврат "ПриблизительноеОкруглениеКоличества";
	
КонецФункции

#КонецОбласти 

#КонецОбласти 

#Область Прочее

// Функция считывает и возвращает значение реквизита формы для указанного месяца
// 
&НаСервереБезКонтекста
Функция ЗначениеРеквизитаФормыПоЗначениюМесяца(ФормаОбработки, ИмяФлага, ТекМесяц)
	
	Возврат ФормаОбработки[ИмяФлага + Строка(ТекМесяц)];
	
КонецФункции // ЗначениеРеквизитаФормыПоЗначениюМесяца()

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаДерева(ОшибкиЗакрытияМесяца, Год, НомерМесяца, Секция)
	
	Месяц = Дата(Год, НомерМесяца, 1);
	Результат = Неопределено;
	Для каждого СтрокаДереваМесяц Из ОшибкиЗакрытияМесяца.ПолучитьЭлементы() Цикл
		Если СтрокаДереваМесяц.Месяц <> Месяц Тогда
			Продолжить;
		КонецЕсли; 
		Для каждого СтрокаДереваСекция Из СтрокаДереваМесяц.ПолучитьЭлементы() Цикл
			Если СтрокаДереваСекция.Секция <> Секция Тогда
				Продолжить;
			КонецЕсли;
			Результат = СтрокаДереваСекция;
		КонецЦикла; 
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеПереключателяГруппы(Форма, ИменаСекций, Месяц, ИмяГруппы)
	
	МассивЗначений = Новый Массив;
	Для каждого ИмяСекции Из ИменаСекций Цикл
		ИмяРеквизита = СтрШаблон("%1%2", ИмяСекции, Месяц);
		Значение = Форма[ИмяРеквизита];
		Если МассивЗначений.Найти(Значение) = Неопределено Тогда
			МассивЗначений.Добавить(Значение);
		КонецЕсли; 
	КонецЦикла;
	
	ИмяРеквизита = СтрШаблон("%1%2", ИмяГруппы, Месяц);
	Если МассивЗначений.Количество() <> 1 Тогда
		Форма[ИмяРеквизита] = 2;
	Иначе
		Форма[ИмяРеквизита] = ?(МассивЗначений[0], 1, 0);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаСервер()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервере
Процедура ПереключитьИспользованиеЗакрытияСуммБезКоличества(НовоеЗначение)
	
	Константы.ИспользоватьЗакрытиеСуммБезКоличества.Установить(НовоеЗначение);
	ОбновитьПодсказкиЭтаповЗакрытия();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказкиЭтаповЗакрытия()
	
	ТекстПодсказки = НСтр("ru = 'Расчет себестоимости с учетом распределения косвенных и прямых затрат.'");
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЭтапыПроизводства") Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗакрытиеСуммБезКоличества") Тогда
			ТекстПодсказки = СтрШаблон(
			НСтр("ru = '%1 
				|
				|Если на этапе расчета себестоимости остаются суммы по запасам без количества, они будут закрыты, поскольку включено автоматическое списание таких сумм на расходы.
				|
				|<a href=""Отключить"">Отключить автоматическое списание</a>'"), ТекстПодсказки);
			
		Иначе
			ТекстПодсказки = СтрШаблон(
			НСтр("ru = '%1 
				|
				|Если на этапе расчета себестоимости остаются суммы по запасам без количества, можно включить закрытие таких сумм. В этом случае они будут списаны на расходы автоматически.
				|
				|<a href=""Включить"">Включить автоматическое списание</a>'"), ТекстПодсказки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Итератор = 1 По 12 Цикл
		ИмяЭлемента = "РасчетФактическойСебестоимости" + Строка(Итератор);
		Элементы[ИмяЭлемента].РасширеннаяПодсказка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ТекстПодсказки);
		Элементы[ИмяЭлемента].РасширеннаяПодсказка.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_РасчетФактическойСебестоимостиРасширеннаяПодсказкаОбработкаНавигационнойСсылки");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетФактическойСебестоимостиРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПереключитьИспользованиеЗакрытияСуммБезКоличества(НавигационнаяСсылкаФорматированнойСтроки = "Включить");
	ТекстСообщения = НСтр("ru = 'Автоматическое списание остатков сумм изменено'");
	ПоказатьОповещениеПользователя(ТекстСообщения);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
