
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство( "УчетнаяЗапись" ) 
	И ЗначениеЗаполнено( ЭтаФорма.Параметры.УчетнаяЗапись ) 
	Тогда
		ЭтаФорма.УчетнаяЗаписьОтбор = ЭтаФорма.Параметры.УчетнаяЗапись;
	КонецЕсли;

	УчетнаяЗаписьОтборПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура УчетнаяЗаписьОтборПриИзмененииСервер()
	
	УчетнаяЗаписьОтборУстановить();
				
	ЭтаФорма.Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УчетнаяЗаписьОтборУстановить()
	ЭтаФорма.Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено( ЭтаФорма.УчетнаяЗаписьОтбор ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Список, "НастройкаИнтеграции",
				ЭтаФорма.УчетнаяЗаписьОтбор, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗаказПокупателя" Тогда
		Ссылка = Элементы.Список.ТекущиеДанные.ЗаказПокупателя;
		Если ЗначениеЗаполнено( Ссылка ) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , Ссылка );
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
