
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоОтправлено = Неопределено;
	КоличествоОбработано = Неопределено;
	КоличествоОшибокЗаполнения = Неопределено;
	
	Параметры.Свойство("КоличествоОтправлено", КоличествоОтправлено);
	Параметры.Свойство("КоличествоОбработано", КоличествоОбработано);
	Параметры.Свойство("КоличествоОшибокЗаполнения", КоличествоОшибокЗаполнения);
	
	Если КоличествоОшибокЗаполнения = 0 Тогда
		Элементы.КартинкаРезультат.Картинка = БиблиотекаКартинок.Успешно32;	
	Иначе
		Элементы.КартинкаРезультат.Картинка = БиблиотекаКартинок.ИнтернетПоддержкаВнимание;
	КонецЕсли;
	
	Если КоличествоОтправлено = КоличествоОбработано Тогда
		Элементы.Текст.Заголовок = "Все документы отправлены!";
	Иначе	
		Элементы.Текст.Заголовок = "Отправлено документов: " + КоличествоОтправлено + " из " + КоличествоОбработано;
		Если КоличествоОшибокЗаполнения > 0 Тогда
			Элементы.Текст.Заголовок = Элементы.Текст.Заголовок + "
			|Документов с ошибками заполнения: " + КоличествоОшибокЗаполнения;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
