#Область СлужебныйПрограммныйИнтерфейс

// Имя подсистемы.
// 
// Возвращаемое значение:
//  Строка - Имя подсистемы
Функция ИмяПодсистемы() Экспорт
	
	Возврат "ИСМП";
	
КонецФункции

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

Функция ДатаНачалаКонтроляКодовМаркировкиМОТП() Экспорт
	
	Возврат '20200701';
	
КонецФункции

// Инициализировать структуру параметров запроса в ИС МОТП (ИС МП) для получения ключа сессии.
// 
// Параметры:
// 	Организация - ОпределяемыйТип.Организация, Неопределено - Организация.
// Возвращаемое значение:
// 	См. ИнтерфейсАвторизацииИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии
//
Функция ПараметрыЗапросаКлючаСессии(Организация = Неопределено) Экспорт
	
	Возврат ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация);
	
КонецФункции

// Возвращает параметры для отправки HTTP запросов МОТП.
// 
// Параметры:
// 	Поддомен - Строка - Имя поддомена
// 	ИспользоватьTrueAPI - Булево - Использовать true-api
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ИспользоватьЗащищенноеСоединение - Булево - Признак использования SSL.
// * Таймаут - Число - Таймаут соединения.
// * Порт - Число - Порт соединения.
// * Сервер - Строка - Адрес сервера.
// * ПредставлениеСервиса - Строка - Представления сервиса.
//
Функция ПараметрыОтправкиHTTPЗапросов(Поддомен = "api", ИспользоватьTrueAPI = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Поддомен) Тогда
		АдресСервера = СтрШаблон("%1.%2", Поддомен, АдресСервера(ИспользоватьTrueAPI));
	Иначе
		АдресСервера = АдресСервера(ИспользоватьTrueAPI);
	КонецЕсли;
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                           АдресСервера);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                             443);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                          60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",             НСтр("ru = 'ГИС МТ'"));
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

// Конструктор параметров подключения локального модуля ЧЗ - адрес подключения, данные авторизации
// 
// Возвращаемое значение:
//  Структура - Параметры подключения локального модуля ЧЗ:
// * Сервер - Строка - адрес сервера
// * ЗащищенноеСоединение - Булево - Истина, если используется протокол https://, и Ложь, если http://
// * Порт - Число - порт службы отправки запросов. По умолчанию 5995
// * Логин - Строка - логин администратора, заданный при установке
// * Пароль - Строка - пароль администратора, заданный при установке
Функция ПараметрыПодключенияЛокальногоМодуляЧЗ() Экспорт
	
	ПараметрыУстановки = Новый Структура();
	ПараметрыУстановки.Вставить("Сервер",               "");
	ПараметрыУстановки.Вставить("ЗащищенноеСоединение", Ложь);
	ПараметрыУстановки.Вставить("Порт",                 5995);
	ПараметрыУстановки.Вставить("Логин",                "");
	ПараметрыУстановки.Вставить("Пароль",               "");
	
	Возврат ПараметрыУстановки;
	
КонецФункции

// Конструктор параметров подключения ТС ПИоТ - адрес подключения
// 
// Возвращаемое значение:
//  Структура - Параметры подключения ТС ПИоТ:
// * ПодключаемоеОборудование - Неопределено, СправочникСсылка.ПодключаемоеОборудование - ссылка на ККТ
// * ТСПИоТ - Неопределено, СправочникСсылка.ТСПИоТ - ссылка на ТС ПИоТ
// * ВнутреннийТСПИоТ - Булево - Истина, если используется настройка подключения к внутреннему ТС ПИоТ 1С
// * Сервер - Строка - адрес сервера
// * ЗащищенноеСоединение - Булево - Истина, если используется протокол https://, и Ложь, если http://
// * Порт - Число - порт службы отправки запросов. По умолчанию 443
// * АдресПодключения - Строка - адрес подключения
// * ОбменНаСервере - Булево - Истина, если настроен обмен на сервере
// * ИсключитьПроверкуКорневыхСертификатов - Булево - Истина, если необходимо исключить проверку корневых сертификатов. 
//		Исключение требуется только для отладочных работ на тестовых стендах.
Функция ПараметрыПодключенияТСПИоТ() Экспорт
	
	ПараметрыПодключения = Новый Структура();
	ПараметрыПодключения.Вставить("ПодключаемоеОборудование",              Неопределено);
	ПараметрыПодключения.Вставить("ТСПИоТ",                                Неопределено);
	ПараметрыПодключения.Вставить("ВнутреннийТСПИоТ",                      Ложь);
	ПараметрыПодключения.Вставить("Сервер",                                "");
	ПараметрыПодключения.Вставить("ЗащищенноеСоединение",                  Истина);
	ПараметрыПодключения.Вставить("Порт",                                  443);
	ПараметрыПодключения.Вставить("ОбменНаСервере",                        Ложь);
	ПараметрыПодключения.Вставить("АдресПодключения",                      "");
	ПараметрыПодключения.Вставить("ИсключитьПроверкуКорневыхСертификатов", Ложь);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

// Возвращает адрес сервера ИС МОТП.
// 
// Параметры:
// 	ИспользоватьTrueAPI - Булево - Использовать true-api
// Возвращаемое значение:
// 	Строка - адрес сервера ИС МОТП.
//
Функция АдресСервера(ИспользоватьTrueAPI = Ложь) Экспорт
	
	РежимРаботыСТестовымКонтуромИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.РежимРаботыСТестовымКонтуромИСМП();
	
	Если РежимРаботыСТестовымКонтуромИСМП Тогда
		Возврат "markirovka.sandbox.crptech.ru";
	Иначе
		Возврат "markirovka.crpt.ru";
	КонецЕсли;
	
КонецФункции

Функция ИменаПараметровРаботыКлиента() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить(
		"ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом",
		"ИнтеграцияИСМП_ВерсияБПОПоддерживаетПроверкуКМСредствамиККТЕдинымМетодом");
	ВозвращаемоеЗначение.Вставить(
		"ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ",
		"ИнтеграцияИСМП_ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ");
	ВозвращаемоеЗначение.Вставить(
		"ПараметрыЛогированияЗапросов",
		"ИнтеграцияИСМП_ПараметрыЛогированияЗапросовНаКлиенте");
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Структура дат раздельного контроля по виду маркируемой продукции
// 
// Возвращаемое значение:
//  Структура:
// * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции
// * ДатаКонтрольПроизводства - Дата - Обязательность нанесения кода маркировки 
// 		на потребительскую упаковку и подачи в систему маркировки сведения 
// 		о вводе в оборот
// * ДатаКонтрольВыводИзОборота - Дата - Обязательность передачи сведений 
// 		в систему цифровой маркировки о выводе из оборота по прочим причинам 
// 		(не являющимся продажей в розницу)
// * ДатаРозницаУведомительныйРежим - Дата - Уведомительный режим - обязательность 
// 		сканирования кодов на кассе при продаже маркированной продукции 
// 		и передачи сведений о продажах в систему маркировки с использованием онлайн-касс
// * ДатаРозницаРазрешительныйРежим - Дата - Разрешительный режим - обязательность 
// 		онлайн проверки кодов маркировки при розничной продаже
// * ДатаРозницаЛокальныйРазрешительныйРежим - Дата - Локальный разрешительный режим
// 		с применением ЛМ ЧЗ - обязательность локальной проверки кодов маркировки
// 		при розничной продаже
// * ДатаОптКонтрольПоштучно - Дата - Обязательность передачи сведений об обороте 
// 		маркированных товаров в поэкземплярном учете
// * ДатаОптКонтрольОСУ - Дата - Обязательность передачи сведений об обороте 
// 		маркированных товаров (возможно применение объемно-сортового учета)
// * ДатаЗапретПродажиНемаркированныхОстатков - Дата - Запрет на оборот немаркированных остатков товаров
// * ДатаПрослеживаемостьПеремещенияМеждуМОД - Дата - Обязательность прослеживаемости перемещения между
// 		местами осуществления деятельности
// * ДатаКонтроляРазрешительныхДокументов - Дата - Контроль разрешительных документов при обороте маркируемой продукции.
Функция ИнициализироватьНастройкуДатРаздельногоКонтроля() Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ВидПродукции",                             ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПустаяСсылка"));
	СтруктураВозврата.Вставить("ДатаКонтрольПроизводства",                 Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаКонтрольВыводИзОборота",               Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаРозницаУведомительныйРежим",           Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаРозницаРазрешительныйРежим",           Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаРозницаЛокальныйРазрешительныйРежим",  Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаОптКонтрольПоштучно",                  Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаОптКонтрольОСУ",                       Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаЗапретПродажиНемаркированныхОстатков", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаПрослеживаемостьПеремещенияМеждуМОД",  Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаКонтроляРазрешительныхДокументов",     Дата(1, 1, 1));
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает значение параметра ЗапрашиватьДанныеСервисаИСМП. Если оно установлено как ПоУмолчанию, то значение берется из
//  ФО ЗапрашиватьДанныеСервисаИСМП
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОтключитьПоВидуПродукцииВидуОперации - Булево - признак необходимости исключения запросов по настройкам исключений контролей
//  ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП - Неопределено, Булево -
// Возвращаемое значение:
//  Булево - значение ЗапрашиватьДанныеСервисаИСМП
Функция ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, ОтключитьПоВидуПродукцииВидуОперации = Ложь, ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = Неопределено) Экспорт
	
	Значение = Ложь;
	
	Если ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = Неопределено Тогда
		ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ПараметрыСканирования, "ЗапрашиватьДанныеСервисаИСМП");
	КонецЕсли;
	Если Не ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = Тип("Строка") Тогда
		
		Если ВРег(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = "ПОУМОЛЧАНИЮ" Тогда
			Значение = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЗапрашиватьДанныеСервиса() И Не ОтключитьПоВидуПродукцииВидуОперации;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = Тип("Булево") Тогда
		
		Значение = ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Устанавливает значение параметра ЗапрашиватьДанныеСервисаИСМП. 
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Значение - Булево, Строка - если устанавливается строка "ПоУмолчанию", то значение берется в соответствие с ФО ЗапрашиватьДанныеСервисаИСМП
//    если требуется поведение, отличное от ФО, то оно устанавливается напрямую значением типа Булево
Процедура УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Значение = "ПоУмолчанию") Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеСервисаИСМП") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП = Значение;
	
КонецПроцедуры

// Возвращает значение параметра ЗапрашиватьДанныеНеизвестныхУпаковокИСМП. Если оно установлено как ПоУмолчанию, то значение берется из
//  ФО ЗапрашиватьДанныеСервисаИСМП
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОтключитьПоВидуПродукцииВидуОперации - Булево - признак необходимости исключения запросов по настройкам исключений контролей
// 
// Возвращаемое значение:
//  Булево - значение ЗапрашиватьДанныеНеизвестныхУпаковокИСМП
Функция ЗначениеПараметраСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, ОтключитьПоВидуПродукцииВидуОперации = Ложь) Экспорт
	
	Значение = Ложь;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеНеизвестныхУпаковокИСМП") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = Тип("Строка") Тогда
		
		Если ВРег(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = "ПОУМОЛЧАНИЮ" Тогда
			Значение = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЗапрашиватьДанныеСервиса() И Не ОтключитьПоВидуПродукцииВидуОперации;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = Тип("Булево") Тогда
		
		Значение = ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Устанавливает значение параметра ЗапрашиватьДанныеНеизвестныхУпаковокИСМП. 
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Значение - Булево, Строка - если устанавливается строка "ПоУмолчанию", то значение берется в соответствие с ФО ЗапрашиватьДанныеСервисаИСМП
//    если требуется поведение, отличное от ФО, то оно устанавливается напрямую значением типа Булево
Процедура УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Значение = "ПоУмолчанию") Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеНеизвестныхУпаковокИСМП") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП = Значение;
	
КонецПроцедуры

// Вид продукции ИС МП требует указание срока годности в операциях нанесения КМ
// 
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//  УчитыватьМолочнуюПродукцию - Булево - Флаг учета молочной продукции
// 
// Возвращаемое значение:
//  Булево - вид продукции требует указания срока годности
Функция ЭтоВидПродукцииСоСрокамиГодности(ВидПродукции, УчитыватьМолочнуюПродукцию = Истина) Экспорт
	
	Если УчитыватьМолочнуюПродукцию И ОбщегоНазначенияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ВидПродукции)
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы2025")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СпортивноеПитание")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТехническиеСредстваРеабилитации")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МедицинскиеИзделия")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МедицинскиеИзделия20")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольноеПиво")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПивоВПотребительскихУпаковках")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Антисептики")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ДезинфицирующиеСредства")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СоковаяПродукция")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольныеНапитки")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НапиткиССодержаниемМолокаКакаоПрочие")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС") Тогда
		Возврат Истина;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС") Тогда
		Возврат КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КормаДляЖивотныхВлажныеБезВЕТИС") Тогда
		Возврат КормаДляЖивотныхБезВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС") Тогда
		Возврат МясоПодконтрольноеВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ВетеринарныеПрепараты") Тогда
		Возврат ВетеринарныеПрепаратыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей") Тогда
		Возврат ИгрыИИгрушкиДляДетейИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.РадиоэлектроннаяПродукция")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТелефоныИНоутбуки")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПечатныеПлаты") Тогда
		Возврат РадиоэлектроннаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТитановаяМеталлопродукция") Тогда
		Возврат ТитановаяМеталлопродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС") Тогда
		Возврат КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС") Тогда
		Возврат КонсервированнаяПродукцияБезВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.РастительныеМасла") Тогда
		Возврат РастительныеМаслаИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция") Тогда
		Возврат ОптоволокноИОптоволоконнаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТоварыЛичнойГигиены")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БритвыИЛезвия") Тогда
		Возврат ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПечатнаяПродукция") Тогда
		Возврат ПечатнаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СтроительныеМатериалы") Тогда
		Возврат СтроительныеМатериалыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ОтопительныеПриборы") Тогда
		Возврат ОтопительныеПриборыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Бакалея")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.РастворимыеЗавариваемыеНапитки") Тогда
		Возврат БакалеяИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов") Тогда
		Возврат АлкогольнаяПродукцияДо9ПроцентовИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПиротехническиеИзделияИСредстваПожарнойБезопасности") Тогда
		Возврат ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КабельнаяПродукция") Тогда
		Возврат КабельнаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МоторныеМасла") Тогда
		Возврат МоторныеМаслаИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АвтозапчастиИКомплектующиеТранспортныхСредств") Тогда
		Возврат АвтозапчастиИКомплектующиеТранспортныхСредствИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПолимерныеТрубы") Тогда
		Возврат ПолимерныеТрубыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СладостиИКондитерскиеИзделия") Тогда
		Возврат СладостиИКондитерскиеИзделияИспользуетСрокГодности();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВидПродукцииИспользуетЗаводскойСерийныйНомер(ВидПродукции) Экспорт
	
	Возврат ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски")
	Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТехническиеСредстваРеабилитации")
	Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МедицинскиеИзделия")
	Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МедицинскиеИзделия20");
	
КонецФункции

Процедура УстновитьОтборПоОрганизацииИПустомуЗначению(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Список, "Организация");
	ПредставлениеГруппы = "Отбор с пустой организацией";
	Отбор = Форма.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ГруппаОтборов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Отбор,, ПредставлениеГруппы);
	Если ГруппаОтборов.Количество() Тогда
		ГруппаОтборов = ГруппаОтборов[0];
	Иначе
		ГруппаОтборов = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Отбор, ПредставлениеГруппы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	КонецЕсли;
	Если Форма.Организации.Количество() Тогда
		ГруппаОтборов.Использование = Истина;
		ГруппаОтборов.Элементы.Очистить();
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтборов,
			"Организация",
			ВидСравненияКомпоновкиДанных.ВСписке,
			Форма.Организации);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтборов,
			"Организация",
			ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Иначе
		ГруппаОтборов.Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#Область НовыеТоварныеГруппыВнедрение

#Область ИспользуетСтандартныйКМ

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция СтроительныеМатериалыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция БакалеяИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетСтандартныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МоторныеМаслаИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция АвтозапчастиИКомплектующиеТранспортныхСредствИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПолимерныеТрубыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция СладостиИКондитерскиеИзделияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетУкороченныйКМ

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетУкороченныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция БакалеяИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МоторныеМаслаИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция АвтозапчастиИКомплектующиеТранспортныхСредствИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПолимерныеТрубыИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция СладостиИКондитерскиеИзделияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетГрупповуюУпаковку

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция БакалеяИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция МоторныеМаслаИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция АвтозапчастиИКомплектующиеТранспортныхСредствИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ПолимерныеТрубыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция СладостиИКондитерскиеИзделияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетНабор

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция СтроительныеМатериалыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ОтопительныеПриборыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция БакалеяИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция МоторныеМаслаИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция АвтозапчастиИКомплектующиеТранспортныхСредствИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПолимерныеТрубыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция СладостиИКондитерскиеИзделияИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетСрокГодности

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция БакалеяИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция МоторныеМаслаИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция АвтозапчастиИКомплектующиеТранспортныхСредствИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ПолимерныеТрубыИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция СладостиИКондитерскиеИзделияИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область РазрешительныйРежим

// Представление статуса Локального модуля "Честный знак" по данным системы
// 
// Параметры:
//  СтатусСистемы - Строка - статус, полученный из ЛМ ЧЗ по 
// 
// Возвращаемое значение:
//  Строка - читаемое представление статуса
Функция СтатусЛокальногоМодуляЧестныйЗнак(СтатусСистемы) Экспорт
	
	ПредставлениеСтатуса = "";
	
	Если ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакНеНастроено() Тогда
		ПредставлениеСтатуса = "не настроено";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакИнициализация() Тогда
		ПредставлениеСтатуса = "инициализация";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакГотово() Тогда
		ПредставлениеСтатуса = "готово к использованию";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакОшибкиСинхронизации() Тогда
		ПредставлениеСтатуса = "ошибка синхронизации";
	ИначеЕсли Не ЗначениеЗаполнено(СтатусСистемы) Тогда
		ПредставлениеСтатуса = "неопределено";
	Иначе
		ПредставлениеСтатуса = СтатусСистемы;
	КонецЕсли;
	
	Возврат ПредставлениеСтатуса;
	
КонецФункции

// Статус локального модуля честный знак: Ошибка синхронизации.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакОшибкиСинхронизации() Экспорт
	Возврат "SYNC_ERROR";
КонецФункции

// Статус локального модуля честный знак: Не настроено.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакНеНастроено() Экспорт
	Возврат "NOT_CONFIGURED";
КонецФункции

// Статус локального модуля честный знак: Инициализация.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакИнициализация() Экспорт
	Возврат "INITIALIZATION";
КонецФункции

// Статус локального модуля честный знак: Готово к использованию.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакГотово() Экспорт
	Возврат "READY";
КонецФункции

#КонецОбласти

#КонецОбласти