///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	//МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБТС");
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБРО");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБСД");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБЭД");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУНФ");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЕГАИС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБПО");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыГИСМ");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыВЕТИС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЗЕРНО");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыСАТУРН");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыИСМП");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыГосИС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУНФМП");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыРМК");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыСерверЛояльности");
	
	// БЗКБ
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый");
	// Конец БЗКБ
	
	// РаспознаваниеДокументов
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБРД");
	// Конец РаспознаваниеДокументов
	
	// Сервис сверки взаиморасчетов (1С: Сверка 2.0)
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБСС");
	// Конец Сервис сверки взаиморасчетов (1С: Сверка 2.0)
	
КонецПроцедуры

#КонецОбласти