#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ОчиститьДатуНомерВходящегоДокумента(ЭтотОбъект);
	Предоплата.Очистить();
	ШтрихкодыУпаковок.Очистить();
	
	// Прослеживаемость
	СведенияПрослеживаемости.Очистить();
	ПрослеживаемостьУНФ.ОбновитьПризнакПрослеживаемости(Запасы, Дата);
	// Конец Прослеживаемость
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Прослеживаемость
	СведенияПрослеживаемости.Очистить();
	// Конец Прослеживаемость
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПоступлению";
	СтратегияЗаполнения[Тип("ДокументСсылка.КорректировкаПоступления")] = "ЗаполнитьПоПоступлению";
	СтратегияЗаполнения[Тип("ДокументСсылка.ДополнительныеРасходы")] = "ЗаполнитьПоДопРасходам";
	СтратегияЗаполнения[Тип("ДокументСсылка.АктОРасхождениях")] = "ЗаполнитьПоПоступлению";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
	КурсИКратность = РасчетыПроведениеДокументов.КурсИКратностьДляКорректировок(ИсправляемыйДокументПоступления);
	Если КурсИКратность.ВыполненаУстановкаКурсаДляКорректировок Тогда
		Курс = КурсИКратность.Курс;
		Кратность = КурсИКратность.Кратность;
	КонецЕсли;
		
	// Прослеживаемость
	ПрослеживаемостьУНФ.ОбновитьПризнакПрослеживаемости(Запасы, Дата);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда 
		ВариантОсвобожденияАванса = Перечисления.ВариантыОсвобожденияАвансаВКорректировках.ОсвобождатьАванс;
	КонецЕсли;
	
	ОбработатьСуммыДоКорректировки();
	СуммаДокумента = Запасы.Итог("Всего") + Расходы.Итог("Всего");
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Если НЕ ВключатьРасходыВСебестоимость Тогда
			
			Для Каждого СтрокаРасходы Из Расходы Цикл
				
				Если СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДоговорПоУмолчанию(ЭтотОбъект);
	
	ЗаполнитьСуммуРасходовБезНДС();
	
	// Прослеживаемость
	ПрослеживаемыйТовар = Запасы.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
	ЕстьПрослеживаемыйТовар = ПрослеживаемыйТовар.Количество() <> 0;
	Если ЕстьПрослеживаемыйТовар Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ПрослеживаемостьУНФ.ПодобратьРНПТКорректировка(ЭтотОбъект, Отказ);
		КонецЕсли; 
	Иначе
		СведенияПрослеживаемости.Очистить();
	КонецЕсли;
	// Конец Прослеживаемость
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантОсвобожденияАванса = Перечисления.ВариантыОсвобожденияАвансаВКорректировках.ОсвобождатьАванс
		И Предоплата.Количество() > 0 Тогда
		Предоплата.Очистить();
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение 
		ИЛИ НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "НомерИсправления");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ДатаИсправления");
	КонецЕсли;
	
	Если Запасы.Количество() > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("СтруктурнаяЕдиница");
	КонецЕсли;
	
	Если НЕ ВключатьРасходыВСебестоимость
		И ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		
		Для Каждого СтрокаРасходы Из Расходы Цикл
			
			Если Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
				И (СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Доходы
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы)
				И НЕ ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
				ТекстСообщения = СтрШаблон(НСтр(
					"ru = 'Для номенклатуры ""%1"" указанной в строке %2 списка ""Услуги"", должен быть заполнен реквизит ""Подразделение"".'"),
					СокрЛП(СтрокаРасходы.Номенклатура), СтрокаРасходы.НомерСтроки);
				КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Расходы", СтрокаРасходы.НомерСтроки,
					"СтруктурнаяЕдиница");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, КонтекстноеПоле, , Отказ);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Если (ВключатьРасходыВСебестоимость
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ДополнительныеРасходы"))
		И Запасы.Итог("СуммаРасходов") <> Расходы.Итог("Всего") Тогда
		
		ТекстСообщения = НСтр("ru = 'Сумма услуг не равна распределенной сумме по запасам.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , , Отказ);
		
	КонецЕсли;
	
	ТаблицаЗапасы = Запасы.Выгрузить(, "Заказ, Всего");
	ТаблицаЗапасы.Свернуть("Заказ", "Всего");
	
	ТаблицаРасходы = Расходы.Выгрузить(, "ЗаказПоставщику, Всего");
	ТаблицаРасходы.Свернуть("ЗаказПоставщику", "Всего");
	
	ТаблицаПредоплата = Предоплата.Выгрузить(, "Заказ, СуммаПлатежа");
	ТаблицаПредоплата.Свернуть("Заказ", "СуммаПлатежа");
	
	КоличествоЗапасыРасходы = Запасы.Количество() + Расходы.Количество();
	
	ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизитДоговор(ПроверяемыеРеквизиты, ЭтотОбъект);
	
	НоменклатураВДокументахСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, Отказ, Истина);
	
	ГрузовыеТаможенныеДекларацииСервер.ПриОбработкеПроверкиЗаполнения(Отказ, ЭтотОбъект);
	
	// Серии номенклатуры
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиница,"ОрдерныйСклад") = Истина Тогда
		// Для ордерного склада Серии номенклатуры не проверяем, они будут указаны в ордерном документе.

		СерииНоменклатурыУНФ.ПроверкаЗаполненияСерийНоменклатуры(Отказ, Запасы, СерииНоменклатуры, СтруктурнаяЕдиница, ЭтотОбъект);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад") Тогда
		
		ТаблицаОрдерныхСкладовПоВидамУчета = СкладскойУчетСервер.ТаблицаОрдерныхСкладовПоВидамУчета();
		
		Если ТаблицаОрдерныхСкладовПоВидамУчета.Количество() Тогда
			ПараметрыПоиска = Новый Структура("СтруктурнаяЕдиница, Приход");
			
			Для Каждого СтрокаТабличнойЧасти Из Запасы Цикл
				
				ПараметрыПоиска.СтруктурнаяЕдиница = СтрокаТабличнойЧасти.СтруктурнаяЕдиница;
				ПараметрыПоиска.Приход = Истина;
				
				НайденныеСтроки = ТаблицаОрдерныхСкладовПоВидамУчета.НайтиСтроки(ПараметрыПоиска);
				УчетОстатковПоСкладскимОрдерам = НайденныеСтроки.Количество();
				
				Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПоступления) И УчетОстатковПоСкладскимОрдерам Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Приходный ордер'"), СтрокаТабличнойЧасти.НомерСтроки, "Запасы");
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаТабличнойЧасти.НомерСтроки, "ДокументПоступления");
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	РасчетыПроведениеДокументов.УстановитьКурсИКратностьДляКорректировок(Ссылка, ДополнительныеСвойства);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад") Тогда
		МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам = СкладскойУчетСервер.МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам(Запасы.Выгрузить(,"СтруктурнаяЕдиница"));
	Иначе
		МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам = Новый Массив;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам", МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам);
	
	// Инициализация данных документа.
	Документы.КорректировкаПоступления.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ПроведениеДокументовУНФ.ОтразитьДвижения("Запасы", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыВРазрезеГТД", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("РазмещениеЗаказов", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("Закупки", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыНаСкладах", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыКПоступлениюНаСклады", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗаказыПоставщикам", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДоходыИРасходы", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДоходыИРасходыКассовыйМетод", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДоходыИРасходыНераспределенные", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДоходыИРасходыОтложенные", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("РасчетыСПоставщиками", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("СуммовойУчетВРознице", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗакупкиДляКУДиР", ТаблицыДляДвижений, Движения, Отказ);
	
	// Серии номенклатуры
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДвиженияСерииНоменклатуры", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("СерииНоменклатуры", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("СерииНоменклатурыКПоступлению", ТаблицыДляДвижений, Движения, Отказ);
	
	ПроведениеДокументовУНФ.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	
	// Взаиморасчеты
	ПроведениеДокументовУНФ.ОтразитьДвижения("ОплатаДокументов", ТаблицыДляДвижений, Движения, Отказ);
	// Конец Взаиморасчеты
	
	// Прослеживаемость
	УправлениеНебольшойФирмойСервер.ОтразитьПрослеживаемыеТовары(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ОперацииСПрослеживаемымиТоварами", ТаблицыДляДвижений, Движения, Отказ);
	// Конец Прослеживаемость
	//
	// НДС
	ПроведениеДокументовУНФ.ОтразитьДвижения("НДСЗаписиКнигиПродаж", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("НДСЗаписиКнигиПокупок", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("НДСПредъявленный", ТаблицыДляДвижений, Движения, Отказ);
    // НДС
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
	// Контроль возникновения отрицательного остатка.
	Документы.КорректировкаПоступления.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	// Запись цен в регистр сведений Цены номенклатуры контрагентов.
	Документы.КорректировкаПоступления.ЗарегистрироватьЦеныПоставщика(Ссылка);
	
	ПроведениеДокументовУНФ.ЗакрытьМенеджерВременныхТаблиц(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад") Тогда
		МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам = СкладскойУчетСервер.МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам(Запасы.Выгрузить(,"СтруктурнаяЕдиница"));
	Иначе
		МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам = Новый Массив;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам", МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам);
	
	// Контроль возникновения отрицательного остатка.
	Документы.КорректировкаПоступления.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	// Удаление цен из регистра сведений Цены номенклатуры контрагентов.
	Документы.КорректировкаПоступления.УдалитьЦеныПоставщика(Ссылка);
	
	// Подчиненный счет-фактура (полученный)
	Если НЕ Отказ Тогда
		
		КонтрольПодчиненногоСчетаФактуры();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заполнение

// АПК:299-выкл вызывается из внешней процедуры
Процедура ЗаполнитьПредоплату() Экспорт
	
	Если ВариантОсвобожденияАванса = Перечисления.ВариантыОсвобожденияАвансаВКорректировках.ОсвобождатьАванс Тогда
		Возврат;
	КонецЕсли;
	
	Компания = Константы.УчетПоКомпании.Компания(Организация);
	
	// Подготовка таблицы заказов.
	ТаблицаЗаказов = Запасы.Выгрузить(, "Заказ, Всего");
	ТаблицаЗаказов.Колонки.Добавить("ВсегоРасч");
	Для Каждого ТекСтрока Из Расходы Цикл
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.Заказ = ТекСтрока.ЗаказПоставщику;
		НоваяСтрока.Всего = ТекСтрока.Всего;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТаблицаЗаказов Цикл
		Если НЕ Контрагент.ВестиРасчетыПоЗаказам Тогда
			ТекСтрока.Заказ = Документы.ЗаказПоставщику.ПустаяСсылка();
		Иначе
			ТекСтрока.Заказ = ?(ТекСтрока.Заказ = Неопределено, Документы.ЗаказПоставщику.ПустаяСсылка(), ТекСтрока.Заказ);
		КонецЕсли;
		ТекСтрока.ВсегоРасч = ЦенообразованиеСервер.ПересчитатьИзВалютыВВалюту(
		ТекСтрока.Всего,
		?(Договор.ВалютаРасчетов = ВалютаДокумента, Курс, 1),
		Курс,
		?(Договор.ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
		Кратность);
	КонецЦикла;
	ТаблицаЗаказов.Свернуть("Заказ", "Всего, ВсегоРасч");
	ТаблицаЗаказов.Сортировать("Заказ Возр");
	
	// Заполнение расшифровки предоплаты.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщикамиОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И Договор = &Договор
	|					И Заказ В (&Заказ)
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ.Дата,
	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПоставщиками.Договор = &Договор
	|		И ДвиженияДокументаРасчетыСПоставщиками.Заказ В(&Заказ)
	|		И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата,
	|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета) КАК СуммаУчета,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета / ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ) * (РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКурс / РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКратность) КАК Курс,
	|	1 КАК Кратность,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКурс КАК КурсыВалютыДокументаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКратность КАК КурсыВалютыДокументаКратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * &КратностьВалютыДокумента / (&КурсВалютыДокумента * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
	|		КурсыВалютыУчета.Курс КАК КурсыВалютыУчетаКурс,
	|		КурсыВалютыУчета.Кратность КАК КурсыВалютыУчетаКратность,
	|		&КурсВалютыДокумента КАК КурсыВалютыДокументаКурс,
	|		&КратностьВалютыДокумента КАК КурсыВалютыДокументаКратность
	|	ИЗ
	|		ВременнаяТаблицаРасчетыСПоставщикамиОстатки КАК РасчетыСПоставщикамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|			ПО (ИСТИНА)) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата,
	|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКратность,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКратность
	|
	|ИМЕЮЩИЕ
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата");
	
	Запрос.УстановитьПараметр("Заказ", ТаблицаЗаказов.ВыгрузитьКолонку("Заказ"));
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Если Договор.ВалютаРасчетов = ВалютаДокумента Тогда
		Запрос.УстановитьПараметр("КурсВалютыДокумента", Курс);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", Кратность);
	Иначе
		Запрос.УстановитьПараметр("КурсВалютыДокумента", 1);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", 1);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Предоплата.Очистить();
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		
		НайденнаяСтрока = ТаблицаЗаказов.Найти(ВыборкаРезультатаЗапроса.Заказ, "Заказ");
		
		Если НайденнаяСтрока.ВсегоРасч = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаРезультатаЗапроса.СуммаРасчетов <= НайденнаяСтрока.ВсегоРасч Тогда // сумма остатка меньше или равна чем осталось распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НайденнаяСтрока.ВсегоРасч = НайденнаяСтрока.ВсегоРасч - ВыборкаРезультатаЗапроса.СуммаРасчетов;
			
		Иначе // сумма остатка больше чем нужно распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НоваяСтрока.СуммаРасчетов = НайденнаяСтрока.ВсегоРасч;
			НоваяСтрока.СуммаПлатежа = ЦенообразованиеСервер.ПересчитатьИзВалютыВВалюту(
				НоваяСтрока.СуммаРасчетов,
				ВыборкаРезультатаЗапроса.Курс,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКурс,
				ВыборкаРезультатаЗапроса.Кратность,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКратность);
				
			НайденнаяСтрока.ВсегоРасч = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПредоплату()
// АПК:299-вкл

Процедура ЗаполнитьПоПоступлению(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоАктОРасхождениях = ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхождениях");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная")
		И ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Корректировку можно вводить только по операции ""Поступление от поставщика"".'"),
		ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	ВидОперацииЗаполнения = Неопределено;
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование")) Тогда
		ВидОперацииЗаполнения = ?(ДанныеЗаполнения.Свойство("ВидОперации"), ДанныеЗаполнения.ВидОперации, Неопределено);
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	Иначе
		ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
	
	ЗаполнитьСвойстваШапки(ВидОперацииЗаполнения);
	
	Запасы.Очистить();
	Расходы.Очистить();
	Предоплата.Очистить();
	
	Запрос = Новый Запрос;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяВидаДокумента", ДанныеЗаполнения.Метаданные().Имя);
	ПараметрыЗаполнения.Вставить("СпособЗачетаПредоплаты", Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную);
	ПараметрыЗаполнения.Вставить("ПриходнаяНакладнаяПоАкту", Неопределено);
	
	Если ЭтоАктОРасхождениях Тогда
		ОснованиеАкта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ДокументОснование");
		Если ЗначениеЗаполнено(ОснованиеАкта) И ТипЗнч(ОснованиеАкта) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			ПараметрыЗаполнения.ПриходнаяНакладнаяПоАкту = ОснованиеАкта;
			ПараметрыЗаполнения.СпособЗачетаПредоплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеАкта, "СпособЗачетаПредоплаты");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ПараметрыЗаполнения.СпособЗачетаПредоплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СпособЗачетаПредоплаты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса(ПараметрыЗаполнения);
	
	Если ЭтоАктОРасхождениях Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриходнаяНакладная.СведенияПрослеживаемости", "Документ.АктОРасхождениях.СведенияПрослеживаемости");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ПоставщикРезидентТаможенногоСоюза", Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(ДанныеЗаполнения.Контрагент));
	Запрос.УстановитьПараметр("ПриходнаяНакладнаяПоАкту", ПараметрыЗаполнения.ПриходнаяНакладнаяПоАкту);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = МассивРезультатов[0].Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка,,"ДокументОснование");
	
	ВыборкаЗапасы = МассивРезультатов[1].Выбрать();
	Пока ВыборкаЗапасы.Следующий() Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапасы);
		
	КонецЦикла;
	
	ВыборкаРасходы = МассивРезультатов[2].Выбрать();
	Пока ВыборкаРасходы.Следующий() Цикл
		
		НоваяСтрока = Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
		
	КонецЦикла;
	
	ВыборкаПрослеживаемость = МассивРезультатов[3].Выбрать();
	Пока ВыборкаПрослеживаемость.Следующий() Цикл
		
		НоваяСтрока = СведенияПрослеживаемости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПрослеживаемость);
		
	КонецЦикла;
	
	Если НЕ ЭтоАктОРасхождениях ИЛИ (ЭтоАктОРасхождениях И ЗначениеЗаполнено(ПараметрыЗаполнения.ПриходнаяНакладнаяПоАкту)) Тогда
		
		ВыборкаПредоплата = МассивРезультатов[4].Выбрать();
		Пока ВыборкаПредоплата.Следующий() Цикл
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПредоплата);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И НЕ ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И Не ДанныеЗаполнения.Метаданные().ТабличныеЧасти.Найти("СерииНоменклатуры") = Неопределено Тогда
		
		СерииНоменклатуры.Очистить();
		ПеренестиСерииНоменклатуры(ДанныеЗаполнения.СерииНоменклатуры, ДанныеЗаполнения.Запасы);
		
		Если Не ДанныеЗаполнения.Метаданные().ТабличныеЧасти.Найти("СерииНоменклатурыДоКорректировки") = Неопределено Тогда
			СерииНоменклатурыДоКорректировки.Очистить();
			ПеренестиСерииНоменклатуры(ДанныеЗаполнения.СерииНоменклатурыДоКорректировки, ДанныеЗаполнения.Запасы, Истина);
		Иначе
			СерииНоменклатурыДоКорректировки.Очистить();
			ПеренестиСерииНоменклатуры(ДанныеЗаполнения.СерииНоменклатуры, ДанныеЗаполнения.Запасы, Истина);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, "Проект") Тогда
		Проект = ДокументОснование.Проект;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиСерииНоменклатуры(ТаблицаСерииНоменклатурыДокумента, ТаблицаЗапасыДокумента, СерииДоКорректировки = Ложь)
	
	Если Не ТаблицаСерииНоменклатурыДокумента.Количество() Тогда
		Возврат
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Партия");
	СтруктураПоискаКлючСвязи = Новый Структура("КлючСвязи");
	
	ТаблицаСтрокЗапасовССериями = Новый ТаблицаЗначений;
	ТаблицаСтрокЗапасовССериями.Колонки.Добавить("КлючСвязи");
	
	Для Каждого СтрокаСерийДокумента Из ТаблицаСерииНоменклатурыДокумента Цикл
		
		СтруктураПоискаКлючСвязи.КлючСвязи = СтрокаСерийДокумента.КлючСвязи;
		
		НайденныеСтрокиЗапасыДокументаОснования = ТаблицаЗапасыДокумента.НайтиСтроки(СтруктураПоискаКлючСвязи);
		
		Если Не НайденныеСтрокиЗапасыДокументаОснования.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрока = НайденныеСтрокиЗапасыДокументаОснования[0];
		
		СтруктураПоиска.Номенклатура = НайденнаяСтрока.Номенклатура;
		СтруктураПоиска.Характеристика = НайденнаяСтрока.Характеристика;
		СтруктураПоиска.Партия = НайденнаяСтрока.Партия;
		
		НайденныеСтрокиЗапасы = Запасы.НайтиСтроки(СтруктураПоиска);
		
		Если Не НайденныеСтрокиЗапасы.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЗапасовССериями = ТаблицаСтрокЗапасовССериями.Добавить();
		СтрокаЗапасовССериями.КлючСвязи = НайденныеСтрокиЗапасы[0].КлючСвязи;
		
		Если СерииДоКорректировки Тогда
			НоваяСтрокаСерии = СерииНоменклатурыДоКорректировки.Добавить();
		Иначе
			НоваяСтрокаСерии = СерииНоменклатуры.Добавить();
		КонецЕсли;
	
		НоваяСтрокаСерии.КлючСвязи = НайденныеСтрокиЗапасы[0].КлючСвязи;
		НоваяСтрокаСерии.Количество = СтрокаСерийДокумента.Количество;
		НоваяСтрокаСерии.Серия = СтрокаСерийДокумента.Серия;
		
	КонецЦикла;
	
	ТаблицаСтрокЗапасовССериями.Свернуть("КлючСвязи");
	
	// Заполним строковое представление серий
	
	Для Каждого СтрокаТаблицыЗапасовССериями Из ТаблицаСтрокЗапасовССериями Цикл
		
		СтроковоеПредставлениеСерийНоменклатуры = "";
		СтруктураПоискаКлючСвязи.КлючСвязи = СтрокаТаблицыЗапасовССериями.КлючСвязи;
		
		Если СерииДоКорректировки Тогда
			НайденныеСтрокиСерии = СерииНоменклатурыДоКорректировки.НайтиСтроки(СтруктураПоискаКлючСвязи);
		Иначе
			НайденныеСтрокиСерии = СерииНоменклатуры.НайтиСтроки(СтруктураПоискаКлючСвязи);
		КонецЕсли;
		
		Если Не НайденныеСтрокиСерии.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаСерий Из НайденныеСтрокиСерии Цикл
			
			СтроковоеПредставлениеСерийНоменклатуры = СтроковоеПредставлениеСерийНоменклатуры + СтрокаСерий.Серия+"; ";
			
		КонецЦикла;
		
		СтроковоеПредставлениеСерийНоменклатуры = Лев(СтроковоеПредставлениеСерийНоменклатуры, Мин(СтрДлина(СтроковоеПредставлениеСерийНоменклатуры)-2,150));
		
		НайденныеСтрокиЗапасы = Запасы.НайтиСтроки(СтруктураПоискаКлючСвязи);
		
		Если Не НайденныеСтрокиЗапасы.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Если СерииДоКорректировки Тогда
			НайденныеСтрокиЗапасы[0].СерииНоменклатурыДоКорректировки = СтроковоеПредставлениеСерийНоменклатуры;
		Иначе
			НайденныеСтрокиЗапасы[0].СерииНоменклатуры = СтроковоеПредставлениеСерийНоменклатуры;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ТекстЗапроса(ПараметрыЗаполнения)
	
	ЭтоАктОРасхождениях = ПараметрыЗаполнения.ИмяВидаДокумента = "АктОРасхождениях";
	
	Результат =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК ДокументОснование,
	|	ПриходнаяНакладная.Организация КАК Организация,
	|	ПриходнаяНакладная.Контрагент КАК Контрагент,
	|	ПриходнаяНакладная.Договор КАК Договор,
	|	ПриходнаяНакладная.Заказ КАК Заказ,
	|	ПриходнаяНакладная.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладная.Ячейка КАК Ячейка,
	|	ПриходнаяНакладная.ВключатьРасходыВСебестоимость КАК ВключатьРасходыВСебестоимость,
	|	ПриходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
	|	ПриходнаяНакладная.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ПриходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПриходнаяНакладная.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ПриходнаяНакладная.Курс КАК Курс,
	|	ПриходнаяНакладная.Кратность КАК Кратность,
	|	ПриходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
	|	ПриходнаяНакладная.ВидЦенКонтрагента КАК ВидЦенКонтрагента,
	|	ПриходнаяНакладная.РегистрироватьЦеныПоставщика КАК РегистрироватьЦеныПоставщика,
	|	ПриходнаяНакладная.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПриходнаяНакладная.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПриходнаяНакладная.Подразделение КАК Подразделение,
	|	ПриходнаяНакладная.Ответственный КАК Ответственный,
	|	ПриходнаяНакладная.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПриходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	ПриходнаяНакладнаяЗапасы.Партия КАК Партия,
	|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	ПриходнаяНакладнаяЗапасы.Сумма КАК Сумма,
	|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ПриходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ПриходнаяНакладнаяЗапасы.Заказ КАК Заказ,
	|	ПриходнаяНакладнаяЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПриходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	ПриходнаяНакладнаяЗапасы.Себестоимость КАК Себестоимость,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходов КАК СуммаРасходов,
	|	ПриходнаяНакладнаяЗапасы.Содержание КАК Содержание,
	|	ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяЗапасы.Ячейка КАК Ячейка,
	|	ПриходнаяНакладнаяЗапасы.Количество КАК КоличествоДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.Цена КАК ЦенаДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.Сумма КАК СуммаДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДСДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.Всего КАК ВсегоДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходов КАК СуммаРасходовДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.НомерСтроки КАК КлючСвязи,
	|	ПриходнаяНакладнаяЗапасы.Содержание КАК СодержаниеДоИзменения,
	|	ИСТИНА КАК ЕстьВДокументеПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяНакладнаяЗапасы.Ссылка) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.ТоварыДляПроизводства
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТоварыДляПроизводства,
	|	ПриходнаяНакладнаяЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ПриходнаяНакладнаяЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	ПриходнаяНакладнаяЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПриходнаяНакладнаяЗапасы.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяРасходы.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяРасходы.Количество КАК Количество,
	|	ПриходнаяНакладнаяРасходы.Цена КАК Цена,
	|	ПриходнаяНакладнаяРасходы.Сумма КАК Сумма,
	|	ПриходнаяНакладнаяРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ПриходнаяНакладнаяРасходы.СуммаНДС КАК СуммаНДС,
	|	ПриходнаяНакладнаяРасходы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ПриходнаяНакладнаяРасходы.Всего КАК Всего,
	|	ПриходнаяНакладнаяРасходы.Заказ КАК Заказ,
	|	ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПриходнаяНакладнаяРасходы.Содержание КАК Содержание,
	|	ПриходнаяНакладнаяРасходы.Количество КАК КоличествоДоИзменения,
	|	ПриходнаяНакладнаяРасходы.Цена КАК ЦенаДоИзменения,
	|	ПриходнаяНакладнаяРасходы.Сумма КАК СуммаДоИзменения,
	|	ПриходнаяНакладнаяРасходы.СтавкаНДС КАК СтавкаНДСДоИзменения,
	|	ПриходнаяНакладнаяРасходы.СуммаНДС КАК СуммаНДСДоИзменения,
	|	ПриходнаяНакладнаяРасходы.Всего КАК ВсегоДоИзменения,
	|	ПриходнаяНакладнаяРасходы.Содержание КАК СодержаниеДоИзменения,
	|	ПриходнаяНакладнаяРасходы.НомерСтроки КАК КлючСвязи,
	|	ИСТИНА КАК ЕстьВДокументеПоступления
	|ИЗ
	|	Документ.ПриходнаяНакладная.Расходы КАК ПриходнаяНакладнаяРасходы
	|ГДЕ
	|	ПриходнаяНакладнаяРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.Количество КАК Количество,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.Сумма КАК Сумма,
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	Документ.ПриходнаяНакладная.СведенияПрослеживаемости КАК ПриходнаяНакладнаяСведенияПрослеживаемости
	|ГДЕ
	|	ПриходнаяНакладнаяСведенияПрослеживаемости.Ссылка = &Ссылка";
	
	Если НЕ ЭтоАктОРасхождениях ИЛИ (ЭтоАктОРасхождениях И ЗначениеЗаполнено(ПараметрыЗаполнения.ПриходнаяНакладнаяПоАкту)) Тогда
		Если ПараметрыЗаполнения.СпособЗачетаПредоплаты = Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную Тогда
			Результат = Результат + "
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПриходнаяНакладнаяПредоплата.Документ КАК Документ,
			|	ПриходнаяНакладнаяПредоплата.Заказ КАК Заказ,
			|	ПриходнаяНакладнаяПредоплата.СуммаРасчетов КАК СуммаРасчетов,
			|	ПриходнаяНакладнаяПредоплата.Курс КАК Курс,
			|	ПриходнаяНакладнаяПредоплата.Кратность КАК Кратность,
			|	ПриходнаяНакладнаяПредоплата.СуммаПлатежа КАК СуммаПлатежа,
			|	ПриходнаяНакладнаяПредоплата.СуммаРасчетов КАК СуммаРасчетовДоИзменения,
			|	ПриходнаяНакладнаяПредоплата.СуммаПлатежа КАК СуммаПлатежаДоИзменения,
			|	ИСТИНА КАК ЕстьВДокументеПоступления
			|ИЗ
			|	Документ.ПриходнаяНакладная.Предоплата КАК ПриходнаяНакладнаяПредоплата
			|ГДЕ
			|	ПриходнаяНакладнаяПредоплата.Ссылка = &Ссылка";
		Иначе
			Результат = Результат + "
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПриходнаяНакладнаяПредоплата.Документ КАК Документ,
			|	ПриходнаяНакладнаяПредоплата.Заказ КАК Заказ,
			|	ПриходнаяНакладнаяПредоплата.СуммаВал КАК СуммаРасчетов,
			|	ПриходнаяНакладнаяПредоплата.Курс КАК Курс,
			|	ПриходнаяНакладнаяПредоплата.Кратность КАК Кратность,
			|	ПриходнаяНакладнаяПредоплата.Сумма КАК СуммаПлатежа,
			|	ПриходнаяНакладнаяПредоплата.СуммаВал КАК СуммаРасчетовДоИзменения,
			|	ПриходнаяНакладнаяПредоплата.Сумма КАК СуммаПлатежаДоИзменения,
			|	ИСТИНА КАК ЕстьВДокументеПоступления
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками КАК ПриходнаяНакладнаяПредоплата
			|ГДЕ
			|	ПриходнаяНакладнаяПредоплата.Регистратор = &Ссылка
			|	И ПриходнаяНакладнаяПредоплата.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И ПриходнаяНакладнаяПредоплата.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)";
		КонецЕсли;
		
		Если ЭтоАктОРасхождениях Тогда
			Результат = СтрЗаменить(Результат, "ПриходнаяНакладнаяПредоплата.Ссылка = &Ссылка", "ПриходнаяНакладнаяПредоплата.Ссылка = &ПриходнаяНакладнаяПоАкту");
			Результат = СтрЗаменить(Результат, "ПриходнаяНакладнаяПредоплата.Регистратор = &Ссылка", "ПриходнаяНакладнаяПредоплата.Регистратор = &ПриходнаяНакладнаяПоАкту");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат,
	"Документ.ПриходнаяНакладная КАК ПриходнаяНакладная",
	СтрШаблон("Документ.%1 КАК ПриходнаяНакладная", ПараметрыЗаполнения.ИмяВидаДокумента));
	
	Результат = СтрЗаменить(Результат,
	"Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы",
	СтрШаблон("Документ.%1.Запасы КАК ПриходнаяНакладнаяЗапасы", ПараметрыЗаполнения.ИмяВидаДокумента));
	
	Результат = СтрЗаменить(Результат,
	"Документ.ПриходнаяНакладная.Расходы КАК ПриходнаяНакладнаяРасходы",
	СтрШаблон("Документ.%1.Расходы КАК ПриходнаяНакладнаяРасходы", ПараметрыЗаполнения.ИмяВидаДокумента));
	
	
	Если Не ЭтоАктОРасхождениях Тогда
		Результат = СтрЗаменить(Результат,
		"Документ.ПриходнаяНакладная.Предоплата КАК ПриходнаяНакладнаяПредоплата",
		СтрШаблон("Документ.%1.Предоплата КАК ПриходнаяНакладнаяПредоплата", ПараметрыЗаполнения.ИмяВидаДокумента));
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ИмяВидаДокумента = "ПриходнаяНакладная" Тогда
		
		МодифицироватьТекстЗапросаПриходнаяНакладная(Результат);
		
	ИначеЕсли ПараметрыЗаполнения.ИмяВидаДокумента = "КорректировкаПоступления" ИЛИ ЭтоАктОРасхождениях Тогда
		
		МодифицироватьТекстЗапросаКорректировкаПоступления(Результат, ПараметрыЗаполнения);
		
		Если ЭтоАктОРасхождениях Тогда
			Результат = СтрЗаменить(Результат, "
			|	ПриходнаяНакладнаяЗапасы.Количество КАК КоличествоДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.Цена КАК ЦенаДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.Сумма КАК СуммаДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДСДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.Всего КАК ВсегоДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СуммаРасходов КАК СуммаРасходовДоИзменения,", "
			|	ПриходнаяНакладнаяЗапасы.КоличествоДоИзменения КАК КоличествоДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.ЦенаДоИзменения КАК ЦенаДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СуммаДоИзменения КАК СуммаДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.ВсегоДоИзменения КАК ВсегоДоИзменения,
			|	ПриходнаяНакладнаяЗапасы.СуммаРасходовДоИзменения КАК СуммаРасходовДоИзменения,");
			
			Результат = СтрЗаменить(Результат, "
			|	ПриходнаяНакладнаяРасходы.Количество КАК КоличествоДоИзменения,
			|	ПриходнаяНакладнаяРасходы.Цена КАК ЦенаДоИзменения,
			|	ПриходнаяНакладнаяРасходы.Сумма КАК СуммаДоИзменения,
			|	ПриходнаяНакладнаяРасходы.СтавкаНДС КАК СтавкаНДСДоИзменения,
			|	ПриходнаяНакладнаяРасходы.СуммаНДС КАК СуммаНДСДоИзменения,
			|	ПриходнаяНакладнаяРасходы.Всего КАК ВсегоДоИзменения,
			|	ПриходнаяНакладнаяРасходы.Содержание КАК СодержаниеДоИзменения,", "
			|	ПриходнаяНакладнаяРасходы.КоличествоДоИзменения КАК КоличествоДоИзменения,
			|	ПриходнаяНакладнаяРасходы.ЦенаДоИзменения КАК ЦенаДоИзменения,
			|	ПриходнаяНакладнаяРасходы.СуммаДоИзменения КАК СуммаДоИзменения,
			|	ПриходнаяНакладнаяРасходы.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
			|	ПриходнаяНакладнаяРасходы.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
			|	ПриходнаяНакладнаяРасходы.ВсегоДоИзменения КАК ВсегоДоИзменения,
			|	ПриходнаяНакладнаяРасходы.СодержаниеДоИзменения КАК СодержаниеДоИзменения,");
			
		КонецЕсли;
	Иначе
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Недопустимый вид документа: ""%1"".'"), ПараметрыЗаполнения.ИмяВидаДокумента);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура МодифицироватьТекстЗапросаПриходнаяНакладная(Результат)
	
	Результат = СтрЗаменить(Результат,
	"ПриходнаяНакладнаяЗапасы.Количество КАК Количество,",
	"ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ПроверятьРасхожденияСВходящимДокументом
	|			И ПриходнаяНакладнаяЗапасы.Ссылка.ПринятьПоКолонке = ЗНАЧЕНИЕ(Перечисление.ПринятьПоКолонке.КоличествоПоВходящемуДокументу)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.КоличествоСправочно
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Количество
	|	КОНЕЦ КАК Количество,");
	
	Результат = СтрЗаменить(Результат,
	"ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,",
	"ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,");
	
	Результат = СтрЗаменить(Результат,
	"ПриходнаяНакладнаяЗапасы.Ячейка КАК Ячейка,",
	"ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ячейка
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Ссылка.Ячейка
	|	КОНЕЦ КАК Ячейка,");
	
КонецПроцедуры

Процедура МодифицироватьТекстЗапросаКорректировкаПоступления(Результат, ПараметрыЗаполнения)
	
	Результат = СтрЗаменить(Результат,
	"	ПриходнаяНакладнаяЗапасы.Содержание КАК СодержаниеДоИзменения,",
	"	ПриходнаяНакладнаяЗапасы.Содержание КАК СодержаниеДоИзменения,
	|	ПриходнаяНакладнаяЗапасы.КоличествоДоКорректировки,
	|	ПриходнаяНакладнаяЗапасы.ЦенаДоКорректировки,
	|	ПриходнаяНакладнаяЗапасы.СуммаДоКорректировки,
	|	ПриходнаяНакладнаяЗапасы.СуммаНДСДоКорректировки,
	|	ПриходнаяНакладнаяЗапасы.ВсегоДоКорректировки,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходовДоКорректировки,");
	
	Результат = СтрЗаменить(Результат,
	"	ПриходнаяНакладнаяРасходы.Содержание КАК СодержаниеДоИзменения,",
	"	ПриходнаяНакладнаяРасходы.Содержание КАК СодержаниеДоИзменения,
	|	ПриходнаяНакладнаяРасходы.КоличествоДоКорректировки,
	|	ПриходнаяНакладнаяРасходы.ЦенаДоКорректировки,
	|	ПриходнаяНакладнаяРасходы.СуммаДоКорректировки,
	|	ПриходнаяНакладнаяРасходы.СуммаНДСДоКорректировки,
	|	ПриходнаяНакладнаяРасходы.ВсегоДоКорректировки,");
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ПриходнаяНакладнаяПоАкту) Тогда
		Результат = СтрЗаменить(Результат,
		"	ПриходнаяНакладнаяПредоплата.СуммаПлатежа КАК СуммаПлатежаДоИзменения,",
		"	ПриходнаяНакладнаяПредоплата.СуммаПлатежа КАК СуммаПлатежаДоИзменения,
		|	ПриходнаяНакладнаяПредоплата.СуммаРасчетовДоКорректировки,
		|	ПриходнаяНакладнаяПредоплата.СуммаПлатежаДоКорректировки,");
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоДопРасходам(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	ВидОперацииЗаполнения = Неопределено;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		ВидОперацииЗаполнения = ?(ДанныеЗаполнения.Свойство("ВидОперации"), ДанныеЗаполнения.ВидОперации, Неопределено);
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	Иначе
		ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
	
	ЗаполнитьСвойстваШапки(ВидОперацииЗаполнения);
	
	Запасы.Очистить();
	Расходы.Очистить();
	Предоплата.Очистить();
	
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРасходы.Ссылка КАК ДокументОснование,
	|	ДополнительныеРасходы.Организация,
	|	ДополнительныеРасходы.Контрагент,
	|	ДополнительныеРасходы.Договор,
	|	ДополнительныеРасходы.ЗаказПоставщику КАК Заказ,
	|	ДополнительныеРасходы.СтруктурнаяЕдиница,
	|	ДополнительныеРасходы.ВалютаДокумента,
	|	ДополнительныеРасходы.НалогообложениеНДС,
	|	ДополнительныеРасходы.СуммаВключаетНДС,
	|	ДополнительныеРасходы.НДСВключатьВСтоимость,
	|	ДополнительныеРасходы.Курс,
	|	ДополнительныеРасходы.Кратность,
	|	ДополнительныеРасходы.СуммаДокумента,
	|	ДополнительныеРасходы.НомерВходящегоДокумента,
	|	ДополнительныеРасходы.ДатаВходящегоДокумента,
	|	ДополнительныеРасходы.Подразделение,
	|	ДополнительныеРасходы.Ответственный,
	|	ИСТИНА КАК ВключатьРасходыВСебестоимость
	|ИЗ
	|	Документ.ДополнительныеРасходы КАК ДополнительныеРасходы
	|ГДЕ
	|	ДополнительныеРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРасходыЗапасы.Номенклатура,
	|	ДополнительныеРасходыЗапасы.Характеристика,
	|	ДополнительныеРасходыЗапасы.Партия,
	|	ДополнительныеРасходыЗапасы.ЕдиницаИзмерения,
	|	ДополнительныеРасходыЗапасы.Количество,
	|	ДополнительныеРасходыЗапасы.Цена,
	|	ДополнительныеРасходыЗапасы.Сумма,
	|	ДополнительныеРасходыЗапасы.СтавкаНДС,
	|	ДополнительныеРасходыЗапасы.СуммаНДС,
	|	ДополнительныеРасходыЗапасы.ЗаказПокупателя КАК Заказ,
	|	ДополнительныеРасходыЗапасы.Всего,
	|	ДополнительныеРасходыЗапасы.СуммаРасходов,
	|	ДополнительныеРасходыЗапасы.Количество КАК КоличествоДоИзменения,
	|	ДополнительныеРасходыЗапасы.Цена КАК ЦенаДоИзменения,
	|	ДополнительныеРасходыЗапасы.Сумма КАК СуммаДоИзменения,
	|	ДополнительныеРасходыЗапасы.СтавкаНДС КАК СтавкаНДСДоИзменения,
	|	ДополнительныеРасходыЗапасы.СуммаНДС КАК СуммаНДСДоИзменения,
	|	ДополнительныеРасходыЗапасы.Всего КАК ВсегоДоИзменения,
	|	ДополнительныеРасходыЗапасы.СуммаРасходов КАК СуммаРасходовДоИзменения,
	|	ИСТИНА КАК ЕстьВДокументеПоступления
	|ИЗ
	|	Документ.ДополнительныеРасходы.Запасы КАК ДополнительныеРасходыЗапасы
	|ГДЕ
	|	ДополнительныеРасходыЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРасходыРасходы.Номенклатура,
	|	ДополнительныеРасходыРасходы.ЕдиницаИзмерения,
	|	ДополнительныеРасходыРасходы.Количество,
	|	ДополнительныеРасходыРасходы.Цена,
	|	ДополнительныеРасходыРасходы.Сумма,
	|	ДополнительныеРасходыРасходы.СтавкаНДС,
	|	ДополнительныеРасходыРасходы.СуммаНДС,
	|	ДополнительныеРасходыРасходы.Всего,
	|	ДополнительныеРасходыРасходы.Количество КАК КоличествоДоИзменения,
	|	ДополнительныеРасходыРасходы.Цена КАК ЦенаДоИзменения,
	|	ДополнительныеРасходыРасходы.Сумма КАК СуммаДоИзменения,
	|	ДополнительныеРасходыРасходы.СтавкаНДС КАК СтавкаНДСДоИзменения,
	|	ДополнительныеРасходыРасходы.СуммаНДС КАК СуммаНДСДоИзменения,
	|	ДополнительныеРасходыРасходы.Всего КАК ВсегоДоИзменения,
	|	ИСТИНА КАК ЕстьВДокументеПоступления
	|ИЗ
	|	Документ.ДополнительныеРасходы.Расходы КАК ДополнительныеРасходыРасходы
	|ГДЕ
	|	ДополнительныеРасходыРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРасходыПредоплата.Документ,
	|	ДополнительныеРасходыПредоплата.СуммаРасчетов,
	|	ДополнительныеРасходыПредоплата.Курс,
	|	ДополнительныеРасходыПредоплата.Кратность,
	|	ДополнительныеРасходыПредоплата.СуммаПлатежа,
	|	ДополнительныеРасходыПредоплата.СуммаРасчетов КАК СуммаРасчетовДоИзменения,
	|	ДополнительныеРасходыПредоплата.СуммаПлатежа КАК СуммаПлатежаДоИзменения,
	|	ИСТИНА КАК ЕстьВДокументеПоступления
	|ИЗ
	|	Документ.ДополнительныеРасходы.Предоплата КАК ДополнительныеРасходыПредоплата
	|ГДЕ
	|	ДополнительныеРасходыПредоплата.Ссылка = &Ссылка";

	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = МассивРезультатов[0].Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	
	ВыборкаЗапасы = МассивРезультатов[1].Выбрать();
	Пока ВыборкаЗапасы.Следующий() Цикл
	
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапасы);
	
	КонецЦикла;
	
	ВыборкаРасходы = МассивРезультатов[2].Выбрать();
	Пока ВыборкаРасходы.Следующий() Цикл
	
		НоваяСтрока = Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
	
	КонецЦикла;
	
	ВыборкаПредоплата = МассивРезультатов[3].Выбрать();
	Пока ВыборкаПредоплата.Следующий() Цикл
	
		НоваяСтрока = Предоплата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПредоплата);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваШапки(ВидОперацииЗаполнения = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИсправления = Документы.КорректировкаПоступления.СформироватьПараметрыИсправленияКорректировочногоДокумента(
		?(ВидОперацииЗаполнения <> Неопределено, ВидОперацииЗаполнения, ВидОперации), Дата, ДокументОснование);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыИсправления);

	ДокументПоступленияСсылка = Документы.КорректировкаПоступления.ПолучитьИсправляемыйДокументПоступления(ДокументОснование, Истина);
	
	Если НЕ ЗначениеЗаполнено(ДокументПоступленияСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	КорректировкаКорректировочногоСчетаФактуры = Ложь;
		
	Если ТипЗнч(Документы.КорректировкаПоступления.ПолучитьИсправляемыйДокументПоступления(ДокументОснование, Ложь)) = Тип("ДокументСсылка.КорректировкаПоступления") 
		И ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		КорректировкаКорректировочногоСчетаФактуры = Истина;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		Если КорректировкаКорректировочногоСчетаФактуры Тогда
			ИсправляемыйДокументПоступления = Документы.КорректировкаПоступления.ПолучитьИсправляемыйДокументПоступления(ДокументОснование, Ложь);
		Иначе	
			ИсправляемыйДокументПоступления = Документы.КорректировкаПоступления.ПолучитьИсправляемыйДокументПоступления(ДокументОснование, Истина);
		КонецЕсли;	
	Иначе
		ИсправляемыйДокументПоступления = Документы.КорректировкаПоступления.ПолучитьИсправляемыйДокументПоступления(ДокументОснование, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Распределяет затраты по количеству.
//
Процедура РаспределитьТабЧастьРасходыПоКоличеству() Экспорт
	
	ИсхСумма = 0;
	БазаРаспределенияКоличество = Запасы.Итог("Количество");
	ВсегоРасходы = Расходы.Итог("Всего");
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);
		БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаЗапасы.Количество;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		
	КонецЦикла;
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

// Распределяет затраты по сумме.
//
Процедура РаспределитьТабЧастьРасходыПоСумме() Экспорт
	
	ИсхСумма = 0;
	БазаРаспределенияСумма = Запасы.Итог("Всего");
	ВсегоРасходы = Расходы.Итог("Всего");
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);
		БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.Всего;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		
	КонецЦикла;
	
КонецПроцедуры

// Отменяет проведение подчиненного счета-фактуры (полученного)
//
Процедура КонтрольПодчиненногоСчетаФактуры()
	
	СтруктураСчетаФактуры = СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(Ссылка, Истина);
	Если СтруктураСчетаФактуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СчетФактура = СтруктураСчетаФактуры.Ссылка;
	Если Не СчетФактура.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеТекущегоДокумента = СтрШаблон(НСтр("ru = '""Приходная накладная № %1 от %2""'"),
		Номер, Формат(Дата, "ДЛФ=D"));
		
	ПредставлениеСчетФактуры = СтрШаблон(НСтр("ru = '""Счет-фактура (полученный) № %1 от %2""'"),
		СтруктураСчетаФактуры.Номер, Формат(СтруктураСчетаФактуры.Дата, "ДЛФ=D"));
		
	ТекстСообщения = СтрШаблон(НСтр("ru = 'В связи с отсутствием движений у документа %1 отменяется проведение %2.'"),
		ПредставлениеТекущегоДокумента, ПредставлениеСчетФактуры);
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Процедура ОбработатьСуммыДоКорректировки()
	
	ИсправлениеКорректировки = ЗначениеЗаполнено(ИсправляемыйДокументПоступления)
	И (ТипЗнч(ИсправляемыйДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления"))
	И (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
	ИсправляемыйДокументПоступления, "ВидОперации") = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение);
	
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		Запасы.ЗагрузитьКолонку(Запасы.ВыгрузитьКолонку("КоличествоДоИзменения"), "КоличествоДоКорректировки");
		Запасы.ЗагрузитьКолонку(Запасы.ВыгрузитьКолонку("ЦенаДоИзменения"), "ЦенаДоКорректировки");
		Запасы.ЗагрузитьКолонку(Запасы.ВыгрузитьКолонку("СуммаДоИзменения"), "СуммаДоКорректировки");
		Запасы.ЗагрузитьКолонку(Запасы.ВыгрузитьКолонку("СуммаНДСДоИзменения"), "СуммаНДСДоКорректировки");
		Запасы.ЗагрузитьКолонку(Запасы.ВыгрузитьКолонку("ВсегоДоИзменения"), "ВсегоДоКорректировки");
		
		Расходы.ЗагрузитьКолонку(Расходы.ВыгрузитьКолонку("КоличествоДоИзменения"), "КоличествоДоКорректировки");
		Расходы.ЗагрузитьКолонку(Расходы.ВыгрузитьКолонку("ЦенаДоИзменения"), "ЦенаДоКорректировки");
		Расходы.ЗагрузитьКолонку(Расходы.ВыгрузитьКолонку("СуммаДоИзменения"), "СуммаДоКорректировки");
		Расходы.ЗагрузитьКолонку(Расходы.ВыгрузитьКолонку("СуммаНДСДоИзменения"), "СуммаНДСДоКорректировки");
		Расходы.ЗагрузитьКолонку(Расходы.ВыгрузитьКолонку("ВсегоДоИзменения"), "ВсегоДоКорректировки");
		
		Предоплата.ЗагрузитьКолонку(Предоплата.ВыгрузитьКолонку("СуммаРасчетовДоИзменения"), "СуммаРасчетовДоКорректировки");
		Предоплата.ЗагрузитьКолонку(Предоплата.ВыгрузитьКолонку("СуммаПлатежаДоИзменения"), "СуммаПлатежаДоКорректировки");
		
	ИначеЕсли Не ИсправлениеКорректировки Тогда
		
		Для Каждого СтрокаТаблицы Из Запасы Цикл
			СтрокаТаблицы.КоличествоДоКорректировки = 0;
			СтрокаТаблицы.ЦенаДоКорректировки       = 0;
			СтрокаТаблицы.СуммаДоКорректировки      = 0;
			СтрокаТаблицы.СуммаНДСДоКорректировки   = 0;
			СтрокаТаблицы.ВсегоДоКорректировки      = 0;
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из Расходы Цикл
			СтрокаТаблицы.КоличествоДоКорректировки = 0;
			СтрокаТаблицы.ЦенаДоКорректировки       = 0;
			СтрокаТаблицы.СуммаДоКорректировки      = 0;
			СтрокаТаблицы.СуммаНДСДоКорректировки   = 0;
			СтрокаТаблицы.ВсегоДоКорректировки      = 0;
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из Предоплата Цикл
			СтрокаТаблицы.СуммаРасчетовДоКорректировки = 0;
			СтрокаТаблицы.СуммаПлатежаДоКорректировки  = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСуммуРасходовБезНДС()
	
	Если Расходы.Количество() > 0 Тогда
		
		ИсхСуммаРасходовБезНДС = 0;
		БазаРаспределенияСуммаРасхода = Запасы.Итог("СуммаРасходов");
		ВсегоРасходыБезНДС = Расходы.Итог("Всего") - Расходы.Итог("СуммаНДС");
		
		НОД = ПолучитьНОДДляМассива(Запасы.ВыгрузитьКолонку("Сумма"), 100);
		
		Если НОД <> 0 Тогда
			
			Для каждого СтрокаЗапасы Из Запасы Цикл
				
				СуммаРасходовБезНДС = ?(БазаРаспределенияСуммаРасхода <> 0,
					Окр((ВсегоРасходыБезНДС - ИсхСуммаРасходовБезНДС) * СтрокаЗапасы.СуммаРасходов / БазаРаспределенияСуммаРасхода, 2, 1),
					0);
				СтрокаЗапасы.СуммаРасходовБезНДС = СуммаРасходовБезНДС;
				БазаРаспределенияСуммаРасхода = БазаРаспределенияСуммаРасхода - СтрокаЗапасы.СуммаРасходов;
				ИсхСуммаРасходовБезНДС = ИсхСуммаРасходовБезНДС + СуммаРасходовБезНДС;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНОДДляМассива(МассивЧисел, Кратность)
	
	Если МассивЧисел.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	НОД = МассивЧисел[0] * Кратность;
	
	Для каждого Сч Из МассивЧисел Цикл
		НОД = ПолучитьНОД(НОД, Сч * Кратность);
	КонецЦикла;
	
	Возврат НОД;
	
КонецФункции

Функция ПолучитьНОД(ЧислоА, ЧислоБ)
	
	Возврат ?(ЧислоБ = 0, ЧислоА, ПолучитьНОД(ЧислоБ, ЧислоА % ЧислоБ));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли