#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ЕстьОшибки Тогда
		Элементы.СтраницаОшибка.Картинка = БиблиотекаКартинок.Остановить;
	КонецЕсли;
	
	Если Объект.ЗагруженныеДокументы.Количество() < 2 Тогда
		Элементы.ЗагруженныеДокументы.Видимость = Ложь;
		Элементы.ЗагруженныйДокумент.Видимость = Истина;
	Иначе
		Элементы.ЗагруженныеДокументы.Видимость = Истина;
		Элементы.ЗагруженныйДокумент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЗагруженныеДокументы

&НаКлиенте
Процедура ЗагруженныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.ТекущиеДанные.ЗагруженныйДокумент);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
