#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Контакт") И ДанныеЗаполнения.Свойство("КакСвязаться") Тогда
			Адресат = ДанныеЗаполнения.КакСвязаться;
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Контакт) И ТипЗнч(ДанныеЗаполнения.Контакт) = Тип("Строка") Тогда
				Наименование = ДанныеЗаполнения.Контакт;
			Иначе
				Наименование = ДанныеЗаполнения.КакСвязаться;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Адресат) Тогда
		Возврат;
	КонецЕсли;
	
	Адресат = НРег(Адресат);
	Код = ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(Адресат, 50);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли