#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Изменить состояние лида.
// 
// Параметры:
//  Лид - СправочникСсылка.Лиды - Лид
//  Состояние - СправочникСсылка.СостоянияЛидов - Состояние
//  ВариантЗавершения - Неопределено - Вариант завершения
//  ПричинаОтмены - Неопределено - Причина отмены
//  Заметки - Строка - Заметки
// 
Процедура ИзменитьСостояниеЛида(Лид, Состояние, ВариантЗавершения = Неопределено, ПричинаОтмены = Неопределено, Заметки = "") Экспорт
	
	ДанныеЛида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Лид, "СостояниеЛида,ВариантЗавершения");
	
	Если ДанныеЛида.СостояниеЛида = Состояние И Состояние <> Справочники.СостоянияЛидов.Завершен
		ИЛИ (ДанныеЛида.СостояниеЛида = Состояние И Состояние = Справочники.СостоянияЛидов.Завершен
		И (ЗначениеЗаполнено(ДанныеЛида.ВариантЗавершения) И ДанныеЛида.ВариантЗавершения = ВариантЗавершения)) Тогда
		Возврат;
	КонецЕсли;
	
	ЛидОбъект = Лид.ПолучитьОбъект();
	
	ЛидОбъект.Заблокировать();
	ЛидОбъект.СостояниеЛида = Состояние;
	
	Если ВариантЗавершения <> Неопределено Тогда
		ЛидОбъект.ВариантЗавершения = ВариантЗавершения;
	КонецЕсли;
	
	Если ПричинаОтмены <> Неопределено Тогда
		ЛидОбъект.ПричинаНеуспешногоЗавершенияРаботы = ПричинаОтмены;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заметки) Тогда
		ЛидОбъект.ЗаметкиЗавершенияРаботы = Заметки;
	КонецЕсли;
	
	Если Не ЛидОбъект.ПроверитьЗаполнение() Тогда
		ЛидОбъект.Разблокировать();
		Возврат;
	КонецЕсли;
	
	ЛидОбъект.Записать();
	
	ЛидОбъект.Разблокировать();

КонецПроцедуры

// Получатели электронного письма.
// 
// Параметры:
//  Лид - СправочникСсылка.Лиды - Лид
//  ВидКонтактнойИнформации - Неопределено, СправочникСсылка.ВидыКонтактнойИнформации  - Вид контактной информации
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получатели электронного письма:
//   * Контакт - ОпределяемыеТипы.КонтактСобытия
//   * КакСвязаться - Строка
//
//@skip-check doc-comment-type
Функция ПолучателиЭлектронногоПисьма(Лид, ВидКонтактнойИнформации = Неопределено) Экспорт
	
	ПолучателиЭлектронногоПисьма = Новый ТаблицаЗначений;
	ПолучателиЭлектронногоПисьма.Колонки.Добавить("Контакт", Метаданные.ОпределяемыеТипы.КонтактСобытия.Тип);
	ПолучателиЭлектронногоПисьма.Колонки.Добавить("КакСвязаться", Новый ОписаниеТипов("Строка"));
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Лид,
		ВидКонтактнойИнформации, ТекущаяДатаСеанса(), Ложь);
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		ОтборКонтактнойИнформации = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта.НайтиСтроки(ОтборКонтактнойИнформации);
	Иначе
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта;
	КонецЕсли;
	
	Для каждого Строка Из СтрокиКонтактнойИнформации Цикл
		НовыйПолучатель = ПолучателиЭлектронногоПисьма.Добавить();
		НовыйПолучатель.Контакт = Лид;
		НовыйПолучатель.КакСвязаться = Строка.Представление;
	КонецЦикла;
	
	Возврат ПолучателиЭлектронногоПисьма;
	
КонецФункции

// Получатели электронного письма.
// 
// Параметры:
//  Лид - СправочникСсылка.Лиды - Лид
//  ВидКонтактнойИнформации - Неопределено, СправочникСсылка.ВидыКонтактнойИнформации  - Вид контактной информации
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получатели электронного письма:
//   * Контакт - ОпределяемыеТипы.КонтактСобытия
//   * КакСвязаться - Строка
//
//@skip-check doc-comment-type
Функция ПолучателиСообщенияSMS(Лид, ВидКонтактнойИнформации = Неопределено) Экспорт
	
	ПолучателиСообщенияSMS = Новый ТаблицаЗначений;
	ПолучателиСообщенияSMS.Колонки.Добавить("Контакт", Метаданные.ОпределяемыеТипы.КонтактСобытия.Тип);
	ПолучателиСообщенияSMS.Колонки.Добавить("КакСвязаться", Новый ОписаниеТипов("Строка"));
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Лид,
		ВидКонтактнойИнформации, ТекущаяДатаСеанса(), Ложь);
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		ОтборКонтактнойИнформации = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта.НайтиСтроки(ОтборКонтактнойИнформации);
	Иначе
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта;
	КонецЕсли;
	
	Для каждого Строка Из СтрокиКонтактнойИнформации Цикл
		НовыйПолучатель = ПолучателиСообщенияSMS.Добавить();
		НовыйПолучатель.Контакт = Лид;
		НовыйПолучатель.КакСвязаться = Строка.Представление;
	КонецЦикла;
	
	Возврат ПолучателиСообщенияSMS;
	
КонецФункции

// Стандартные реквизиты для выбора полей при переводе лида в контрагента
//
// Возвращаемое значение:
//  - Соответствие из Строка - список реквизитов, Ключ - Имя реквизита, Значение - представление реквизита
//
Функция СтандартныеРеквизитыДляПереводаВПокупателя() Экспорт
	
	Реквизиты = Новый Соответствие;
	Реквизиты.Вставить("Наименование", НСтр("ru = 'Представление в программе'"));
	Реквизиты.Вставить("Комментарий", НСтр("ru = 'Дополнительная информация'"));
	Реквизиты.Вставить("НаименованиеКомпании", НСтр("ru = 'Юридическое название'"));
	Реквизиты.Вставить("ИсточникПривлечения", НСтр("ru = 'Источник'"));
	Реквизиты.Вставить("Тема", НСтр("ru = 'Тема'"));
	
	Возврат Реквизиты;
	
КонецФункции

// Перенос контактной информации контактов лида в служебный справочник
// Версия 1.6.20
// Удалить при удалении обработчика
// 
// Параметры:
//  ЛидОбъект - СправочникОбъект.Лиды - лид, по которому необходимо выполнить перенос
//
Процедура ПеренестиКонтактыЛидаВСправочникКонтактыЛидов(ЛидОбъект) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		ЛидОбъект.Заблокировать();
		НомераТелефонов = Новый Массив;
		АдресаЭП = Новый Массив;
		
		Для Каждого Контакт Из ЛидОбъект.УдалитьКонтакты Цикл
			
			НовыйКонтакт              = Справочники.КонтактыЛидов.СоздатьЭлемент();
			НовыйКонтакт.Владелец     = ЛидОбъект.Ссылка;
			НовыйКонтакт.Наименование = Контакт.Наименование;
			
			Отбор = Новый Структура("ИдентификаторСтрокиТабличнойЧасти", Контакт.ИдентификаторСтрокиТабличнойЧасти);
			КИКонтакта = ЛидОбъект.УдалитьКонтактнаяИнформация.НайтиСтроки(Отбор);
			
			Для Каждого КИ Из КИКонтакта Цикл
				
				НовоеКИ = НовыйКонтакт.КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеКИ, КИ,, "Вид");
				НовоеКИ.Вид = Справочники.КонтактыЛидов.ВидКИКонтактаПоВидуЛида(КИ.Вид);
				
				Если КИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					Если ЗначениеЗаполнено(КИ.НомерТелефона) Тогда
						НомераТелефонов.Добавить(КИ.НомерТелефона);
					Иначе
						НомераТелефонов.Добавить(КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(КИ.Представление));
					КонецЕсли;
				КонецЕсли;
				
				Если КИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					АдресаЭП.Добавить(КИ.Представление);
				КонецЕсли;
				
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйКонтакт);
			
		КонецЦикла;
		
		НомерТелефона         = СтрСоединить(НомераТелефонов, ", ");
		АдресЭП               = СтрСоединить(АдресаЭП, ",");
		ЛидОбъект.НомерТелефонаДляПоиска = НомерТелефона;
		ЛидОбъект.АдресЭПДляПоиска       = АдресЭП;
		
		ЛидОбъект.КонтактыПеренесены = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛидОбъект);
		ЛидОбъект.Разблокировать();

		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЛидОбъект.Ссылка);
		
	КонецПопытки;
	
КонецПроцедуры

// Возвращает вид контактной информации контактного лица по типу контактной информации.
//
// Параметры:
//  ТипКИЛида - ПеречислениеСсылка.ТипыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации
//  - Неопределено - если не удалось определить вид.
//
Функция ВидКИКонтактногоЛица(ТипКИЛида) Экспорт
	
	Если ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.МессенджерКонтактногоЛица;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.SkypeКонтактногоЛица;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.СоциальнаяСетьКонтактногоЛица;
	Иначе
		Возврат ВидКИКонтактногоЛицаЗапросом(ТипКИЛида);
	КонецЕсли;
	
КонецФункции

// Функция - Сведения о лиде для печати
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  ДатаПериода - Дата
// 
// Возвращаемое значение:
//  Структура - См. ПечатьДокументовУНФ.СведенияОЮрФизЛице
//
Функция СведенияОЛидеДляПечати(Лид, ДатаПериода) Экспорт
	
	ДанныеЛида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Лид, "Представление,Наименование,НаименованиеКомпании");
	Если ПустаяСтрока(ДанныеЛида.НаименованиеКомпании) Тогда
		ДанныеЛида.НаименованиеКомпании = ДанныеЛида.Наименование;
	КонецЕсли;
	
	Результат = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Лид, ДатаПериода);
	Результат.Представление = ДанныеЛида.Представление;
	Результат.ПолноеНаименование = ДанныеЛида.НаименованиеКомпании;
	Результат.СокращенноеНаименование = ДанныеЛида.Наименование;
	Результат.НаименованиеДляПечати = ДанныеЛида.НаименованиеКомпании;
	
	Результат.Телефоны = ПечатьДокументовУНФ.КонтактнаяИнформация(
	Лид, Справочники.ВидыКонтактнойИнформации.ТелефонКомпанииЛида, ДатаПериода);
	Результат.ЮридическийАдрес = ПечатьДокументовУНФ.КонтактнаяИнформация(
	Лид, Справочники.ВидыКонтактнойИнформации.ЮрАдресКомпанииЛида, ДатаПериода);
	Результат.ФактическийАдрес = ПечатьДокументовУНФ.КонтактнаяИнформация(
	Лид, Справочники.ВидыКонтактнойИнформации.ФактАдресКомпанииЛида, ДатаПериода);
	Результат.ЭлектроннаяПочта = ПечатьДокументовУНФ.КонтактнаяИнформация(
	Лид, Справочники.ВидыКонтактнойИнформации.EmailКомпанииЛида, ДатаПериода);
	
	Возврат Результат;
	
КонецФункции

#Область Контрагенты

// Контрагент, который был создан на основании лида.
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  Отбор - Неопределено, Структура - позволяет устанавливать дополнительный отбор по контрагентам:
//   * ПроверятьРЛС - Произвольный
// 
// Возвращаемое значение:
//   СправочникСсылка.Контрагенты
//
Функция СвязанныйКонтрагент(Лид, Отбор = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Лид) Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СвязиКонтрагентЛид.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|ГДЕ
		|	СвязиКонтрагентЛид.Лид = &Лид";
	
	Если Отбор.Свойство("ПроверятьРЛС") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Лид", Лид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьЗаписи = Выборка.Следующий();
	
	Если ЕстьЗаписи Тогда
		Возврат Выборка.Контрагент;
	Иначе
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Контрагенты, связанные с лидами
//
// Параметры:
//  Лиды - Массив из СправочникСсылка.Лиды
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.Лиды
//   * Значение - СправочникСсылка.Контрагенты
//
Функция СвязанныеКонтрагенты(Лиды) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Лиды) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязиКонтрагентЛид.Лид КАК Лид,
	|	СвязиКонтрагентЛид.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
	|ГДЕ
	|	СвязиКонтрагентЛид.Лид В(&Лиды)";
	
	Запрос.УстановитьПараметр("Лиды", Лиды);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.Лид] = Выборка.Контрагент;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает контрагента на основании лида, если контрагент еще не был создан. 
// Если лид уже связан с контрагентом, то возвращает ссылку на связанного контрагента
//
// Параметры:
//  Лид - СправочникСсылка.Лиды, СправочникОбъект.Лиды - лид, для которого нужно получить/создать контрагента
// 
// Возвращаемое значение:
//   - СправочникСсылка.Контрагенты
//
Функция ПолучитьСоздатьКонтрагента(Лид) Экспорт
	
	Если ТипЗнч(Лид) = Тип("СправочникСсылка.Лиды") Тогда
		ЛидОбъект = Лид.ПолучитьОбъект();
	Иначе
		ЛидОбъект = Лид;
	КонецЕсли;
	
	ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияСвойств = Истина;
	
	СвязанныйКонтрагент = СвязанныйКонтрагент(ЛидОбъект.Ссылка);
	КонтрагентУжеСоздан = ЗначениеЗаполнено(СвязанныйКонтрагент);
	
	Если КонтрагентУжеСоздан Тогда
		Возврат СвязанныйКонтрагент;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		НовыйКонтрагент = СоздатьКонтрагентаИИзменитьЛида(ЛидОбъект);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Возврат НовыйКонтрагент;
	
КонецФункции

// Перевод лид в нового покупателя без проверок.
//
// Параметры:
//  Лид - СправочникСсылка.Лиды - лид для перевода.
// 
// Возвращаемое значение:
//  - СправочникСсылка.Контрагенты - новый созданный контрагент.
//  - Неопределено - если не получилось перевести лида.
//
Функция ПеревестиЛидаВПокупателя(Лид) Экспорт
	
	Если ТипЗнч(Лид) = Тип("СправочникСсылка.Лиды") Тогда
		ЛидОбъект = Лид.ПолучитьОбъект();
	Иначе
		ЛидОбъект = Лид;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		РегистрыСведений.СвязиКонтрагентЛид.УдалитьСвязи(ЛидОбъект.Ссылка);
		НовыйКонтрагент = СоздатьКонтрагентаИИзменитьЛида(ЛидОбъект);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Возврат НовыйКонтрагент;
	
КонецФункции

// Возвращает вид контактной информации контрагента по типу и виду контактной информации.
//
// Параметры:
//  ТипКИЛида - ПеречислениеСсылка.ТипыКонтактнойИнформации.
//  ВидКИЛида - СправочникСсылка.ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации
//  - Неопределено - если не удалось определить вид.
//
Функция ВидКИКонтрагента(ТипКИЛида, ВидКИЛида) Экспорт
	
	Если ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.SkypeКонтрагента;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.ВебСайтКонтрагента;
	ИначеЕсли ТипКИЛида = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		
		Если ВидКИЛида = Справочники.ВидыКонтактнойИнформации.ЮрАдресКомпанииЛида Тогда
			Возврат Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		ИначеЕсли ВидКИЛида = Справочники.ВидыКонтактнойИнформации.ФактАдресКомпанииЛида Тогда
			Возврат Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		Иначе
			Возврат ВидКИКонтрагентаЗапросом(ТипКИЛида);
		КонецЕсли;
		
	Иначе
		Возврат ВидКИКонтрагентаЗапросом(ТипКИЛида);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// В программе появились виды лидов: "первичное" и "повторное" обращение.
// Ранее логически были только первичные обращения (первичные лиды).
// Нужно заполнить старых лидов, чтобы они считались первичными с учетом новой функциональности.
// Версия 3.0.9
//
// Параметры:
//  Параметры - См. ОбновлениеИнформационнойБазыУНФ.ПриДобавленииОбработчиковОбновления
//
Процедура ЗаполнитьЛидовПриПоявленииПовторныхЛидов(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Лиды.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ссылка) КАК Представление
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|ГДЕ
		|	Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПустаяСсылка)
		|	И НЕ Лиды.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		ТекстСообщения = НСтр(
		"ru='Процедура ЗаполнитьЛидовПриПоявленииПовторныхЛидов завершила обработку. Запрос вернул пустую порцию объектов.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ЛидОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ЛидОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Возврат;
			КонецЕсли;
			
			ЛидОбъект.Заблокировать();
			ЛидОбъект.Вид = Перечисления.ВидыЛидов.ПервичноеОбращение;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛидОбъект);
			
			ЗафиксироватьТранзакцию();
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Представление, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.Лиды,
			Выборка.Ссылка,
			ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура ЗаполнитьЛидовПриПоявленииПовторныхЛидов обработала очередную порцию объектов: %1'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано);
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Процедуре ЗаполнитьЛидовПриПоявленииПовторныхЛидов не удалось обработать некоторые объекты (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

// Качественные и некачественные (завершенные) лиды теперь отображаются в канбане лидов.
// Необходимо добавить существующих завершенных лидов в регистр КанбанЛидов
// Версия 3.0.9
//
// Параметры:
//  Параметры - См. ОбновлениеИнформационнойБазыУНФ.ПриДобавленииОбработчиковОбновления
//
Процедура ПоместитьЗавершенныеЛидыВКанбан(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Лиды.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ссылка) КАК Представление,
		|	КанбанЛидов.Порядок КАК Порядок,
		|	Лиды.ВариантЗавершения КАК ВариантЗавершения
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанЛидов КАК КанбанЛидов
		|		ПО Лиды.Ссылка = КанбанЛидов.Лид
		|ГДЕ
		|	НЕ Лиды.ЭтоГруппа
		|	И Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка)
		|	И КанбанЛидов.Состояние = ЗНАЧЕНИЕ(Справочник.СостоянияЛидов.Завершен)
		|	И КанбанЛидов.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка)
		|	И Лиды.Ссылка ЕСТЬ НЕ NULL
		|	И ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ссылка) ЕСТЬ НЕ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		ТекстСообщения = НСтр(
		"ru='Процедура ПоместитьЗавершенныеЛидыВКанбан завершила обработку. Запрос вернул пустую порцию объектов.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.КанбанЛидов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Лид.Установить(Выборка.Ссылка);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Лид = Выборка.Ссылка;
			НоваяЗапись.Состояние = Справочники.СостоянияЛидов.Завершен;
			НоваяЗапись.ВариантЗавершения = Выборка.ВариантЗавершения;
			НоваяЗапись.Порядок = Выборка.Порядок;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Представление, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.Лиды,
			Выборка.Ссылка,
			ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура ПоместитьЗавершенныеЛидыВКанбан обработала очередную порцию объектов: %1'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано);
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Процедуре ПоместитьЗавершенныеЛидыВКанбан не удалось обработать некоторые объекты (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

// Изменение фильтра Результат в списке лидов на новые значения
// Версия 3.0.9
//
// Параметры:
//  Параметры - См. ОбновлениеИнформационнойБазыУНФ.ПриДобавленииОбработчиковОбновления
//
Процедура ИзменитьФильтрЛидовПоРезультату(Параметры) Экспорт
	
	ИмяКлючаОбъекта = "СправочникЛидыФормаФормаСписка";
	Отборы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_ДанныеОтборов");
	Метки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_ДанныеМеток");
	
	Если ТипЗнч(Отборы) <> Тип("ТаблицаЗначений") Или ТипЗнч(Метки) <> Тип("ТаблицаЗначений") Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		ТекстСообщения = НСтр(
		"ru='Процедура ИзменитьФильтрЛидовПоРезультату завершила обработку. Необходимые фильтры не найдены.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	Если Отборы.Колонки.Найти("ИмяОтбора") = Неопределено
		Или Отборы.Колонки.Найти("Выбран") = Неопределено
		Или Отборы.Колонки.Найти("Заголовок") = Неопределено
		Или Отборы.Колонки.Найти("ТипЗначения") = Неопределено
		Или Отборы.Колонки.Найти("ЭтоПредопределенныйОтбор") = Неопределено
		Или Отборы.Колонки.Найти("ИмяЭлемента") = Неопределено
		Или Метки.Колонки.Найти("Метка") = Неопределено
		Или Метки.Колонки.Найти("ПредставлениеМетки") = Неопределено
		Или Метки.Колонки.Найти("ИмяПоляОтбора") = Неопределено
		Или Метки.Колонки.Найти("ИмяГруппыРодителя") = Неопределено
		Или Метки.Колонки.Найти("ИмяОтбора") = Неопределено Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		ТекстСообщения = НСтр(
		"ru='Процедура ИзменитьФильтрЛидовПоРезультату завершила обработку. Необходимые фильтры не найдены.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ОтборПоРезультату = Отборы.НайтиСтроки(Новый Структура("ИмяОтбора", "ОтборРезультат"));
	Если ОтборПоРезультату.Количество() Тогда
		ОтборПоРезультату[0].ТипЗначения = Новый ОписаниеТипов("Строка");
	Иначе
		
		НовыйОтбор = Отборы.Добавить();
		НовыйОтбор.ИмяОтбора = "ОтборРезультат";
		НовыйОтбор.Выбран = Истина;
		НовыйОтбор.Заголовок = "Результат";
		НовыйОтбор.ТипЗначения = Новый ОписаниеТипов("Строка");
		НовыйОтбор.ЭтоПредопределенныйОтбор = Истина;
		НовыйОтбор.ИмяЭлемента = "ОтборРезультат";
		
	КонецЕсли;
	
	МеткиПоРезультату = Метки.НайтиСтроки(Новый Структура("ИмяОтбора", "ОтборРезультат"));
	Если МеткиПоРезультату.Количество() Тогда
		
		Для Каждого Метка Из МеткиПоРезультату Цикл
			
			Если Метка.Метка = Перечисления.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя Тогда
				ЗначениеМетки = РаботаСЛидами.ПредставлениеРезультатаКачественногоЛида();
			ИначеЕсли Метка.Метка = Перечисления.ВариантЗавершенияРаботыСЛидом.НекачественныйЛид Тогда
				ЗначениеМетки = РаботаСЛидами.ПредставлениеРезультатаНекачественногоЛида();
			Иначе
				Продолжить;
			КонецЕсли;
			
			Метка.ИмяПоляОтбора = "РезультатРаботы";
			Метка.Метка = ЗначениеМетки;
			Метка.ПредставлениеМетки = ЗначениеМетки;
			
		КонецЦикла;
		
	Иначе
		
		НоваяМетка = Метки.Добавить();
		НоваяМетка.Метка = РаботаСЛидами.ПредставлениеРезультатаЛидаВРаботе();
		НоваяМетка.ПредставлениеМетки = РаботаСЛидами.ПредставлениеРезультатаЛидаВРаботе();
		НоваяМетка.ИмяПоляОтбора = "РезультатРаботы";
		НоваяМетка.ИмяГруппыРодителя = "Результат";
		НоваяМетка.ИмяОтбора = "ОтборРезультат";
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_ДанныеОтборов", Отборы);
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_ДанныеМеток", Метки);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Параметры.ОбработкаЗавершена = Истина;
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Не удалось изменить фильтры по причине:
		|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = Истина;
	ТекстСообщения = НСтр(
	"ru='Процедура ИзменитьФильтрЛидовПоРезультату завершила обработку. Фильтры изменены.'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.Лиды, ,
	ТекстСообщения);
	
КонецПроцедуры

// Изменение название фильтра Результат на Завершение
// Версия 3.0.11
//
// Параметры:
//  Параметры - См. ОбновлениеИнформационнойБазыУНФ.ПриДобавленииОбработчиковОбновления
//
Процедура ПоменятьНазваниеФильтраРезультат(Параметры) Экспорт
	
	ИмяФормыСписка = "СправочникЛидыФормаФормаСписка";
	ДанныеОтборов = РаботаСОтборами.ДанныеОтборов(ИмяФормыСписка);
	ДанныеМеток = РаботаСОтборами.ДанныеМеток(ИмяФормыСписка);
	
	Если Не РаботаСОтборами.СтруктураТаблицыОтборовКорректна(ДанныеОтборов)
		Или Не РаботаСОтборами.СтруктураТаблицыМетокКорректна(ДанныеМеток) Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		ТекстСообщения = НСтр(
		"ru='Процедура ИзменитьФильтрЛидовПоРезультату завершила обработку. Необходимые фильтры не найдены.'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		РаботаСОтборами.ИзменитьНазваниеОтбора(
		ИмяФормыСписка, "Результат", "Завершение", "Завершение", НСтр("ru = 'Завершение работы с лидом'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Параметры.ОбработкаЗавершена = Истина;
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Не удалось изменить фильтры по причине:
		|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.Лиды, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = Истина;
	ТекстСообщения = НСтр(
	"ru='Процедура ИзменитьФильтрЛидовПоРезультату завершила обработку. Фильтры изменены.'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.Лиды, ,
	ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ПервыйЗапуск

// Первый запуск: включение контроля дублей по данным лидов
//
Процедура ВключитьКонтрольДублейЛидов() Экспорт
	
	Настройки = Новый Соответствие;
	Настройки.Вставить("ПроверятьНаименование", Истина);
	Настройки.Вставить("ПроверятьТелефон", Истина);
	Настройки.Вставить("ПроверятьАдресЭП", Истина);
	Настройки.Вставить("ПроверятьЮрНазвание", Истина);
	
	Константы.НастройкиКонтроляДублейЛиды.Установить(Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных(6)));
	
КонецПроцедуры

#КонецОбласти

// Признак первичного обращения по лиду.
// 
// Параметры:
//  Лид - СправочникСсылка.Лиды
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоПервичноеОбращениеПоЛиду(Лид) Экспорт
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лид, "Вид") = 
		Перечисления.ВидыЛидов.ПервичноеОбращение;
		
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Тема");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СтрДлина(Данные.Тема) > 35 Тогда
		Тема = СтрШаблон(НСтр("ru = '%1...'"), Сред(Данные.Тема, 1, 35));
	Иначе
		Тема = Данные.Тема;
	КонецЕсли;
	
	Если ПустаяСтрока(Тема) Тогда
		Представление = Данные.Наименование;
	Иначе
		Представление = СтрШаблон("%1 (%2)", Данные.Наименование, Тема);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтактнаяИнформацияУНФ

Процедура ЗаполнитьДанныеПанелиКонтактнаяИнформация(ВладелецКИ, ДанныеПанелиКонтактнойИнформации) Экспорт
	
	Контрагент = СвязанныйКонтрагент(ВладелецКИ);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЗаполнитьДанныеПанелиКонтактнаяИнформацияПоКонтрагенту(
		Контрагент, ВладелецКИ, ДанныеПанелиКонтактнойИнформации);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Значение КАК Значение
	|ИЗ
	|	Справочник.Лиды.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Лид";
	
	Запрос.УстановитьПараметр("Лид", ВладелецКИ);
	ДанныеКИ = Запрос.Выполнить().Выбрать();
	
	Пока ДанныеКИ.Следующий() Цикл
		НоваяСтрока = Новый Структура;
		Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ДанныеКИ.Значение);
		НоваяСтрока.Вставить("Отображение", Строка(ДанныеКИ.Вид) + ": " + ДанныеКИ.Представление + ?(ПустаяСтрока(Комментарий), "", ", " + Комментарий));
		НоваяСтрока.Вставить("ИндексПиктограммы", КонтактнаяИнформацияПанельУНФ.ИндексПиктограммыПоТипу(ДанныеКИ.Тип));
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ЗначениеКИ");
		НоваяСтрока.Вставить("ВладелецКИ", ВладелецКИ);
		НоваяСтрока.Вставить("ПредставлениеКИ", ДанныеКИ.Представление);
		НоваяСтрока.Вставить("ТипКИ", ДанныеКИ.Тип);
		ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокТиповКИ.Тип КАК Тип,
		|	ПорядокТиповКИ.Порядок КАК Порядок
		|ПОМЕСТИТЬ втПорядокТиповКИ
		|ИЗ
		|	&ПорядокТиповКИ КАК ПорядокТиповКИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактыЛида.Ссылка КАК КонтактноеЛицо,
		|	КонтактыЛида.Наименование КАК Наименование
		|ПОМЕСТИТЬ втКонтакты
		|ИЗ
		|	Справочник.КонтактыЛидов КАК КонтактыЛида
		|ГДЕ
		|	КонтактыЛида.Владелец = &Лид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтакты.КонтактноеЛицо КАК КонтактноеЛицо,
		|	втКонтакты.Наименование КАК Наименование
		|ИЗ
		|	втКонтакты КАК втКонтакты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК КонтактноеЛицо,
		|	КонтактныеЛицаКонтактнаяИнформация.Тип КАК Тип,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	КонтактныеЛицаКонтактнаяИнформация.Представление КАК Представление,
		|	КонтактныеЛицаКонтактнаяИнформация.Значение КАК Значение,
		|	ПРЕДСТАВЛЕНИЕ(КонтактныеЛицаКонтактнаяИнформация.Вид) КАК ПредставлениеВидаКИ
		|ИЗ
		|	Справочник.КонтактыЛидов.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТиповКИ КАК втПорядокТиповКИ
		|		ПО КонтактныеЛицаКонтактнаяИнформация.Тип = втПорядокТиповКИ.Тип
		|ГДЕ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				втКонтакты.КонтактноеЛицо
		|			ИЗ
		|				втКонтакты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	втПорядокТиповКИ.Порядок,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид.Наименование";
	
	Запрос.УстановитьПараметр("Владелец", ВладелецКИ);
	Запрос.УстановитьПараметр("Лид", ВладелецКИ);
	Запрос.УстановитьПараметр("ПорядокТиповКИ", КонтактнаяИнформацияУНФ.ПорядокТиповКИ());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаКонтакты = МассивРезультатов[2].Выбрать();
	ВыборкаКонтактнаяИнформация = МассивРезультатов[3].Выбрать();
	ОтборКИ = Новый Структура("КонтактноеЛицо");
	
	Пока ВыборкаКонтакты.Следующий() Цикл
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Отображение", Строка(ВыборкаКонтакты.КонтактноеЛицо));
		НоваяСтрока.Вставить("ИндексПиктограммы", -1);
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "КонтактноеЛицо");
		НоваяСтрока.Вставить("ВладелецКИ", ВыборкаКонтакты.КонтактноеЛицо);
		ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
		
		ВыборкаКонтактнаяИнформация.Сбросить();
		ОтборКИ.КонтактноеЛицо = ВыборкаКонтакты.КонтактноеЛицо;
		
		Пока ВыборкаКонтактнаяИнформация.НайтиСледующий(ОтборКИ) Цикл
			
			НоваяСтрока = Новый Структура;
			Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ВыборкаКонтактнаяИнформация.Значение);
			НоваяСтрока.Вставить("Отображение", Строка(ВыборкаКонтактнаяИнформация.Вид) + ": " +ВыборкаКонтактнаяИнформация.Представление + ?(ПустаяСтрока(Комментарий), "", ", " + Комментарий));
			НоваяСтрока.Вставить("ИндексПиктограммы", КонтактнаяИнформацияПанельУНФ.ИндексПиктограммыПоТипу(ВыборкаКонтактнаяИнформация.Тип));
			НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ЗначениеКИ");
			НоваяСтрока.Вставить("ВладелецКИ", ВыборкаКонтакты.КонтактноеЛицо);
			НоваяСтрока.Вставить("ПредставлениеКИ", ВыборкаКонтактнаяИнформация.Представление);
			НоваяСтрока.Вставить("ТипКИ", ВыборкаКонтактнаяИнформация.Тип);
			ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПанелиКонтактнаяИнформацияПоКонтрагенту(Контрагент, ВладелецКИ, ДанныеПанелиКонтактнойИнформации)
	
	Если Не УправлениеДоступом.ЧтениеРазрешено(Контрагент) Тогда
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Отображение", НСтр("ru='<Нет контактных данных>'"));
		НоваяСтрока.Вставить("ИндексПиктограммы", -1);
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "НетДанных");
		НоваяСтрока.Вставить("ВладелецКИ", Неопределено);
		ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
		
		Возврат;
		
	КонецЕсли;
	
	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Отображение", Строка(Контрагент));
	НоваяСтрока.Вставить("ИндексПиктограммы", -1);
	НоваяСтрока.Вставить("ТипОтображаемыхДанных", "КонтактноеЛицо");
	НоваяСтрока.Вставить("ВладелецКИ", Контрагент);
	ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
	
	Справочники.Контрагенты.ЗаполнитьДанныеПанелиКонтактнаяИнформация(Контрагент, ДанныеПанелиКонтактнойИнформации);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ДобавитьКИ(ЭлементСправочника, ПредставлениеКИ, ВидКИ)
	
	ТипКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКИ, "Тип");
	
	XMLПредставление = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПредставлениеКИ, ВидКИ);
	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭлементСправочника, XMLПредставление, ВидКИ, ТипКИ);
	
КонецПроцедуры

Процедура ДобавитьКонтакт(ЭлементСправочника, ПредставлениеКонтакта, ПредставлениеТелефона, ПредставлениеАдресЭП)

	НовыйКонтакт = Справочники.КонтактыЛидов.СоздатьЭлемент();
	НовыйКонтакт.Наименование = ПредставлениеКонтакта;
	НовыйКонтакт.Владелец = ЭлементСправочника;
	
	ДобавитьКИ(НовыйКонтакт, ПредставлениеТелефона, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактаЛида);
	ДобавитьКИ(НовыйКонтакт, ПредставлениеАдресЭП, Справочники.ВидыКонтактнойИнформации.EmailКонтактаЛида);

	НовыйКонтакт.Записать();

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

// Поля загрузки данных из внешнего источника.
// 
// Параметры:
//  ТаблицаПолейЗагрузки - см. ЗагрузкаДанныхИзВнешнегоИсточника.СоздатьТаблицуПолейОписанияЗагрузки
//  НастройкиЗагрузкиДанных - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт

	ОписанияТиповПолей = ЗагрузкаДанныхИзВнешнегоИсточника.НовыйОписанияТиповПолейЗагрузки();

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Лиды");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Наименование", НСтр(
		"ru = 'Лид (наименование)'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Лид", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", НСтр("ru = 'Код'"),
		ОписанияТиповПолей.ОписаниеТиповСтрока9, ОписаниеТиповКолонка, "Лид", 2);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Тема", НСтр("ru = 'Тема'"),
		ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Лид", 3);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон", НСтр(
		"ru = 'Телефон'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Лид", 4);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП", НСтр(
		"ru = 'E-mail'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Лид", 5);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контакт1", НСтр(
		"ru = '(1) Контакт (ФИО)'"), ОписанияТиповПолей.ОписаниеТиповСтрока0000,
		ОписанияТиповПолей.ОписаниеТиповСтрока0000, "Контакт_1", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон1", НСтр(
		"ru = '(1) Телефон'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100,
		"Контакт_1", 2);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП1", НСтр(
		"ru = '(1) E-mail'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100,
		"Контакт_1", 3);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контакт2", НСтр(
		"ru = '(2) Контакт (ФИО)'"), ОписанияТиповПолей.ОписаниеТиповСтрока0000,
		ОписанияТиповПолей.ОписаниеТиповСтрока0000, "Контакт_2", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон2", НСтр(
		"ru = '(2) Телефон'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100,
		"Контакт_2", 2);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП2", НСтр(
		"ru = '(2) E-mail'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100,
		"Контакт_2", 3);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контакт3", НСтр(
		"ru = '(3) Контакт (ФИО)'"), ОписанияТиповПолей.ОписаниеТиповСтрока0000,
		ОписанияТиповПолей.ОписаниеТиповСтрока0000, "Контакт_3", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон3", НСтр(
		"ru = '(3) Телефон'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100,
		"Контакт_3", 2);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП3", НСтр(
		"ru = '(3) E-mail'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100,
		"Контакт_3", 3);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаЛидов") Тогда

		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаЛидов");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ГруппаДоступа", НСтр(
			"ru = 'Группа доступа'"), ОписанияТиповПолей.ОписаниеТиповСтрока200, ОписаниеТиповКолонка, , , Истина);

	КонецЕсли;

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контрагент",
	НСтр("ru = 'Покупатель (для повторного обращения)'"),
	ОписанияТиповПолей.ОписаниеТиповСтрока0000, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", НСтр(
		"ru = 'Группа'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СостоянияЛидов");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СостояниеЛида", НСтр(
		"ru = 'Состояние лида'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписаниеТиповКолонка);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ИсточникиПривлеченияПокупателей");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ИсточникПривлечения", НСтр(
		"ru = 'Источник привлечения'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("Строка");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Комментарий", НСтр(
		"ru = 'Заметка'"), ОписанияТиповПолей.ОписаниеТиповСтрока0000, ОписаниеТиповКолонка);
	
	// ДополнительныеРеквизиты
	НаборСвойств_Справочник_Лиды = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Лиды");
	ЗагрузкаДанныхИзВнешнегоИсточника.ПодготовитьСоответствиеПоДополнительнымРеквизитам(НастройкиЗагрузкиДанных,
		НаборСвойств_Справочник_Лиды);
	Если НастройкиЗагрузкиДанных.ОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда

		ИмяПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяПоляДобавленияДополнительныхРеквизитов();
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, ИмяПоля, НСтр(
			"ru = 'Дополнительные реквизиты'"), ОписанияТиповПолей.ОписаниеТиповСтрока150,
			ОписанияТиповПолей.ОписаниеТиповСтрока11, , , , , , Истина, НаборСвойств_Справочник_Лиды);

	КонецЕсли;

КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Поиск лида в базе
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЛид(
		СтрокаТаблицыФормы.Лид, СтрокаТаблицыФормы.Наименование, СтрокаТаблицыФормы.Код);
		
		// Группа
		ЗначениеПоУмолчанию = ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Лиды", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Состояние
		ЗначениеПоУмолчанию = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЛида();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСостояниеЛида(СтрокаТаблицыФормы.СостояниеЛида, СтрокаТаблицыФормы.СостояниеЛида_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Группа доступа
		Если ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаЛидов") Тогда
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьГруппуДоступаЛида(СтрокаТаблицыФормы.ГруппаДоступа, СтрокаТаблицыФормы.ГруппаДоступа_ВходящиеДанные);
		КонецЕсли;
		
		// Источник привлечения
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьИсточникиПривлеченияПокупателей(СтрокаТаблицыФормы.ИсточникПривлечения, СтрокаТаблицыФормы.ИсточникПривлечения_ВходящиеДанные);
		
		// Комментарий
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Комментарий, СтрокаТаблицыФормы.Комментарий_ВходящиеДанные);
		
		// Дополнительные реквизиты
		Если НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты.Количество() > 0 Тогда
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьДополнительныеРеквизиты(СтрокаТаблицыФормы, НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты);
		КонецЕсли;
		
		// Покупатель
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьКонтрагентаЛида(СтрокаТаблицыФормы.Контрагент, СтрокаТаблицыФормы.Контрагент_ВходящиеДанные);
		Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Контрагент) Тогда
			
			//@skip-check bsl-legacy-check-string-literal
			СтрокаТаблицыФормы.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаТаблицыФормы.Контрагент, "Наименование");
			
			СтрокаТаблицыФормы.Телефон = "";
			СтрокаТаблицыФормы.АдресЭП = "";
			СтрокаТаблицыФормы.Контакт1 = "";
			СтрокаТаблицыФормы.Телефон1 = "";
			СтрокаТаблицыФормы.АдресЭП1 = "";
			СтрокаТаблицыФормы.Контакт2 = "";
			СтрокаТаблицыФормы.Телефон2 = "";
			СтрокаТаблицыФормы.АдресЭП2 = "";
			СтрокаТаблицыФормы.Контакт3 = "";
			СтрокаТаблицыФормы.Телефон3 = "";
			СтрокаТаблицыФормы.АдресЭП3 = "";
			
		Иначе
			
			// Контакты и КИ (удаляем пробелы)
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Контакт1, СтрокаТаблицыФормы.Контакт1);
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Телефон1, СтрокаТаблицыФормы.Телефон1);
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЭП1, СтрокаТаблицыФормы.АдресЭП1);
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Контакт2, СтрокаТаблицыФормы.Контакт2);
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Телефон2, СтрокаТаблицыФормы.Телефон2);
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЭП2, СтрокаТаблицыФормы.АдресЭП2);
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Контакт3, СтрокаТаблицыФормы.Контакт3);
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Телефон3, СтрокаТаблицыФормы.Телефон3);
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЭП3, СтрокаТаблицыФормы.АдресЭП3);
			
		КонецЕсли;
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Лид);
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = СтрокаТаблицыФормы._СтрокаСопоставлена
											ИЛИ (НЕ СтрокаТаблицыФормы._СтрокаСопоставлена И НЕ ПустаяСтрока(СтрокаТаблицыФормы.Наименование));
	
КонецПроцедуры

Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	НастройкиОбновленияСвойств		= СтруктураДанных.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ОбновлятьСуществующие			= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено		= СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ТаблицаСопоставленияДанных		= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных				= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции		= 0;
	ТранзакцияОткрыта				= Ложь;
	
	Попытка
		
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта 
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено);
				
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
				
				Если СтрокаТаблицы._СтрокаСопоставлена Тогда
					
					ЭлементСправочника = СтрокаТаблицы.Лид.ПолучитьОбъект();
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, НастройкиОбновленияСвойств.ИменаПолейОбновляемые, НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению);
					
				Иначе
					
					ЭлементСправочника = СоздатьЭлемент();
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы);
					
					ЭлементСправочника.ДатаСоздания = ТекущаяДатаСеанса();
					ЭлементСправочника.Родитель = СтрокаТаблицы.Родитель;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
					ЭлементСправочника.ДополнительныеСвойства.Вставить("Контрагент", СтрокаТаблицы.Контрагент);
					ЭлементСправочника.Вид = Перечисления.ВидыЛидов.ПовторноеОбращение;
					ЭлементСправочника.Записать();
				Иначе
					ОбработатьПервичногоЛидаПриЗагрузке(ЭлементСправочника, СтрокаТаблицы, СтруктураДанных);
				КонецЕсли;
				
			КонецЕсли;
			
			ИндексТекущейСтроки = ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса      = СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейСтроки, РазмерТаблицыДанных);
			ПроцентВыполнения   = Окр(ИндексТекущейСтроки * 100 / РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Лиды, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработатьПервичногоЛидаПриЗагрузке(ЭлементСправочника, СтрокаТаблицы, СтруктураДанных)
	
	ЭлементСправочника.Вид = Перечисления.ВидыЛидов.ПервичноеОбращение;
	ЭлементСправочника.Наименование = СтрокаТаблицы.Наименование;
	ЭлементСправочника.НаименованиеКомпании = СтрокаТаблицы.Наименование;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон) Тогда
		
		ДобавитьКИ(ЭлементСправочника, СтрокаТаблицы.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонКомпанииЛида);
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП) Тогда
		
		ДобавитьКИ(ЭлементСправочника, СтрокаТаблицы.АдресЭП, Справочники.ВидыКонтактнойИнформации.EmailКомпанииЛида);
		
	КонецЕсли;
	
	Если СтруктураДанных.НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты.Количество() > 0 Тогда
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ОбработатьВыбранныеДополнительныеРеквизиты(ЭлементСправочника, СтрокаТаблицы._СтрокаСопоставлена, СтрокаТаблицы, СтруктураДанных.НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты);
		
	КонецЕсли;
	
	ЭлементСправочника.Ответственный = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный");
	ЭлементСправочника.ДополнительныеСвойства.Вставить("ОсновныеСведенияКонтактныхЛиц", ОсновныеСведенияКонтактовЛида(СтрокаТаблицы));
	ЭлементСправочника.ДополнительныеСвойства.Вставить("НомераТелефоновКонтактаЛида", НомераТелефоновКонтактаЛида(СтрокаТаблицы));
	ЭлементСправочника.ДополнительныеСвойства.Вставить("АдресаЭПКонтактовЛида", АдресаЭПКонтактовЛида(СтрокаТаблицы));
	ЭлементСправочника.Записать();
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Контакт1)
		ИЛИ НЕ ПустаяСтрока(СтрокаТаблицы.Телефон1)
		ИЛИ НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП1) Тогда
		
		ДобавитьКонтакт(ЭлементСправочника.Ссылка, СтрокаТаблицы.Контакт1, СтрокаТаблицы.Телефон1, СтрокаТаблицы.АдресЭП1);
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Контакт2)
		ИЛИ НЕ ПустаяСтрока(СтрокаТаблицы.Телефон2)
		ИЛИ НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП2) Тогда
		
		ДобавитьКонтакт(ЭлементСправочника.Ссылка, СтрокаТаблицы.Контакт2, СтрокаТаблицы.Телефон2, СтрокаТаблицы.АдресЭП2);
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Контакт3)
		ИЛИ НЕ ПустаяСтрока(СтрокаТаблицы.Телефон3)
		ИЛИ НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП3) Тогда
		
		ДобавитьКонтакт(ЭлементСправочника.Ссылка, СтрокаТаблицы.Контакт3, СтрокаТаблицы.Телефон3, СтрокаТаблицы.АдресЭП3 );
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Функция возвращает список имен «ключевых» реквизитов.
//
// Возвращаемое значение:
//  Массив из Строка - ключевые реквизиты
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//  Массив из Строка - ключевые реквизиты
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("ГруппаДоступа");
	РедактируемыеРеквизиты.Добавить("ДатаСоздания");
	РедактируемыеРеквизиты.Добавить("СостояниеЛида");
	РедактируемыеРеквизиты.Добавить("Ответственный");
	РедактируемыеРеквизиты.Добавить("ИсточникПривлечения");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

Функция ЗначениеРеквизитаЛид(Выборка, Лид)
	
	Если НЕ ЗначениеЗаполнено(Выборка.СсылкаНаДопРеквизитЛид) Тогда
		Возврат Лид[Выборка.ИмяРеквизитаЛид];
	КонецЕсли;
	
	Отбор = Новый Структура("Свойство", Выборка.СсылкаНаДопРеквизитЛид);
	ЗначенияРеквизита = Лид.ДополнительныеРеквизиты.НайтиСтроки(Отбор);
	
	Если ЗначенияРеквизита.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЗначенияРеквизита[0].Значение;
		
КонецФункции

Функция ПредставлениеТиповСвойства(ТипЗначения)
	
	МассивТипов = ТипЗначения.Типы();
	Представление = "";
	Для Каждого Тип Из МассивТипов Цикл
		Если Представление = "" Тогда
			Представление = Строка(Тип);
		Иначе
			Представление = Представление + ", " + Строка(Тип);
		КонецЕсли;
	КонецЦикла;
		
	Возврат Представление;
	
КонецФункции

Процедура ЗаполнитьРеквизитыКонтрагентаПоРеквизитамЛида(Контрагент, Лид)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеПолейЛидаИКонтрагента.ИмяРеквизитаЛид КАК ИмяРеквизитаЛид,
	|	СоответствиеПолейЛидаИКонтрагента.ИмяРеквизитаКонтрагент КАК ИмяРеквизитаКонтрагент,
	|	СоответствиеПолейЛидаИКонтрагента.СсылкаНаДопРеквизитЛид КАК СсылкаНаДопРеквизитЛид,
	|	СоответствиеПолейЛидаИКонтрагента.СсылкаНаДопРеквизитКонтрагент КАК СсылкаНаДопРеквизитКонтрагент
	|ИЗ
	|	РегистрСведений.СоответствиеПолейЛидаИКонтрагента КАК СоответствиеПолейЛидаИКонтрагента";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ИмяРеквизитаЛид = "ПрисоединенныеФайлы" Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеРеквизитаЛид = ЗначениеРеквизитаЛид(Выборка, Лид);
		Если ЗначениеРеквизитаЛид = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьЗначениеРеквизитаКонтрагент(Контрагент, Выборка, ЗначениеРеквизитаЛид);
		
	КонецЦикла;
	
	Контрагент.ВидКонтрагента = ВидКонтрагентаПоЗаполненнымРеквизитам(Контрагент);
	
КонецПроцедуры

Процедура ПеренестиФайлыИзЛидаВКонтрагента(Лид, Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеПолейЛидаИКонтрагента.ИмяРеквизитаЛид КАК ИмяРеквизитаЛид
	|ИЗ
	|	РегистрСведений.СоответствиеПолейЛидаИКонтрагента КАК СоответствиеПолейЛидаИКонтрагента
	|ГДЕ
	|	СоответствиеПолейЛидаИКонтрагента.ИмяРеквизитаЛид = &Имя";
	
	Запрос.УстановитьПараметр("Имя", "ПрисоединенныеФайлы");
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Файлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Лид, Файлы);
	
	Для Каждого Файл Из Файлы Цикл
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Файл, ПараметрыДанныхФайла);
		
		ПараметрыДобавления = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыДобавления.ВладелецФайлов = Контрагент;
		ПараметрыДобавления.ИмяБезРасширения = ДанныеФайла.ИмяФайла;
		ПараметрыДобавления.РасширениеБезТочки = ДанныеФайла.Расширение;
		ПараметрыДобавления.ВремяИзмененияУниверсальное = ДанныеФайла.ДатаМодификацииУниверсальная;
		РаботаСФайлами.ДобавитьФайл(ПараметрыДобавления, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначениеРеквизитаКонтрагент(Контрагент, Выборка, ЗначениеРеквизитаЛид)
	
	ИмяРеквизита = "";
	ТипРеквизита = Новый ОписаниеТипов;
	ПредставленияРеквизитов = Справочники.Контрагенты.СтандартныеРеквизитыДляПереводаВПокупателя();
	
	Если Выборка.ИмяРеквизитаКонтрагент = "Наименование" Тогда
		ТипРеквизита = Новый ОписаниеТипов("Строка");
		ИмяРеквизита = ПредставленияРеквизитов[Выборка.ИмяРеквизитаКонтрагент];
	ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.СсылкаНаДопРеквизитКонтрагент) Тогда
		СправочникКонтрагенты = Метаданные.Справочники["Контрагенты"];
		СправочникКонтрагентыРеквизиты = СправочникКонтрагенты.Реквизиты;
		ТекущийРеквизит = СправочникКонтрагентыРеквизиты[Выборка.ИмяРеквизитаКонтрагент];
		ТипРеквизита = ТекущийРеквизит.Тип;
		ИмяРеквизита = ПредставленияРеквизитов[Выборка.ИмяРеквизитаКонтрагент];
	Иначе
		ЗначенияРеквизита = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.СсылкаНаДопРеквизитКонтрагент, "ТипЗначения, Заголовок");
		ТипРеквизита = ЗначенияРеквизита.ТипЗначения;
		ИмяРеквизита = ЗначенияРеквизита.Заголовок;
	КонецЕсли;
	
	ТипыЗначенийСогласованны = ТипРеквизита.СодержитТип(ТипЗнч(ЗначениеРеквизитаЛид));
	
	Если НЕ ТипыЗначенийСогласованны Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение реквизита %1. 
			|Ожидалось: %2; передано значение: %3 (тип %4).'"),ИмяРеквизита,
			ПредставлениеТиповСвойства(ТипРеквизита),
			ЗначениеРеквизитаЛид,
			Строка(ТипЗнч(ЗначениеРеквизитаЛид)));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Выборка.СсылкаНаДопРеквизитКонтрагент) Тогда
		Контрагент[Выборка.ИмяРеквизитаКонтрагент] = ЗначениеРеквизитаЛид;
	Иначе
		ДопРеквизит = Контрагент.ДополнительныеРеквизиты.Добавить();
		ДопРеквизит.Свойство = Выборка.СсылкаНаДопРеквизитКонтрагент;
		ДопРеквизит.Значение = ЗначениеРеквизитаЛид;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидКонтрагентаПоЗаполненнымРеквизитам(Контрагент)
	
	Если ЗначениеЗаполнено(Контрагент.ВидКонтрагента) Тогда
		Возврат Контрагент.ВидКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.НаименованиеПолное) Тогда
		Возврат Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.НаименованиеПолное) Тогда
		Возврат Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.ДатаРождения) ИЛИ ЗначениеЗаполнено(Контрагент.Пол)
		ИЛИ ЗначениеЗаполнено(Контрагент.ФИО) ИЛИ ЗначениеЗаполнено(Контрагент.ДокументУдостоверяющийЛичность) Тогда
		Возврат Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.СвидетельствоСерияНомер) ИЛИ ЗначениеЗаполнено(Контрагент.СвидетельствоДатаВыдачи) Тогда
		Возврат Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.КодГосударственногоОргана) 
		ИЛИ ЗначениеЗаполнено(Контрагент.ВидГосударственногоОргана) Тогда
		Возврат Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
	КонецЕсли;
	
	Возврат Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	
КонецФункции

Функция ОсновныеСведенияКонтактовЛида(СтрокаТаблицы)
	
	ОсновныеСведенияКонтактовЛида = Новый Массив;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Контакт1) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.Контакт1);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон1) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.Телефон1);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП1) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.АдресЭП1);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Контакт2) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.Контакт2);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон2) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.Телефон2);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП2) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.АдресЭП2);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Контакт3) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.Контакт3);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон3) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.Телефон3);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП3) Тогда
		ОсновныеСведенияКонтактовЛида.Добавить(СтрокаТаблицы.АдресЭП3);
	КонецЕсли;
	
	Возврат ОсновныеСведенияКонтактовЛида;
	
КонецФункции

Функция АдресаЭПКонтактовЛида(СтрокаТаблицы)
	АдресаЭП = Новый Массив;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП1) Тогда
		АдресаЭП.Добавить(СтрокаТаблицы.АдресЭП1);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП2) Тогда
		АдресаЭП.Добавить(СтрокаТаблицы.АдресЭП2);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП3) Тогда
		АдресаЭП.Добавить(СтрокаТаблицы.АдресЭП3);
	КонецЕсли;
	Возврат АдресаЭП;
КонецФункции

Функция НомераТелефоновКонтактаЛида(СтрокаТаблицы)
	НомераТелефонов = Новый Массив;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон1) Тогда
		НомераТелефонов.Добавить(КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(СтрокаТаблицы.Телефон1));
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон2) Тогда
		НомераТелефонов.Добавить(КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(СтрокаТаблицы.Телефон2));
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон3) Тогда
		НомераТелефонов.Добавить(КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(СтрокаТаблицы.Телефон3));
	КонецЕсли;
	Возврат НомераТелефонов;
КонецФункции

Функция СоздатьКонтрагента(Лид)
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Заполнить(Неопределено);
	
	ЗаполнитьРеквизитыКонтрагентаПоРеквизитамЛида(НовыйКонтрагент, Лид);
	ЗаполнитьЗначенияСвойств(НовыйКонтрагент,
				РасчетыРаботаСФормамиВызовСервера.ПолучитьЗначенияРеквизитовПоУмолчаниюДляНовогоКонтрагента());
				
	Если НЕ ЗначениеЗаполнено(НовыйКонтрагент.Наименование) Тогда
		НовыйКонтрагент.Наименование = Лид.Наименование;
	КонецЕсли;
	
	НовыйКонтрагент.Ответственный = ПерсональныеНастройкиРУНФ.Прочитать(
		"ОсновнойОтветственный");
	НовыйКонтрагент.Покупатель = Истина;
	
	НовыйКонтрагент.Теги.Загрузить(Лид.Теги.Выгрузить(,"Тег"));
	
	Для Каждого СтрокаКИ Из Лид.КонтактнаяИнформация Цикл
		
		//@skip-check query-in-loop
		// Получение данных запросом используется только в случае, когда не найдено стандартных данных 
		// (крайне маловероятно)
		ВидКИ = ВидКИКонтрагента(СтрокаКИ.Тип, СтрокаКИ.Вид);
		Если ВидКИ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеКИ = ?(ЗначениеЗаполнено(СтрокаКИ.Значение), СтрокаКИ.Значение, СтрокаКИ.ЗначенияПолей);
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовыйКонтрагент, ЗначениеКИ, ВидКИ,,Ложь);
		
	КонецЦикла;
	
	НовыйКонтрагент.Записать();
	
	Возврат НовыйКонтрагент;
	
КонецФункции

Функция СоздатьКонтактныеЛица(Лид, ГруппаДоступаКонтрагента)
	
	КонтактныеЛица = Новый Массив;
	
	КонтактыЛида = Справочники.КонтактыЛидов.КонтактыЛида(Лид);
	
	Для каждого ДанныеЛида Из КонтактыЛида Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеЛида.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтакт = Справочники.КонтактныеЛица.СоздатьЭлемент();
		НовыйКонтакт.Наименование = ДанныеЛида.Наименование;
		НовыйКонтакт.Заполнить(Неопределено);
		НовыйКонтакт.ГруппаДоступа = ГруппаДоступаКонтрагента;
		
		ДанныеЛидаКИ = ДанныеЛида.КонтактнаяИнформация;
		Для каждого СтрокаКИ Из ДанныеЛидаКИ Цикл
			
			//@skip-check query-in-loop
			// Получение данных запросом используется только в случае, когда не найдено стандартных данных 
			// (крайне маловероятно)
			ВидКИ = ВидКИКонтактногоЛица(СтрокаКИ.тип);
			Если ВидКИ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеКИ = ?(ЗначениеЗаполнено(СтрокаКИ.Значение), СтрокаКИ.Значение, СтрокаКИ.ЗначенияПолей);
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовыйКонтакт, ЗначениеКИ, ВидКИ,,Ложь);
			
		КонецЦикла;
		
		НовыйКонтакт.Записать();
		КонтактныеЛица.Добавить(НовыйКонтакт.Ссылка);
		
	КонецЦикла;
	
	Возврат КонтактныеЛица;
	
КонецФункции

Функция ВидКИКонтрагентаЗапросом(ТипКИ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Тип = &ТипКИ
	|	И ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникКонтрагенты)";
	
	Запрос.УстановитьПараметр("ТипКИ", ТипКИ);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ВидКИКонтактногоЛицаЗапросом(ТипКИ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Тип = &ТипКИ
	|	И ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникКонтактныеЛица)";
	
	Запрос.УстановитьПараметр("ТипКИ", ТипКИ);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СоздатьКонтрагентаИИзменитьЛида(ЛидОбъект)
	
	ЛидОбъект.Заполнить(Новый Структура("ПереводВКачественныйЛид", Истина));
	Если НЕ ЛидОбъект.ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЛидОбъект.Записать();
	
	НовыйКонтрагентОбъект = СоздатьКонтрагента(ЛидОбъект);
	ПеренестиФайлыИзЛидаВКонтрагента(ЛидОбъект.Ссылка, НовыйКонтрагентОбъект.Ссылка);
	
	НовыйКонтактныеЛица = СоздатьКонтактныеЛица(ЛидОбъект, НовыйКонтрагентОбъект.ГруппаДоступа);
	Для каждого НовыйКонтакт Из НовыйКонтактныеЛица Цикл
		РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(НовыйКонтрагентОбъект.Ссылка, НовыйКонтакт.Ссылка);
	КонецЦикла;
	
	РегистрыСведений.СвязиКонтрагентЛид.НоваяСвязь(НовыйКонтрагентОбъект.Ссылка, ЛидОбъект.Ссылка);
	
	Возврат НовыйКонтрагентОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли