
#Область ПрограммныйИнтерфейс

// Производит разложение данных дорожек магнитной карты по шаблонам.
// Параметры:
//  ДанныеДорожек - Массив -- массив строк. Значения полученные из дорожек.
//  ПараметрыДорожек - Массив - массив структур содержащих параметры настройки устройства, где:
//   * Использовать - булево - признак использования дорожки.
//   * НомерДорожки - число - порядковый номер дорожки 1-3.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Шаблон - СправочникСсылка.ШаблоныМагнитныхКарт - ;
//   * ДанныеДорожек - Структура:
//  	** Поле - Строка
//  	** ЗначениеПоля - Произвольный - 
//
Функция РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек) Экспорт;
	
	Возврат ОборудованиеУстройстваВводаВызовСервера.РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек);
	
КонецФункции            

// Генерировать внешнее событие для устройства ввода.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Процедура ГенерироватьВнешнееСобытие(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыВыполнениеКоманды = МенеджерОборудованияКлиентСервер.ПараметрыВыполнениеКоманды("ExternalEvent", Неопределено, ДополнительныеПараметры, Ложь, Ложь);
		
	МенеджерОборудованияКлиент.НачатьВыполнениеКоманды(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, 
		ПараметрыОперации, ПараметрыВыполнениеКоманды);
	
КонецПроцедуры

#КонецОбласти
