
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СуммаСобственныхСредств = Параметры.ОбщаяСумма - Параметры.СуммаАгентскихПлатежей;
	СтрокаСобственныхСредств = ДенежныеСредства.Добавить();
	СтрокаСобственныхСредств.Сумма = СуммаСобственныхСредств;
	
	Для каждого ДеньгиПоАгентскомуДоговору Из Параметры.ДеньгиПоДоговорамПлатежногоАгента Цикл
		НоваяСтрока = ДенежныеСредства.Добавить();
		НоваяСтрока.ДоговорКонтрагента = ДеньгиПоАгентскомуДоговору.ДоговорАгента;
		НоваяСтрока.Сумма = ДеньгиПоАгентскомуДоговору.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ДеньгиКВыемке", Новый Массив);
	СтруктураОтвета.Вставить("ИзымаемаяСумма", 0);
	
	Для каждого СтрокаТаблицы Из ДенежныеСредства Цикл
		Если СтрокаТаблицы.Сумма > 0 Тогда
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("ДоговорКонтрагента", СтрокаТаблицы.ДоговорКонтрагента);
			СтруктураСтроки.Вставить("Сумма", СтрокаТаблицы.Сумма);
			СтруктураОтвета.ДеньгиКВыемке.Добавить(СтруктураСтроки);
			СтруктураОтвета.ИзымаемаяСумма = СтруктураОтвета.ИзымаемаяСумма + СтрокаТаблицы.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

