///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СрокДействияQRКода 	= Параметры.СрокДействияQRКода;
	ВариантНастройки	= Параметры.ВариантНастройки;
	
	Если ВариантНастройки = Перечисления.ВариантыНастройкиСБП.b2b Тогда
		
		УточнениеЗаголовка = НСтр("ru='Устанавливается в часах и показывает время действия QR-кода при отправке платежной ссылки из заказов, счетов, документов реализации и др. 
		|Срок действия не должен превышать 2160 часов (90 дней), если не задан, то по умолчанию составляет 240 часов (10 дней). '");
		
		Элементы.СрокДействияQRКодаРасширеннаяПодсказка.Заголовок = УточнениеЗаголовка;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Закрыть(СрокДействияQRКода);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
