#Область СлужебныйПрограммныйИнтерфейс

#Область Системные

// ++ Локализация
Асинх Процедура ПодключаемоеОборудование_ПроверкаКМ() Экспорт
	
	КонтекстОперации = Неопределено;
	МодульМенеджерОборудованияМаркировкаКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("МенеджерОборудованияМаркировкаКлиент");
	МодульМенеджерОборудованияМаркировкаКлиент.ВосстановитьКонтекстОперации(КонтекстОперации);
	
	Операция = КонтекстОперации.Операции[0];
	СписокОпераций = КонтекстОперации.СписокОпераций;
	
	Если Операция = СписокОпераций.ЗапросОИСМ Тогда
		МодульМенеджерОборудованияМаркировкаКлиент.ПроверкаКМ(КонтекстОперации);
	КонецЕсли;
	
КонецПроцедуры
// -- Локализация

Процедура ПодключаемоеОборудование_ОбменДаннымиССервером() Экспорт
	
	МенеджерОборудованияКлиент.ОбменДаннымиССервером();
	
КонецПроцедуры

Процедура ПодключаемоеОборудование_ЗаписатьЛогНаСервере() Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяПодсистемаЛогирования() Тогда
		МодульЛогированиеОперацийБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ЛогированиеОперацийБПОКлиент");
		МодульЛогированиеОперацийБПОКлиент.ЗаписатьЛогНаСервере();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключаемоеОборудование_ЗаписатьЛогНаСервереПриЗавершении() Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяПодсистемаЛогирования() Тогда
		МодульЛогированиеОперацийБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ЛогированиеОперацийБПОКлиент");
		МодульЛогированиеОперацийБПОКлиент.ЗаписатьЛогНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти