
#Область ПрограммныйИнтерфейс

// По фискальному устройству определяет статус смены и проверяет ее активность. Под активностью понимается соблюдение следующих условий:
// - кассовая смена не закрыта с момента открытия кассовой смены прошло не более 24 часов.
//
// Параметры:
//  ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - фискальное устройство, для которого требуется определить активность смены
//
// Возвращаемое значение:
//  Структура:
//    *Открыта - Булево - Истина - смена открыта, Ложь - смена закрыта.
//    *Активна - Булево - Истина - смена открыта, Ложь - смена закрыта, прошло более 24 часов с момента открытия или никогда не была открыта.
//    *ТекущийНомерЧека - Число - текущий номер чека ККТ.
// 
Функция СтатусПоследнейСмены(ФискальноеУстройство) Экспорт
	
	Возврат КассовыеСмены.СтатусПоследнейСмены(ФискальноеУстройство);
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела: следует использовать КассовыеСмены.СменаАктивна.
// Проверяет активна ли кассовая смена. Под активностью понимается соблюдение следующих условий:
// кассовая смена не закрыта с момента открытия кассовой смены прошло не более 24 часов.
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Кассовая смена, активность которой необходимо проверить
//
// Возвращаемое значение:
//  Булево - активность смены
Функция СменаАктивна(КассоваяСмена) Экспорт
	
	Возврат КассовыеСмены.СменаАктивна(КассоваяСмена);
	
КонецФункции

// Устарела: следует использовать КассовыеСмены.СменаЗакрыта.
// Проверяет закрыта ли кассовая смена.
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Кассовая смена, активность которой необходимо проверить
//
// Возвращаемое значение:
//  Булево - Истина - смена закрыта, Ложь - смена не закрыта
Функция СменаЗакрыта(КассоваяСмена) Экспорт
	
	Возврат КассовыеСмены.СменаЗакрыта(КассоваяСмена);
	
КонецФункции

// Устарела: следует использовать КассовыеСмены.ОписаниеКассовойСмены.
// Получает реквизиты кассовой смены
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Кассовая смена, активность которой необходимо проверить
//
// Возвращаемое значение:
//  Структура - реквизиты кассовой смены. Содержит следующие реквизиты:
//    *КассоваяСмена - ДокументСсылка.КассоваяСмена - ссылка на кассовую смену
//    *ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - ссылка на устройство, на котором открыта смена
//    *НачалоКассовойСмены - Дата - дата открытия смены
//    *ОкончаниеКассовойСмены - Дата - дата закрытия смены (если смена закрывалась)
//    *ДатаИстеченияСрокаДействия - Дата - в которую закончиться срок действия смены (дата открытия + 24 часа)
//    *Организация - ОпределяемыйТип.ОрганизацияБПО - организация, указанная в документе КассоваяСмена
//    *Статус - ПеречислениеСсылка.СтатусыКассовойСмены - статус кассовой смены.
Функция ОписаниеКассовойСмены(КассоваяСмена) Экспорт
	
	Возврат КассовыеСмены.ОписаниеКассовойСмены(КассоваяСмена);
	
КонецФункции

// Устарела: следует использовать КассовыеСмены.ПоследняяСменаЗакрыта.
// По фискальному устройству определяет последнюю смену и проверяет закрыта ли она.
//
// Параметры:
//  ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - фискальное устройство, для которого требуется определить закрыта ли смена
//
// Возвращаемое значение:
//  Булево - Истина - смена закрыта или никогда не была открыта, Ложь - смена не закрыта
Функция ПоследняяСменаЗакрыта(ФискальноеУстройство) Экспорт
	
	Возврат КассовыеСмены.ПоследняяСменаЗакрыта(ФискальноеУстройство);
	
КонецФункции

// Устарела: следует использовать КассовыеСмены.ОписаниеПоследнейКассовойСмены.
// По фискальному устройству определяет последнюю смену и получает ее реквизиты.
//
// Параметры:
//  ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - фискальное устройство, для которого требуется определить активность смены.
//
// Возвращаемое значение:
//  Структура - реквизиты кассовой смены, Неопределено - если ни одной смены не было открыто. Содержит следующие реквизиты:
//    *КассоваяСмена - ДокументСсылка.КассоваяСмена - ссылка на кассовую смену
//    *ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - ссылка на устройство, на котором открыта смена
//    *НачалоКассовойСмены - Дата - дата открытия смены
//    *ОкончаниеКассовойСмены - Дата - дата закрытия смены (если смена закрывалась)
//    *ДатаИстеченияСрокаДействия - Дата - в которую закончиться срок действия смены (дата открытия + 24 часа)
//    *Организация - ОпределяемыйТип.ОрганизацияБПО - организация, указанная в документе КассоваяСмена.
//    *Статус - ПеречислениеСсылка.СтатусыКассовойСмены - статус кассовой смены.
Функция ОписаниеПоследнейКассовойСмены(ФискальноеУстройство) Экспорт
	
	Возврат КассовыеСмены.ОписаниеПоследнейКассовойСмены(ФискальноеУстройство);
	
КонецФункции

// Устарела: следует использовать КассовыеСмены.НоваяКассоваяСмена.
// Создать новую кассовую смену.
//
// Параметры:
//  ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование
//  ПараметрыКоманды - Структура
//
// Возвращаемое значение:
//  ДокументСсылка.КассоваяСмена.
//
Функция НоваяКассоваяСмена(ФискальноеУстройство, ПараметрыКоманды) Экспорт
	
	Возврат КассовыеСмены.НоваяКассоваяСмена(ФискальноеУстройство, ПараметрыКоманды);
	
КонецФункции

// Устарела: следует использовать КассовыеСмены.ЗакрытьКассовуюСмену.
// Закрыть открытую ранее кассовую смену.
//
// Параметры:
//  ПараметрыКоманды - Структура
//   * КассоваяСмена - ДокументСсылка.КассоваяСмена
//
Процедура ЗакрытьКассовуюСмену(ПараметрыКоманды) Экспорт
	
	КассовыеСмены.ЗакрытьКассовуюСмену(ПараметрыКоманды);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти