#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЖурналБанкИКасса");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	ПараметрыОткрытия = Новый Структура("ЭтоНачальнаяСтраница", Ложь);	
	ОткрытьФорму("Обработка.БанкИКасса.Форма.ФормаСписка", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
