
#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для получения курсовых разниц при расчетах с поставщиками.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   СЗачетомАванса - Булево - Признак необходимости отражения зачета авансов
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//   ПолучатьРеквизитыРасчетов - Булево - Признак необходимости получения дополнительных реквизитов движений для
//                                        расчетов с контрагентами
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ПолучатьРеквизитыРасчетов = Ложь) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПоставщиками");
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Ложь, Истина);
		
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|	СУММА(РасчетыОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаДляОстатка
		|		КОНЕЦ КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаВалДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаВалДляОстатка
		|		КОНЕЦ КАК СуммаВалОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаРег
		|			ИНАЧЕ - ВременнаяТаблица.СуммаРег
		|		КОНЕЦ КАК СуммаРегОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	ГДЕ
		|	ВременнаяТаблица.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля
		|		И ДвиженияДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) КАК СуммаКурсовойРазницыРег,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор.ВалютаРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		|	И (		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.ВидДвижения,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	СУММА(ТаблицаДвижений.Сумма),
		|	СУММА(ТаблицаДвижений.СуммаВал),
		|	СУММА(ТаблицаДвижений.СуммаРег),
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	&РеквизитыРасчетовНеопределено
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК Сумма,
		|		0 КАК СуммаВал,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег КАК СуммаРег,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100)) КАК СодержаниеПроводки
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ВЫРАЗИТЬ(ТаблицаДокумента.Контрагент КАК Справочник.Контрагенты).СчетУчетаРасчетовСПоставщиком,
		|		ТаблицаДокумента.СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Истина, Истина);
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|	СУММА(РасчетыОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаДляОстатка
		|			ИНАЧЕ -ВременнаяТаблица.СуммаДляОстатка
		|		КОНЕЦ КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаВалДляОстатка
		|			ИНАЧЕ -ВременнаяТаблица.СуммаВалДляОстатка
		|		КОНЕЦ КАК СуммаВалОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаРег
		|			ИНАЧЕ -ВременнаяТаблица.СуммаРег
		|		КОНЕЦ КАК СуммаРегОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) КАК СуммаКурсовойРазницыРег,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) >= -0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыРег > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыРег
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыРег
		|	КОНЕЦ,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница,
		|	&РеквизитыРасчетовНеопределено
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
		|ГДЕ
		|	(ТаблицаДокумента.СуммаКурсовойРазницы <> 0
		|			ИЛИ ТаблицаДокумента.СуммаКурсовойРазницыРег <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Истина, Истина);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками()

// Возвращает текст запроса для получения курсовых разниц при расчетах с покупателями.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   СЗачетомАванса - Булево - Признак необходимости отражения зачета авансов
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//   ПолучатьРеквизитыРасчетов - Булево - Признак необходимости получения дополнительных реквизитов движений для
//                                        расчетов с контрагентами
//   РеквизитыРасчетовСоответствие - Соответствие - Временное соответствие дополнительных реквизитов движений для
//                                                  расчетов с контрагентами
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ПолучатьРеквизитыРасчетов = Ложь, РеквизитыРасчетовСоответствие = Неопределено) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПокупателями");
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Ложь,, РеквизитыРасчетовСоответствие);
		
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|	СУММА(РасчетыОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаДляОстатка
		|		КОНЕЦ КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаВалДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаВалДляОстатка
		|		КОНЕЦ КАК СуммаВалОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаРег
		|			ИНАЧЕ - ВременнаяТаблица.СуммаРег
		|		КОНЕЦ КАК СуммаРегОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
		|	ГДЕ
		|	ВременнаяТаблица.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
		|						ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля
		|		И ДвиженияДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) КАК СуммаКурсовойРазницыРег,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор.ВалютаРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		|	И (		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) >= 0.005
		|		ИЛИ	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) <= -0.005 ) 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.ВидДвижения,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	СУММА(ТаблицаДвижений.Сумма),
		|	СУММА(ТаблицаДвижений.СуммаВал),
		|	СУММА(ТаблицаДвижений.СуммаРег),
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	&РеквизитыРасчетовНеопределено
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК Сумма,
		|		0 КАК СуммаВал,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег КАК СуммаРег,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100)) КАК СодержаниеПроводки
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаРег) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаРег) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег КАК СуммаКурсовойРазницыРег
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ВЫРАЗИТЬ(ТаблицаДокумента.Контрагент КАК Справочник.Контрагенты).СчетУчетаРасчетовСПокупателем,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Истина,, РеквизитыРасчетовСоответствие);
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|	СУММА(РасчетыОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаДляОстатка
		|			ИНАЧЕ -ВременнаяТаблица.СуммаДляОстатка
		|		КОНЕЦ КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаВалДляОстатка
		|			ИНАЧЕ -ВременнаяТаблица.СуммаВалДляОстатка
		|		КОНЕЦ КАК СуммаВалОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаРег
		|			ИНАЧЕ -ВременнаяТаблица.СуммаРег
		|		КОНЕЦ КАК СуммаРегОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) КАК СуммаКурсовойРазницыРег,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыРег > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыРег
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыРег
		|	КОНЕЦ,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница,
		|	&РеквизитыРасчетовНеопределено
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Истина,, РеквизитыРасчетовСоответствие);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями()

// Возвращает текст запроса для получения курсовых разниц при расчетах с покупателями при возвратах.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   СЗачетомАванса - Булево - Признак необходимости отражения зачета авансов
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//   ПолучатьРеквизитыРасчетов - Булево - Признак необходимости получения дополнительных реквизитов движений для
//                                        расчетов с контрагентами
//   РеквизитыРасчетовСоответствие - Соответствие - Временное соответствие дополнительных реквизитов движений для
//                                                  расчетов с контрагентами
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиВозвраты(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ПолучатьРеквизитыРасчетов = Ложь, РеквизитыРасчетовСоответствие = Неопределено) Экспорт 
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПокупателямиВозвраты");
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвраты
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Ложь,, РеквизитыРасчетовСоответствие);
		
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|	СУММА(РасчетыОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаДляОстатка
		|		КОНЕЦ КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаВалДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаВалДляОстатка
		|		КОНЕЦ КАК СуммаВалОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаРег
		|			ИНАЧЕ - ВременнаяТаблица.СуммаРег
		|		КОНЕЦ КАК СуммаРегОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ВременнаяТаблица
		|	ГДЕ
		|	ВременнаяТаблица.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Заказ,
		|						ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля
		|		И ДвиженияДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) КАК СуммаКурсовойРазницыРег,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Договор.ВалютаРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		|	И (		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) >= 0.005
		|		ИЛИ	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс / КурсыВалютРасчетовСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) <= -0.005 ) 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.ВидДвижения,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	СУММА(ТаблицаДвижений.Сумма),
		|	СУММА(ТаблицаДвижений.СуммаВал),
		|	СУММА(ТаблицаДвижений.СуммаРег),
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	&РеквизитыРасчетовНеопределено
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК Сумма,
		|		0 КАК СуммаВал,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег КАК СуммаРег,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100)) КАК СодержаниеПроводки
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаРег) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаРег) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвраты
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег КАК СуммаКурсовойРазницыРег
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ВЫРАЗИТЬ(ТаблицаДокумента.Контрагент КАК Справочник.Контрагенты).СчетУчетаРасчетовСПокупателем,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		ТаблицаДокумента.СуммаКурсовойРазницыРег
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвратыПредварительная";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Истина,, РеквизитыРасчетовСоответствие);
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|	СУММА(РасчетыОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаДляОстатка
		|		КОНЕЦ КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаВалДляОстатка
		|			ИНАЧЕ - ВременнаяТаблица.СуммаВалДляОстатка
		|		КОНЕЦ КАК СуммаВалОстаток,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВременнаяТаблица.СуммаРег
		|			ИНАЧЕ - ВременнаяТаблица.СуммаРег
		|		КОНЕЦ КАК СуммаРегОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Заказ,
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаРег, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) КАК СуммаКурсовойРазницыРег,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвраты
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателямиВозвраты)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаРасчеты.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005
		|		ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) >= 0.005
		|		ИЛИ	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * ТаблицаРасчеты.Курс / ТаблицаРасчеты.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СуммаРег КАК СуммаРег,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	&РеквизитыРасчетов
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателямиВозвраты КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыРег > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыРег
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыРег
		|	КОНЕЦ,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница,
		|	&РеквизитыРасчетовНеопределено
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиВозвраты КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
		РасчетыПроведениеДокументов.ДобавитьТекстЗапросаРеквизитовРасчетов(ТекстЗапроса, ПолучатьРеквизитыРасчетов, Истина,, РеквизитыРасчетовСоответствие);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями()

// Возвращает текст запроса для получения курсовых разниц в денежных средствах.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаДенежныеСредства");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДеньгиОстатки.Организация КАК Организация,
		|	ДеньгиОстатки.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ДеньгиОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ДеньгиОстатки.Валюта КАК Валюта,
		|	ДеньгиОстатки.БанковскийСчетКасса.СчетУчета КАК СчетУчета,
		|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ДеньгиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|		ВременнаяТаблица.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|		ВременнаяТаблица.Валюта КАК Валюта,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаДенежныеСредства КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.ТипДенежныхСредств,
		|		ТаблицаОстатки.БанковскийСчетКасса,
		|		ТаблицаОстатки.Валюта,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредства.Остатки(
		|				&МоментВремени,
		|				(Организация, ТипДенежныхСредств, БанковскийСчетКасса, Валюта) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаДенежныеСредства.Организация,
		|						ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств,
		|						ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса,
		|						ВременнаяТаблицаДенежныеСредства.Валюта
		|					ИЗ
		|						ВременнаяТаблицаДенежныеСредства)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.ТипДенежныхСредств,
		|		ДвиженияДокумента.БанковскийСчетКасса,
		|		ДвиженияДокумента.Валюта,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредства КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК ДеньгиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДеньгиОстатки.Организация,
		|	ДеньгиОстатки.ТипДенежныхСредств,
		|	ДеньгиОстатки.БанковскийСчетКасса,
		|	ДеньгиОстатки.Валюта,
		|	ДеньгиОстатки.БанковскийСчетКасса.СчетУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ТипДенежныхСредств,
		|	БанковскийСчетКасса,
		|	Валюта,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаДенежныеСредства.Организация КАК Организация,
		|	ТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаДенежныеСредства.Валюта КАК Валюта,
		|	ТаблицаДенежныеСредства.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницДенежныеСредства
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредства КАК ТаблицаДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаДенежныеСредства.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаДенежныеСредства.ТипДенежныхСредств = ТаблицаОстатки.ТипДенежныхСредств
		|			И ТаблицаДенежныеСредства.БанковскийСчетКасса = ТаблицаОстатки.БанковскийСчетКасса
		|			И ТаблицаДенежныеСредства.Валюта = ТаблицаОстатки.Валюта
		|			И ТаблицаДенежныеСредства.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаДенежныеСредства.Валюта
		|					ИЗ
		|						ВременнаяТаблицаДенежныеСредства)) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
		|		ПО ТаблицаДенежныеСредства.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ТаблицаДокумента.Статья КАК Статья,
		|	ТаблицаДокумента.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ТаблицаДокумента.Аналитика
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредства КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ТипДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
		|	КОНЕЦ,
		|	ТаблицаДокумента.БанковскийСчетКасса,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
		|	КОНЕЦ
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаДенежныеСредства.Организация КАК Организация,
		|	ТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаДенежныеСредства.Валюта КАК Валюта,
		|	ТаблицаДенежныеСредства.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаДенежныеСредства.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницДенежныеСредства
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредства КАК ТаблицаДенежныеСредства
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ТаблицаДокумента.Статья КАК Статья,
		|	ТаблицаДокумента.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ТаблицаДокумента.Аналитика КАК Аналитика
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредства КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	ВидДвижения";
	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства()

// Возвращает текст запроса для получения курсовых разниц в денежных средствах в кассах ККМ.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаДенежныеСредстваВКассахККМ");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДеньгиОстатки.Организация КАК Организация,
		|	ДеньгиОстатки.КассаККМ КАК КассаККМ,
		|	ДеньгиОстатки.КассаККМ.СчетУчета КАК СчетУчета,
		|	ДеньгиОстатки.Валюта КАК Валюта,
		|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ДеньгиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.КассаККМ КАК КассаККМ,
		|		ВременнаяТаблица.Валюта КАК Валюта,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаДенежныеСредстваВКассахККМ КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.КассаККМ,
		|		ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|				&МоментВремени,
		|				(Организация, КассаККМ) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаДенежныеСредстваВКассахККМ.Организация,
		|						ВременнаяТаблицаДенежныеСредстваВКассахККМ.КассаККМ
		|					ИЗ
		|						ВременнаяТаблицаДенежныеСредстваВКассахККМ)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.КассаККМ,
		|		ДвиженияДокумента.КассаККМ.ВалютаДенежныхСредств,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК ДеньгиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДеньгиОстатки.Организация,
		|	ДеньгиОстатки.КассаККМ,
		|	ДеньгиОстатки.Валюта,
		|	ДеньгиОстатки.КассаККМ.СчетУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	КассаККМ,
		|	Валюта,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаДенежныеСредства.Организация КАК Организация,
		|	ТаблицаДенежныеСредства.КассаККМ КАК КассаККМ,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаДенежныеСредства.Валюта КАК Валюта,
		|	ТаблицаДенежныеСредства.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваВКассахККМ КАК ТаблицаДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаДенежныеСредства.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаДенежныеСредства.КассаККМ = ТаблицаОстатки.КассаККМ
		|			И ТаблицаДенежныеСредства.Валюта = ТаблицаОстатки.Валюта
		|			И ТаблицаДенежныеСредства.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаДенежныеСредстваВКассахККМ.Валюта
		|					ИЗ
		|						ВременнаяТаблицаДенежныеСредстваВКассахККМ)) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
		|		ПО ТаблицаДенежныеСредства.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.КассаККМ КАК КассаККМ,
		|	&ДвижениеЧекаВОткрытойСмене КАК ДвижениеЧекаВОткрытойСмене,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.КассаККМ,
		|	&ДвижениеЧекаВОткрытойСмене,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
	
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаДенежныеСредства.Организация КАК Организация,
		|	ТаблицаДенежныеСредства.КассаККМ КАК КассаККМ,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаДенежныеСредства.Валюта КАК Валюта,
		|	ТаблицаДенежныеСредства.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаДенежныеСредства.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваВКассахККМ КАК ТаблицаДенежныеСредства
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.КассаККМ КАК КассаККМ,
		|	&ДвижениеЧекаВОткрытойСмене КАК ДвижениеЧекаВОткрытойСмене,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	ВидДвижения";
	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ()

// Возвращает текст запроса для получения курсовых разниц при расчетах с подотчетниками.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПодотчетниками");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Сотрудник КАК Сотрудник,
		|	РасчетыОстатки.Валюта КАК Валюта,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Сотрудник КАК Сотрудник,
		|		ВременнаяТаблица.Валюта КАК Валюта,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПодотчетниками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Сотрудник,
		|		ТаблицаОстатки.Валюта,
		|		ТаблицаОстатки.Документ,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПодотчетниками.Остатки(
		|				&МоментВремени,
		|				(Организация, Сотрудник, Валюта, Документ) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПодотчетниками.Организация,
		|						ВременнаяТаблицаРасчетыСПодотчетниками.Сотрудник,
		|						ВременнаяТаблицаРасчетыСПодотчетниками.Валюта,
		|						ВременнаяТаблицаРасчетыСПодотчетниками.Документ
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПодотчетниками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Сотрудник,
		|		ДвиженияДокумента.Валюта,
		|		ДвиженияДокумента.Документ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПодотчетниками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Сотрудник,
		|	РасчетыОстатки.Валюта,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетниками
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Сотрудник,
		|	Валюта,
		|	Документ,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Сотрудник КАК Сотрудник,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Сотрудник = ТаблицаОстатки.Сотрудник
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.Валюта
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПодотчетниками.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПодотчетниками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Сотрудник,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Валюта,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Сотрудник КАК Сотрудник,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками()

// Возвращает текст запроса для получения курсовых разниц при расчетах с персоналом.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПерсоналом(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПерсоналом");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РасчетыОстатки.Сотрудник КАК Сотрудник,
		|	РасчетыОстатки.Валюта КАК Валюта,
		|	РасчетыОстатки.ПериодРегистрации КАК ПериодРегистрации,
		|	РасчетыОстатки.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ВременнаяТаблица.Сотрудник КАК Сотрудник,
		|		ВременнаяТаблица.Валюта КАК Валюта,
		|		ВременнаяТаблица.ПериодРегистрации КАК ПериодРегистрации,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.СтруктурнаяЕдиница,
		|		ТаблицаОстатки.Сотрудник,
		|		ТаблицаОстатки.Валюта,
		|		ТаблицаОстатки.ПериодРегистрации,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПерсоналом.Остатки(
		|				&МоментВремени,
		|				(Организация, СтруктурнаяЕдиница, Сотрудник, Валюта, ПериодРегистрации) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПерсоналом.Организация,
		|						ВременнаяТаблицаРасчетыСПерсоналом.СтруктурнаяЕдиница,
		|						ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник,
		|						ВременнаяТаблицаРасчетыСПерсоналом.Валюта,
		|						ВременнаяТаблицаРасчетыСПерсоналом.ПериодРегистрации
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПерсоналом)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.СтруктурнаяЕдиница,
		|		ДвиженияДокумента.Сотрудник,
		|		ДвиженияДокумента.Валюта,
		|		ДвиженияДокумента.ПериодРегистрации,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПерсоналом КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.СтруктурнаяЕдиница,
		|	РасчетыОстатки.Сотрудник,
		|	РасчетыОстатки.Валюта,
		|	РасчетыОстатки.ПериодРегистрации,
		|	РасчетыОстатки.Сотрудник.СчетРасчетовСПерсоналом
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СтруктурнаяЕдиница,
		|	Сотрудник,
		|	Валюта,
		|	ПериодРегистрации,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаРасчеты.Сотрудник КАК Сотрудник,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.ПериодРегистрации КАК ПериодРегистрации,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.СтруктурнаяЕдиница = ТаблицаОстатки.СтруктурнаяЕдиница
		|			И ТаблицаРасчеты.Сотрудник = ТаблицаОстатки.Сотрудник
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.Валюта
		|			И ТаблицаРасчеты.ПериодРегистрации = ТаблицаОстатки.ПериодРегистрации
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПерсоналом.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПерсоналом)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ПериодРегистрации КАК ПериодРегистрации,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Сотрудник,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
	
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаРасчеты.Сотрудник КАК Сотрудник,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.ПериодРегистрации КАК ПериодРегистрации,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ПериодРегистрации КАК ПериодРегистрации,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПерсоналом()

// Возвращает текст запроса для получения курсовых разниц при суммовом учете в рознице.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыСуммовойУчетВРознице(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаСуммовойУчетВРознице");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СуммовойУчетВРозницеОстатки.Организация КАК Организация,
		|	СуммовойУчетВРозницеОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СуммовойУчетВРозницеОстатки.СчетУчета КАК СчетУчета,
		|	СуммовойУчетВРозницеОстатки.Валюта КАК Валюта,
		|	СУММА(СуммовойУчетВРозницеОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(СуммовойУчетВРозницеОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ВременнаяТаблица.Валюта КАК Валюта,
		|		ВременнаяТаблица.СчетУчета КАК СчетУчета,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаСуммовойУчетВРознице КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.СтруктурнаяЕдиница,
		|		ТаблицаОстатки.Валюта,
		|		ТаблицаОстатки.СтруктурнаяЕдиница.СчетУчетаВРознице,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.СуммовойУчетВРознице.Остатки(
		|				&МоментВремени,
		|				(Организация, СтруктурнаяЕдиница, Валюта) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаСуммовойУчетВРознице.Организация,
		|						ВременнаяТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница,
		|						ВременнаяТаблицаСуммовойУчетВРознице.Валюта
		|					ИЗ
		|						ВременнаяТаблицаСуммовойУчетВРознице)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.СтруктурнаяЕдиница,
		|		ДвиженияДокумента.Валюта,
		|		ДвиженияДокумента.СтруктурнаяЕдиница.СчетУчетаВРознице,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.СуммовойУчетВРознице КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК СуммовойУчетВРозницеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	СуммовойУчетВРозницеОстатки.Организация,
		|	СуммовойУчетВРозницеОстатки.СтруктурнаяЕдиница,
		|	СуммовойУчетВРозницеОстатки.Валюта,
		|	СуммовойУчетВРозницеОстатки.СчетУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СтруктурнаяЕдиница,
		|	Валюта,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаСуммовойУчетВРознице.Организация КАК Организация,
		|	ТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаСуммовойУчетВРознице.Валюта КАК Валюта,
		|	ТаблицаСуммовойУчетВРознице.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице
		|ИЗ
		|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаСуммовойУчетВРознице
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаСуммовойУчетВРознице.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница = ТаблицаОстатки.СтруктурнаяЕдиница
		|			И ТаблицаСуммовойУчетВРознице.Валюта = ТаблицаОстатки.Валюта
		|			И ТаблицаСуммовойУчетВРознице.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаСуммовойУчетВРознице.Валюта
		|					ИЗ
		|						ВременнаяТаблицаСуммовойУчетВРознице)) КАК КурсыВалютКассаСрезПоследних
		|		ПО ТаблицаСуммовойУчетВРознице.Валюта = КурсыВалютКассаСрезПоследних.Валюта
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.Себестоимость КАК Себестоимость,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Валюта,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	0,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаСуммовойУчетВРознице.Организация КАК Организация,
		|	ТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаСуммовойУчетВРознице.Валюта КАК Валюта,
		|	ТаблицаСуммовойУчетВРознице.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице
		|ИЗ
		|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаСуммовойУчетВРознице
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.Себестоимость КАК Себестоимость,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыСуммовойУчетВРознице()

// Возвращает текст запроса для получения курсовых разниц при расчетах с прочими контрагентами.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   СЗачетомАванса - Булево - Признак необходимости отражения зачета авансов
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПрочимиКонтрагентами(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПрочимиКонтрагентами");
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентами
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
	
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПрочимиКонтрагентами.Договор.ВалютаРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПрочимиКонтрагентами)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период КАК Период,
		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	ТаблицаДвижений.Договор КАК Договор,
		|	ТаблицаДвижений.Документ КАК Документ,
		|	ТаблицаДвижений.Заказ КАК Заказ,
		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.Сумма КАК Сумма,
		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ТаблицаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентами
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком,
		|		ТаблицаДокумента.СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентамиПредварительная";
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентами
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПрочимиКонтрагентами.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПрочимиКонтрагентами)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПрочимиКонтрагентами КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПрочимиКонтрагентами КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками()

// Возвращает текст запроса для получения курсовых разниц по денежным средствам к поступлению.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваКПоступлению(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаДенежныеСредстваКПоступлению");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДеньгиОстатки.Организация КАК Организация,
		|	ДеньгиОстатки.Касса КАК Касса,
		|	&СчетУчета КАК СчетУчета,
		|	ДеньгиОстатки.ДокументПередачи КАК ДокументПередачи,
		|	ДеньгиОстатки.Валюта КАК Валюта,
		|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ДеньгиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Касса КАК Касса,
		|		ВременнаяТаблица.ДокументПередачи КАК ДокументПередачи,
		|		ВременнаяТаблица.Валюта КАК Валюта,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаДенежныеСредстваКПоступлению КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Касса,
		|		ТаблицаОстатки.ДокументПередачи,
		|		ТаблицаОстатки.ДокументПередачи.ВалютаДенежныхСредств,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваКПоступлению.Остатки(
		|				&МоментВремени,
		|				(Организация, Касса) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаДенежныеСредстваКПоступлению.Организация,
		|						ВременнаяТаблицаДенежныеСредстваКПоступлению.Касса
		|					ИЗ
		|						ВременнаяТаблицаДенежныеСредстваКПоступлению)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Касса,
		|		ДвиженияДокумента.ДокументПередачи,
		|		ДвиженияДокумента.ДокументПередачи.ВалютаДенежныхСредств,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваКПоступлению КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК ДеньгиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДеньгиОстатки.Организация,
		|	ДеньгиОстатки.Касса,
		|	ДеньгиОстатки.ДокументПередачи,
		|	ДеньгиОстатки.Валюта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Касса,
		|	ДокументПередачи,
		|	Валюта,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаДенежныеСредства.Организация КАК Организация,
		|	ТаблицаДенежныеСредства.Касса КАК Касса,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаДенежныеСредства.Валюта КАК Валюта,
		|	ТаблицаОстатки.ДокументПередачи КАК ДокументПередачи,
		|	&СчетУчета КАК СчетУчета,
		|	ТаблицаДенежныеСредства.КассаОтправитель КАК КассаОтправитель
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницДенежныеСредстваКПоступлению
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваКПоступлению КАК ТаблицаДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаДенежныеСредства.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаДенежныеСредства.Касса = ТаблицаОстатки.Касса
		|			И ТаблицаДенежныеСредства.Валюта = ТаблицаОстатки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаДенежныеСредстваКПоступлению.Валюта
		|					ИЗ
		|						ВременнаяТаблицаДенежныеСредстваКПоступлению)) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
		|		ПО ТаблицаДенежныеСредства.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.Касса КАК Касса,
		|	ТаблицаДокумента.ДокументПередачи КАК ДокументПередачи,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ТаблицаДокумента.КассаОтправитель КАК КассаОтправитель
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваКПоступлению КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.Касса,
		|	ТаблицаДокумента.ДокументПередачи,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	&КурсоваяРазница,
		|	ТаблицаДокумента.КассаОтправитель
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваКПоступлению КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
	
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаДенежныеСредства.Организация КАК Организация,
		|	ТаблицаДенежныеСредства.Касса КАК Касса,
		|	ТаблицаДенежныеСредства.ДокументПередачи КАК ДокументПередачи,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаДенежныеСредства.Валюта КАК Валюта,
		|	ТаблицаДенежныеСредства.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	&СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницДенежныеСредстваКПоступлению
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваКПоступлению КАК ТаблицаДенежныеСредства
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ДоговорКонтрагента,
		|	ТаблицаДокумента.Касса КАК Касса,
		|	ТаблицаДокумента.ДокументПередачи КАК ДокументПередачи,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.КассаОтправитель КАК КассаОтправитель,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаДенежныеСредстваКПоступлению КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	ВидДвижения";
	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваКПоступлению()

// Возвращает текст запроса для получения курсовых разниц при расчетах по кредитам и займам.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//   ЕстьСтруктурнаяЕдиница - Булево - Признак наличия структурной единицы в исходном запросе
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймам(МенеджерВременныхТаблиц, НомерЗапроса, ЕстьСтруктурнаяЕдиница = Ложь) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыПоКредитамИЗаймам");
	
	Если РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 3;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.ВидДоговора КАК ВидДоговора,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	СУММА(РасчетыОстатки.ОсновнойДолгОстаток) КАК ОсновнойДолгОстаток,
		|	СУММА(РасчетыОстатки.ОсновнойДолгВалОстаток) КАК ОсновнойДолгВалОстаток,
		|	СУММА(РасчетыОстатки.ПроцентыОстаток) КАК ПроцентыОстаток,
		|	СУММА(РасчетыОстатки.ПроцентыВалОстаток) КАК ПроцентыВалОстаток,
		|	СУММА(РасчетыОстатки.КомиссияОстаток) КАК КомиссияОстаток,
		|	СУММА(РасчетыОстатки.КомиссияВалОстаток) КАК КомиссияВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.ВидДоговора КАК ВидДоговора,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|		ВременнаяТаблица.ОсновнойДолгДляОстатка КАК ОсновнойДолгОстаток,
		|		ВременнаяТаблица.ОсновнойДолгВалДляОстатка КАК ОсновнойДолгВалОстаток,
		|		ВременнаяТаблица.ПроцентыДляОстатка КАК ПроцентыОстаток,
		|		ВременнаяТаблица.ПроцентыВалДляОстатка КАК ПроцентыВалОстаток,
		|		ВременнаяТаблица.КомиссияДляОстатка КАК КомиссияОстаток,
		|		ВременнаяТаблица.КомиссияВалДляОстатка КАК КомиссияВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.ВидДоговора,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.ДоговорКредитаЗайма,
		|		ЕСТЬNULL(ТаблицаОстатки.ОсновнойДолгОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.ОсновнойДолгВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.ПроцентыОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.ПроцентыВалОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.КомиссияОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.КомиссияВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, ДоговорКредитаЗайма, ВидДоговора) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Организация,
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Контрагент,
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма,
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам.ВидДоговора
		|					ИЗ
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.ВидДоговора,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.ДоговорКредитаЗайма,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.ОсновнойДолг, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.ОсновнойДолг, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.ОсновнойДолгВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.ОсновнойДолгВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Проценты, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Проценты, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.ПроцентыВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.ПроцентыВал, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Комиссия, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Комиссия, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.КомиссияВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.КомиссияВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыПоКредитамИЗаймам КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.ВидДоговора,
		|	РасчетыОстатки.ДоговорКредитаЗайма
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	ВидДоговора,
		|	ДоговорКредитаЗайма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВидДоговора КАК ВидДоговора,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ВЫРАЗИТЬ(ТаблицаРасчеты.ДоговорКредитаЗайма КАК Документ.ДоговорКредитаИЗайма) КАК ДоговорКредитаЗайма,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
		|	ЕСТЬNULL(ТаблицаОстатки.ОсновнойДолгВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.ОсновнойДолгОстаток, 0) КАК СуммаКурсовойРазницыОсновнойДолг,
		|	ЕСТЬNULL(ТаблицаОстатки.ПроцентыВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.ПроцентыОстаток, 0) КАК СуммаКурсовойРазницыПроценты,
		|	ЕСТЬNULL(ТаблицаОстатки.КомиссияВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.КомиссияОстаток, 0) КАК СуммаКурсовойРазницыКомиссия
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазниц
		|ИЗ
		|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.ВидДоговора = ТаблицаОстатки.ВидДоговора
		|			И ТаблицаРасчеты.ДоговорКредитаЗайма = ТаблицаОстатки.ДоговорКредитаЗайма
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыПоКредитамИЗаймам)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютРасчетовСрезПоследних.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаКурсовыхРазниц.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаКурсовыхРазниц.Дата КАК Дата,
		|	ВременнаяТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ВременнаяТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаКурсовыхРазниц.ВидДоговора КАК ВидДоговора,
		|	ВременнаяТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ВременнаяТаблицаКурсовыхРазниц.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	ВременнаяТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыОсновнойДолг КАК СуммаКурсовойРазницыОсновнойДолг,
		|	0 КАК СуммаКурсовойРазницыПроценты,
		|	0 КАК СуммаКурсовойРазницыКомиссия,
		|	ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыОсновнойДолг КАК СуммаКурсовойРазницы
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазниц КАК ВременнаяТаблицаКурсовыхРазниц
		|ГДЕ
		|	(ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыОсновнойДолг >= 0.005
		|			ИЛИ ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыОсновнойДолг <= -0.005)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаКурсовыхРазниц.НомерСтроки,
		|	ВременнаяТаблицаКурсовыхРазниц.Дата,
		|	ВременнаяТаблицаКурсовыхРазниц.Организация,
		|	ВременнаяТаблицаКурсовыхРазниц.Контрагент,
		|	ВременнаяТаблицаКурсовыхРазниц.ВидДоговора,
		|	ВременнаяТаблицаКурсовыхРазниц.Валюта,
		|	ВременнаяТаблицаКурсовыхРазниц.ДоговорКредитаЗайма,
		|	ВременнаяТаблицаКурсовыхРазниц.СчетУчета,
		|	0,
		|	ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыПроценты,
		|	0,
		|	ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыПроценты
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазниц КАК ВременнаяТаблицаКурсовыхРазниц
		|ГДЕ
		|	(ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыПроценты >= 0.005
		|			ИЛИ ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыПроценты <= -0.005)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаКурсовыхРазниц.НомерСтроки,
		|	ВременнаяТаблицаКурсовыхРазниц.Дата,
		|	ВременнаяТаблицаКурсовыхРазниц.Организация,
		|	ВременнаяТаблицаКурсовыхРазниц.Контрагент,
		|	ВременнаяТаблицаКурсовыхРазниц.ВидДоговора,
		|	ВременнаяТаблицаКурсовыхРазниц.Валюта,
		|	ВременнаяТаблицаКурсовыхРазниц.ДоговорКредитаЗайма,
		|	ВременнаяТаблицаКурсовыхРазниц.СчетУчета,
		|	0,
		|	0,
		|	ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыКомиссия,
		|	ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыКомиссия
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазниц КАК ВременнаяТаблицаКурсовыхРазниц
		|ГДЕ
		|	(ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыКомиссия >= 0.005
		|			ИЛИ ВременнаяТаблицаКурсовыхРазниц.СуммаКурсовойРазницыКомиссия <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	1 КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	ТаблицаДокумента.ВидДоговора КАК ВидДоговора,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
		|	ТаблицаДокумента.ОсновнойДолг КАК ОсновнойДолг,
		|	ТаблицаДокумента.ОсновнойДолгВал КАК ОсновнойДолгВал,
		|	ТаблицаДокумента.Проценты КАК Проценты,
		|	ТаблицаДокумента.ПроцентыВал КАК ПроцентыВал,
		|	ТаблицаДокумента.Комиссия КАК Комиссия,
		|	ТаблицаДокумента.КомиссияВал КАК КомиссияВал,
		|	ТаблицаДокумента.ОсновнойДолг + ТаблицаДокумента.Проценты + ТаблицаДокумента.Комиссия КАК Сумма,
		|	ТаблицаДокумента.ОсновнойДолгВал + ТаблицаДокумента.ПроцентыВал + ТаблицаДокумента.КомиссияВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ТаблицаДокумента.УдержаноИзЗарплаты КАК УдержаноИзЗарплаты,
		|	"""" КАК СтруктурнаяЕдиница
		|ИЗ
		|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	1,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг > 0
		|				ИЛИ ТаблицаДокумента.СуммаКурсовойРазницыПроценты > 0
		|				ИЛИ ТаблицаДокумента.СуммаКурсовойРазницыКомиссия > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.ДоговорКредитаЗайма,
		|	ТаблицаДокумента.ВидДоговора,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыПроценты > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыПроценты
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыПроценты
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыКомиссия > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыКомиссия
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыКомиссия
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыОсновнойДолг
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыПроценты > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыПроценты
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыПроценты
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницыКомиссия > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницыКомиссия
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницыКомиссия
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	&КурсоваяРазница,
		|	ЛОЖЬ,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	Иначе
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВидДоговора КАК ВидДоговора,
		|	ТаблицаРасчеты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам
		|ИЗ
		|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	1 КАК НомерСтроки,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	ТаблицаДокумента.ВидДоговора КАК ВидДоговора,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ОсновнойДолг КАК ОсновнойДолг,
		|	ТаблицаДокумента.ОсновнойДолгВал КАК ОсновнойДолгВал,
		|	ТаблицаДокумента.Проценты КАК Проценты,
		|	ТаблицаДокумента.ПроцентыВал КАК ПроцентыВал,
		|	ТаблицаДокумента.Комиссия КАК Комиссия,
		|	ТаблицаДокумента.КомиссияВал КАК КомиссияВал,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ТаблицаДокумента.УдержаноИзЗарплаты КАК УдержаноИзЗарплаты,
		|	ТаблицаДокумента.ОсновнойДолгВал + ТаблицаДокумента.ПроцентыВал + ТаблицаДокумента.КомиссияВал КАК СуммаВал,
		|	ТаблицаДокумента.ОсновнойДолг + ТаблицаДокумента.Проценты + ТаблицаДокумента.Комиссия КАК Сумма,
		|	"""" КАК СтруктурнаяЕдиница
		|ИЗ
		|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки";
		
	КонецЕсли;
	
	Если ЕстьСтруктурнаяЕдиница Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК СтруктурнаяЕдиница", "ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймам()

// Возвращает текст запроса для получения курсовых разниц по прочим операциям.
//
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц запроса инициализации данных документа
//   НомерЗапроса - Число - Номер запроса итоговой таблицы в менеджере временных таблиц
//
// Возвращаемое значение:
//   Строка - текст запроса с временными таблицами курсовых разниц
//
Функция ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациям(МенеджерВременныхТаблиц, НомерЗапроса) Экспорт
	
	РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаПрочиеРасчеты");
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты
		|ИЗ
		|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Комментарий
		|ИЗ
		|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	ВидДвижения";
	
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.СчетУчета КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.СчетУчета КАК СчетУчета,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаПрочиеРасчеты КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.СчетУчета,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, СчетУчета) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаПрочиеРасчеты.Организация,
		|						ВременнаяТаблицаПрочиеРасчеты.Контрагент,
		|						ВременнаяТаблицаПрочиеРасчеты.Договор,
		|						ВременнаяТаблицаПрочиеРасчеты.СчетУчета
		|					ИЗ
		|						ВременнаяТаблицаПрочиеРасчеты)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.СчетУчета,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПрочимиКонтрагентами КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.СчетУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты
		|ИЗ
		|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаПрочиеРасчеты.Валюта
		|					ИЗ
		|						ВременнаяТаблицаПрочиеРасчеты)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Договор.ВалютаРасчетов = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) >= 0
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	ТаблицаДокумента.Комментарий
		|ИЗ
		|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.СчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница,
		|	""""
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациям()

// Добавляет дополнительные поля в таблицу движений для отражения передачи товаров.
//
// Параметры:
//   ТаблицаДвижений - ТаблицаЗначений - Таблица в которую необходимо добавить дополнительные поля для отражения
//                                       передачи товаров
//   СписокПолей - Строка - Список полей строкой через запятую
//
Процедура ДобавитьПоляДляПередачиТоваров(ТаблицаДвижений, СписокПолей) Экспорт
	
	МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокПолей, ",");
	Для Каждого КолонкаТаблицы Из МассивПолей Цикл
		ТаблицаДвижений.Колонки.Добавить(КолонкаТаблицы+"Инт", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2))); // АПК:1036
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
		Для Каждого КолонкаТаблицы Из МассивПолей Цикл
			СтрокаТаблицы[КолонкаТаблицы+"Инт"] = СтрокаТаблицы[КолонкаТаблицы]; // АПК:1036
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Помещает движения по курсовой разницы из таблицы ТаблицаДенежныеСредства в таблицу ТаблицаДвиженияДенежныхСредств.
//
// Параметры:
//   СтруктураДополнительныеСвойства - Структура - Данные проведения документа
//
Процедура ДополнитьДвиженияДенежныхСредствКурсовойРазницей(СтруктураДополнительныеСвойства) Экспорт
	
	Если НЕ Константы.ФункциональнаяУчетВалютныхОпераций.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.ЧастотаРасчетаКурсовыхРазниц.Получить() <> Перечисления.ЧастотаРасчетаКурсовыхРазниц.ВМоментВыполненияОпераций Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДенежныхСредств Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства Цикл
		
		Если (СтрокаДенежныхСредств.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница
			Или СтрокаДенежныхСредств.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
			И (СтрокаДенежныхСредств.Аналитика = ПланыСчетов.Управленческий.ПрочиеРасходы
			Или СтрокаДенежныхСредств.Аналитика = ПланыСчетов.Управленческий.ПрочиеДоходы) Тогда
			
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДвиженияДенежныхСредств.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДенежныхСредств);
			
			НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
			
			Если СтрокаДенежныхСредств.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаПриход = СтрокаДенежныхСредств.Сумма;
				НоваяСтрока.СуммаПриходВал = СтрокаДенежныхСредств.СуммаВал;
			Иначе
				НоваяСтрока.СуммаРасход = СтрокаДенежныхСредств.Сумма;
				НоваяСтрока.СуммаРасходВал = СтрокаДенежныхСредств.СуммаВал;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, ИмяВременнойТаблицыРасчетов)
	
	РассчитыватьКурсовыеРазницы = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	
	Если РассчитыватьКурсовыеРазницы Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаРасчеты.Валюта КАК Валюта
		|ИЗ
		|	%ВременнаяТаблицаРасчеты% КАК ТаблицаРасчеты
		|ГДЕ
		|	ТаблицаРасчеты.Валюта <> &ВалютаУчета";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВременнаяТаблицаРасчеты%", ИмяВременнойТаблицыРасчетов);
		Запрос = Новый Запрос();
		Запрос.Текст = ТекстЗапроса;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
		РассчитыватьКурсовыеРазницы = НЕ Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Если РассчитыватьКурсовыеРазницы Тогда
		ЧастотаРасчетаКурсовыхРазниц = Константы.ЧастотаРасчетаКурсовыхРазниц.Получить();
		Если ЧастотаРасчетаКурсовыхРазниц = Перечисления.ЧастотаРасчетаКурсовыхРазниц.ВМоментВыполненияОпераций Тогда
			РассчитыватьКурсовыеРазницы = Истина;
		Иначе
			РассчитыватьКурсовыеРазницы = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РассчитыватьКурсовыеРазницы;
	
КонецФункции // ПолучитьНеобходимостьРасчетаКурсовыхРазниц()

#КонецОбласти
