
#Область СлужебныеПроцедурыИФункции

Процедура ПодписатьЗаявкуЭП(Форма, ОписаниеОповещения) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.ЭлектронныйДокумент) Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(Форма.ЭлектронныйДокумент, Форма.УникальныйИдентификатор);
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция",            	НСтр("ru = 'Подписание файла'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных",     	НСтр("ru = 'Файл'"));
	ОписаниеДанных.Вставить("Данные",              	ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	ОписаниеДанных.Вставить("Представление",       	ДанныеФайла.ИмяФайла);
	ОписаниеДанных.Вставить("Объект",				Форма.ЭлектронныйДокумент);
	
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, Форма, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти