
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет вид оплаты "Платежная карта" с привязкой к платежной системе "Сертификат НСПК".
//
// Параметры:
//  ВидОплаты - ПеречислениеСсылка - Перечисление.ВидыБезналичныхОплат.
//
Процедура ЗаполнитьВидОплатыПлатежнаяКартаНСПК(ВидОплаты) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьВидОплатыПлатежнаяКартаНСПК(ВидОплаты);
	
КонецПроцедуры

// Заполняет вид оплаты "Платежная система" с привязкой к платежной системе "Сертификат НСПК".
//
// Параметры:
//  ВидОплаты - ПеречислениеСсылка - Перечисление.ВидыБезналичныхОплат.
//
Процедура ЗаполнитьВидОплатыПлатежнаяСистемаНСПК(ВидОплаты) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьВидОплатыПлатежнаяСистемаНСПК(ВидОплаты);
	
КонецПроцедуры

// Заполняет общие параметры подключения к сервису НСПК.
//
// Параметры:
//  ПараметрыПодключения - Структура - содержит значения по ключам АдресСервисаНСПК, КлючДоступаНСПК, ИнтернетПроксиНСПК.
//
Процедура ЗаполнитьПараметрыПодключенияНСПК(ПараметрыПодключения) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьПараметрыПодключенияНСПК(ПараметрыПодключения);
	
КонецПроцедуры

// Заполняет параметры операции НСПК по кассе.
//
// Параметры:
//  ПараметрыОперации - Структура - ЭлектронныеСертификатыНСПК.ПараметрыОперацииНСПК()
//  КассаККМ - СправочникСсылка.КассыККМ - Касса ККМ, для которой необходимо получить параметры операции;
//  ИдентификаторКорзины - Строка - идентификатор корзины для операции возврата;
//  ИдентификаторЗапроса - Строка - идентификатор запроса операции.
//
Процедура ЗаполнитьПараметрыОперацииНСПКПоКассеККМ(ПараметрыОперации, КассаККМ, ИдентификаторКорзины = "", ИдентификаторЗапроса = "0") Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьПараметрыОперацииНСПКПоКассеККМ(ПараметрыОперации, КассаККМ, ИдентификаторКорзины, ИдентификаторЗапроса);
	
КонецПроцедуры

// Заполняет параметры подключения кассы к сервису НСПК.
//
// Параметры:
//  ПараметрыПодключения - Структура - содержит значения по ключам ИдентификаторНСПК, КлючКассыНСПК.
//  КассаККМ - СправочникСсылка.КассыККМ - Касса ККМ, для которой необходимо получить параметры подключения.
//
Процедура ЗаполнитьПараметрыПодключенияКассыНСПК(ПараметрыПодключения, КассаККМ) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьПараметрыПодключенияКассыНСПК(ПараметрыПодключения, КассаККМ);
	
КонецПроцедуры

// Возвращает параметры подключения организации к сервису НСПК.
//
// Параметры:
//  ПараметрыПодключения - Структура - содержит значения по ключам КлючОрганизацииНСПК.
//  Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить параметры подключения.
//
Процедура ЗаполнитьПараметрыПодключенияОрганизацииНСПК(ПараметрыПодключения, Организация) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьПараметрыПодключенияОрганизацииНСПК(ПараметрыПодключения, Организация);
	
КонецПроцедуры

// Заполняет результат передачи подтверждения операции ЭС НСПК.
//
// Параметры:
//  СуммаСертификатамиНСПК - Число - сумма, оплаченная сертификатом.
//  ЧекККМ - ДокументСсылка.ЧекККМ - Чек ККМ, который необходимо отправить для подтверждения операции с ЭС НСПК.
//
Процедура ЗаполнитьСуммуОплатыСертификатамиНСПК(СуммаОплаты, ЧекККМ) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьСуммуОплатыСертификатамиНСПК(СуммаОплаты, ЧекККМ);
	
КонецПроцедуры

// Проверяет подтверждение оплаты электронным сертификатом или платежной картой
// в табличной части "Оплата" чека ККМ в НСПК.
//
// Параметры:
//  ЧекККМ - ДокументОбъект.ЧекККМ - Чек ККМ, который необходимо проверить;
//  Отказ - Булево - флаг отказа от продолжения операции проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОплата(ЧекККМ, Отказ) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Создает виды оплат ЭС НСПК МИР и заполняет платежную систему если необходимо.
//
Процедура СоздатьВидыОплатНСПК() Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет параметры фискальной операции для отправки подтверждения в НСПК
// Параметры:
//  ПараметрыФискальнойОперации - Структура - ЭлектронныеСертификатыНСПК.ПараметрыОперацииНСПК()
//  ЧекККМ - ДокументСсылка.ЧекККМ - ЧекККМ, для которого получаются параметры операции
//
Процедура ЗаполнитьПараметрыФискальнойОперацииНСПК(ПараметрыФискальнойОперации, ЧекККМ) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьПараметрыФискальнойОперацииНСПК(ПараметрыФискальнойОперации, ЧекККМ);
	
КонецПроцедуры

// Проверяет возможность оплаты НСПК и заполняет форматированную строку
// с гиперссылками необходимых настроек.
// Параметры:
//  СтрокаСОшибками - ФорматированнаяСтрока - Строка с гиперссылками необходимых настроек
//  ФормаРМК - ФормаКлиентскогоПриложения - Форма рабочего места кассира
//
Процедура ПроверитьВозможностьОплатыНСПК(СтрокаСОшибками, ФормаРМК) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ПроверитьВозможностьОплатыНСПК(СтрокаСОшибками, ФормаРМК);
	
КонецПроцедуры

// Заполняет Организацию и КассуККМ по умолчанию
// для формы настроек НСПК.
//
// Параметры:
//  СтруктураОрганизацияКассаККМ - Структура с ключами Организация, КассаККМ;
//
Процедура ЗаполнитьЗначенияФормыНастроек(СтруктураОрганизацияКассаККМ) Экспорт
	
	ЭлектронныеСертификатыНСПКРМКУНФ.ЗаполнитьЗначенияФормыНастроек(СтруктураОрганизацияКассаККМ);
	
КонецПроцедуры

#КонецОбласти
