#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Ссылки на веб-сайты сервисов рассылок.
// 
// Возвращаемое значение:
//  СписокЗначений - Список ссылок:
//   * Ключ - ПеречислениеСсылка.СервисыМассовыхРассылок - Сервис рассылки.
//   * Значение - Строка - Ссылка на веб-сайт.
//
Функция СсылкиНаСтатьи() Экспорт
	
	СсылкиНаСтатьи = Новый СписокЗначений;
	СсылкиНаСтатьи.Добавить(Перечисления.СервисыМассовыхРассылок.SendPulse, "https://sendpulse.com");
	СсылкиНаСтатьи.Добавить(Перечисления.СервисыМассовыхРассылок.UniSender, "https://www.unisender.com");
	Возврат СсылкиНаСтатьи;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПредставлениеСервиса(ВыбранныйСервис) Экспорт
	
	ОбъектМетаданных = ВыбранныйСервис.Метаданные();
	ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(ВыбранныйСервис);
	Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Синоним;
	
КонецФункции

#КонецОбласти

#КонецЕсли