#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ВидыНалогов

Функция НалоговыйАгент(ВидНалога) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидНалога) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВидНалога = Перечисления.ВидыНалогов.НДФЛ
		Или ВидНалога = Перечисления.ВидыНалогов.НДФЛ_ДоходыСвышеПредельнойВеличины Тогда
		НалоговыйАгент = Истина;
	Иначе
		НалоговыйАгент = Ложь;
	КонецЕсли;
	
	Возврат НалоговыйАгент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
