
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
	"Справочник.СтруктурныеЕдиницы.Форма.ФормаРедактированияСчетовУчета",
	СтруктураПараметров(ПараметрКоманды),
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно,
	ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтруктураПараметров(ПараметрКоманды)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СчетУчетаВРознице", ПараметрКоманды.СчетУчетаВРознице);
	СтруктураПараметров.Вставить("СчетУчетаНаценки", ПараметрКоманды.СчетУчетаНаценки);
	СтруктураПараметров.Вставить("Ссылка", ПараметрКоманды.Ссылка);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти
