
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПомощникНастройкиКассовогоМеста

// Переопределяет запрос динамического списка.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора продавцов.
//	ИмяДинамическогоСписка - Строка - имя переопределяемого динамического списка.
//  Отказ - Булево.
//
Процедура ПереопределитьДинамическийСписокПомощникаНастройкиРМК(Форма, ИмяДинамическогоСписка, Отказ) Экспорт
	ОбщегоНазначенияРМКУНФ.ПереопределитьДинамическийСписокПомощникаНастройкиРМК(Форма, ИмяДинамическогоСписка, Отказ);
КонецПроцедуры

// Формирует запрос для отчета о подключенном оборудовании.
//
// Параметры:
//  Запрос - Запрос - запрос, для отчета о подключенном оборудовании.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросОтчетОПодключенномОборудовании(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросОтчетОПодключенномОборудовании(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для определения количества касс ККМ с отбором по организации и торговому объекту.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросКоличествоКассККМ(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросКоличествоКассККМ(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для определения подключенных касс ККМ в рабочему месту кассира.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросПодключенныеКассыККМ(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросПодключенныеКассыККМ(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для определения подключенных эквайринговых терминалов в рабочему месту кассира.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросПодключенныеЭквайринговыеТерминалы(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросПодключенныеЭквайринговыеТерминалы(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для определения терминалов с незаполненными тарифами за операции.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросТерминалыСПустымиТарифами(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросТерминалыСПустымиТарифами(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для отображения результатов настройки КассККМ.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросНастроенныеКассыККМВПомощнике(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросНастроенныеКассыККМВПомощнике(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для получения данных:
// Пакет 1: выборка организаций.
// Пакет 2: выборка торговых объектов.
// Пакет 3: выборка касс ККМ.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросДанныеПредприятия(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросДанныеПредприятия(Запрос, Форма);
КонецПроцедуры

// Формирует запрос для определения используемых видов оплат в помощнике настройки кассового места.
//
// Параметры:
//  Запрос - Запрос - запрос для переопределения.
//  Форма - ФормаКлиентскогоПриложения - форма помощника настройки кассового места.
//
Процедура СформироватьЗапросИспользуемыеВидыОплат(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросИспользуемыеВидыОплат(Запрос, Форма);
КонецПроцедуры

// Возвращает перечень доступных эквайринговых терминалов, для которых указаны кассы ККМ
// на этапе настройки РМК через интерфейс помощника настройки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки помощника рабочего места кассира.
//  Результат - Массив - исходные данные для переопределения.
//
Процедура ЭквайринговыеТерминалыСККМ(Форма, Результат) Экспорт

КонецПроцедуры

// Подготавливает данные для создания эквайрингового терминала через интерфейс помощника
// настройки РМК.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки помощника рабочего места кассира
//
Процедура ЗаполнитьТаблицуСозданияЭквайринговыхТерминалов(Форма) Экспорт

КонецПроцедуры

// Изменяет отображение страницы видов оплат
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки помощника рабочего места кассира
//
Процедура НастройкаСтраницыВидовОплат(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НастройкаСтраницыВидовОплат(Форма);
	
КонецПроцедуры

// Изменяет видимость сценария настроек РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки помощника рабочего места кассира
//
Процедура НастройкаОтображенияСценария(Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.НастройкаОтображенияСценария(Форма);
КонецПроцедуры

// Заполняет текст запроса для определения кодов запроса
//
// Параметры:
//  ТекстЗапроса - Строка -текст запроса кодов запроса
//
Процедура СформироватьТекстЗапросаКассира(ТекстЗапроса) Экспорт

КонецПроцедуры

// Создает группы доступа по-умолчанию, если они не созданы
// по профилям группы доступа Администратор, Кассир, Старший кассир
Процедура СоздатьГруппыДоступаПоУмолчанию() Экспорт

КонецПроцедуры

// Заполняет таблицу сотрудников по данным физических лиц
//
// Параметры:
//  АдресХранилищаТаблицы - Строка - адрес временного хранилища таблицы сотрудников
//   *ФизическоеЛицо - ОпределяемыйТип.ФизическоеЛицо - физическое лицо с признаком сотрудник
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - Торговый объект для которого происходит настройка РМК
//
Процедура ЗаполнитьТаблицуСотрудников(АдресХранилищаТаблицы, ТорговыйОбъект) Экспорт
	

	
КонецПроцедуры

// Создает пользователей по переданному массиву физических лиц
//
// Параметры:
//  МассивФизическихЛиц - Массив - Массив переданных физических лиц
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - Торговый объект для которого происходит настройка РМК
//
Процедура СоздатьПользователейПоМассивуФизЛиц(МассивФизическихЛиц, ТорговыйОбъект) Экспорт
	

	
КонецПроцедуры

// Заполняет текст запроса дерева группы доступа
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса дерево группы доступа
//
Процедура ЗаполнитьТекстЗапросаДеревоГруппыДоступа(ТекстЗапроса) Экспорт
	

	
КонецПроцедуры

// Проверяет наличие записи персонального кода
//
// Параметры:
//  ВыбраннаяСтрока - РегистрСведенийКлючЗаписи.КассирыДляВхода - значение записи персонального кода
//  НетЗаписи - Булево - значение наличия записи
//  ДанныеЗаписи - Структура - ключевые параметры для поиска записи регистра
//  * Пользователь - ОпределяемыйТип.ПользовательРМК - пользователь записи регистра
//  * ФизическоеЛицо - ОпределяемыйТип.ФизическоеЛицо - физическое лицо записи регистра
//
Процедура ПроверитьИНайтиЗаписьПерсональныйКод(ВыбраннаяСтрока, НетЗаписи, ДанныеЗаписи) Экспорт
	

	
КонецПроцедуры

// Процедура создает пользователей информационной базы Кассир, Старший Кассир, Администратор, если не используется обмен физическими лицами
//
// Параметры:
//  ПродавцыНеПередаются - Булево - признак обмена физическими лицами
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект для которого происходит настройка
//
Процедура СоздатьПользователейПриПервоначальномЗаполнении(ПродавцыНеПередаются, ТорговыйОбъект) Экспорт
	

	
КонецПроцедуры

// Процедура устанавливает рабочее место кассы ККМ в соответствии с оборудованием.
//
// Параметры:
//  КассаККМОбъект - ОпределяемыйТип.КассаККМРМК - касса ккм
//  ПодключаемоеОборудование - ОпределяемыйТип.ПодключаемоеОборудованиеРМК - подключаемое оборудование
//
Процедура УстановитьРабочееМестоКассыККМ(КассаККМОбъект, ПодключаемоеОборудование) Экспорт
	

	
КонецПроцедуры

// Процедура заполняет описание настройки синхронизации
//
// Параметры:
//  ОписаниеСтрокиПриложения - Структура - Структура описания строки приложения.
//  ЕстьОшибки				 - Булево - Признак наличия ошибок.
//  УзелОбмена				 - ПланыОбмена.ОбменСУРМК	 - узел обмена 1с:РМК
//
Процедура ЗаполнитьНастройкиСинхронизации(ОписаниеСтрокиПриложения, ЕстьОшибки, УзелОбмена) Экспорт

КонецПроцедуры

// Переопределяет запрос динамического списка сотрудников.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора продавцов.
//	МассивСотрудников - Массив - Массив активированных сотрудников.
//
Процедура ПереопределитьЗапросТаблицыСотрудников(Форма, МассивСотрудников) Экспорт
	ОбщегоНазначенияРМКУНФ.ПереопределитьЗапросТаблицыСотрудников(Форма, МассивСотрудников);
КонецПроцедуры

// Процедура проверяет наличие роли разрешающий просмотр и изменение кассиров.
//
// Параметры:
//  ЕстьПравоПросмотра	 - Булево	 - Признак разрешения просмотра карточки сотрудника.
//
Процедура ПроверитьДоступностьПросмотраСотрудников(ЕстьПравоПросмотра) Экспорт
	
	ЕстьПравоПросмотра = Истина;
	ОбщегоНазначенияРМКУНФ.ПроверитьДоступностьПросмотраСотрудников(ЕстьПравоПросмотра);
	
КонецПроцедуры

// Процедура сохраняет изменения сверки для кассы ккм
//
// Параметры:
//  НастраиваемаяКассаККМ      - ОпределяемыйТип.КассаККМРМК - Касса ккм для изменения.
//  СверятьДанныеССервисомОФД  - Булево - Признак сверки с сервисом ОФД.
//
Процедура СохранитьИзмененияКассыККМ(НастраиваемаяКассаККМ, СверятьДанныеССервисомОФД) Экспорт
	
КонецПроцедуры

// Заполняет префикс штрихкода весового товара
//
// Параметры:
//  ПрефиксШтрихкодаВесовогоТовара - Число - значение константы ПрефиксШтрихкодаВесовогоТовара
//
Процедура ЗаполнитьПрефиксШтрихкодаВесовогоТовара(ПрефиксШтрихкодаВесовогоТовара) Экспорт

КонецПроцедуры

// Заполняет шаблон штрихкода товара
//
// Параметры:
//  ШаблонШтрихкодаТовара - ОпределяемыйТип.ШаблонШтрихкодаВесовыхТоваровРМК - значение константы ШаблонШтрихкодаВесовыхТоваров
//
Процедура ЗаполнитьШаблонШтрихкодаТовара(ШаблонШтрихкодаТовара) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс_ПереопределениеАутентификацииПользователейПоКодамДоступа

// Проверяет наличие ошибок при настройке текущего пользователя 
//
// Параметры:
//  Отказ - Истина - признак наличия отказа, выставляется при выявлении ошибки настройки.
//  ТекстЗаголовка - Строка - текст заголовка ошибки для передачи в заголовок панели ошибок формы РМК.
//  ТекстСообщения - Строка - текст ошибки для передачи в тело ошибки панели ошибок формы РМК.
//
//
Процедура ПроверитьНастройкиПользователя(Отказ, ТекстЗаголовка, ТекстСообщения) Экспорт
	ОбщегоНазначенияРМКУНФ.ПроверитьНастройкиПользователя(Отказ, ТекстЗаголовка, ТекстСообщения);
КонецПроцедуры

// Заполняет значение нового кода доступа для сотрудника.
//
// Параметры:
//  НовыйКодСотрудника - Строка - новый код доступа сотрудника.
//
Процедура ЗаполнитьНовыйКодДоступаКассира(НовыйКодСотрудника) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНовыйКодДоступаКассира(НовыйКодСотрудника);
КонецПроцедуры

// Заполняет изображение штрихкода в табличном документе.
//
// Параметры:
//  КодКассира - Строка - исходные данные кода доступа кассира для выведения в виде сканируемого изображения
//  Наименование - Строка - исходные данные кассира для выведения в виде сканируемого изображения
//  Результат - ТабличныйДокумент - табличный документ, в котором необходимо вывести изображение штрихкода.
//
Процедура ПодготовитьКодДоступаПользователяДляСохранения(КодКассира, Наименование, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ПодготовитьКодДоступаПользователяДляСохранения(КодКассира, Наименование, Результат);
КонецПроцедуры

// Формирует запрос на получение паролей текущего пользователя.
// Запрос должен получать все коды доступа для текущего пользователя.
//
// Параметры:
//  Запрос - Запрос - запрос, для проверки кодов доступа у пользователя.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура СформироватьЗапросПолученияКодовДоступаПользователя(Запрос, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросПолученияКодовДоступаПользователя(Запрос, Форма);
КонецПроцедуры

// Отправляет email.
//
// Параметры:
//  Результат - Булево - признак выполнения операции отправки email.
//  ТемаПисьма - Строка - тема отправляемого email.
//  ТелоПисьма - Строка - тело текста отправляемого email .
//  АдресаПолучателей - Строка - адреса получателей через разделитель.
//  РазделительАдресовПолучателей - Строка - разделитель для адресов получателей.
//
Процедура ОтправитьEmail(Результат, ТемаПисьма, ТелоПисьма, АдресаПолучателей,
	РазделительАдресовПолучателей = ";") Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОтправитьEmail(Результат, ТемаПисьма, ТелоПисьма, АдресаПолучателей,
		РазделительАдресовПолучателей);
КонецПроцедуры

// Формирует запрос для получения последнего внутреннего штрихкода в базе.
// В выборке должно быть поле "Код".
//
// Параметры:
//  Запрос - Запрос - переопределяемый запрос.
//  ПрефиксВнутреннегоШтрихкода - Число - префикс для внутреннего штрихкода.
//  ПрефиксШтрихкодаИБ - Число - префикс для информационной базы.
//
Процедура СформироватьЗапросПоследнийШтрихкод(Запрос, ПрефиксВнутреннегоШтрихкода, ПрефиксШтрихкодаИБ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросПоследнийШтрихкод(Запрос, ПрефиксВнутреннегоШтрихкода, ПрефиксШтрихкодаИБ);
	
КонецПроцедуры

// Записывает код доступа владельца в базу данных и меняет значение признака успешности записи кода доступа.
//
// Параметры:
//  Владелец - ОпределяемыйТип.ВладелецШтрихкодаРМК - владелец кода доступа.
//  КодДоступа - Строка - код доступа для записи в базу данных.
//
Процедура УстановитьКодДоступаКассиру(Владелец, КодДоступа) Экспорт
	
	ОбщегоНазначенияРМКУНФ.УстановитьКодДоступаКассиру(Владелец, КодДоступа);
	
КонецПроцедуры

// Перезаполняет адрес электронной почты кассира из карты лояльности, при ее наличии
//
// Параметры:
//  Кассир - ОпределяемыйТип.КассирРМК
//  АдресЭлектроннойПочты - Строка
//
Процедура ЗаполнитьАдресЭлектроннойПочтыКассира(Кассир, АдресЭлектроннойПочты) Экспорт

КонецПроцедуры

// Заполняет значение нового кода доступа для кассира.
//
// Параметры:
//  НовыйКодСотрудника - Строка - новый код доступа сотрудника.
//
Процедура ЗаполнитьНовыйКодДоступаКассирДляВхода(НовыйКодСотрудника) Экспорт
	

	
КонецПроцедуры

// Записывает код доступа в базу данных.
//
// Параметры:
//  Владелец - ОпределяемыйТип.КассирРМК - владелец кода доступа.
//  КодДоступа - Строка - код доступа для записи в базу данных.
//
Процедура УстановитьКодДоступаКассируДляВхода(Владелец, КодДоступа) Экспорт
	

	
КонецПроцедуры

// Заполняет признак возможности отправки электронной почты без функциональности БСП.
//
// Параметры:
//  Результат - Булево - Истина, если возможно отправить почту без использования БСП.
//
Процедура ЗаполнитьПризнакДоступнаОтправкаПочтыБезБСП(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакДоступнаОтправкаПочтыБезБСП(Результат);
КонецПроцедуры

#КонецОбласти

#Область ФормированиеЗапросов

// Формирует запрос для получения данных эквайринговый терминалов.
// В результате запроса должна быть заполнена таблица на форме РМК "ТаблицаТерминалы".
//
// Параметры:
//  Запрос - Запрос - запрос для получения данных ЭТ.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура СформироватьЗапросДанныеЭквайринговыхТерминалов(Запрос, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросДанныеЭквайринговыхТерминалов(Запрос, Форма);
	
КонецПроцедуры

// Формирует запрос для получения данных касс ККМ.
// Поля обязательные в выборке: КассаККМ, Организация, ПодключаемоеОборудование, ИспользоватьБезПодключенияОборудования,
// ТорговыйОбъект.
//
// Параметры:
//  Запрос - Запрос - запрос для получения данных касс ККМ.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ДополнительныеПараметры - Структура - дополнительные параметры, если по данным формы не удается задать параметры запроса.
//
Процедура СформироватьЗапросДанныеКассыККМ(Запрос, Форма = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросДанныеКассыККМ(Запрос, Форма, ДополнительныеПараметры);
	
КонецПроцедуры

// Формирует запрос для получения данных организаций.
//
// Параметры:
//  Запрос - Запрос - запрос для получения данных организаций.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура СформироватьЗапросДанныеОрганизаций(Запрос, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросДанныеОрганизаций(Запрос, Форма);
	
КонецПроцедуры

#КонецОбласти

#Область Запреты_продаж_ПрограммныйИнтерфейс

// Заполняет признак использования запретов продаж по данным сервера лояльности
//
// Параметры:
//  Результат - Булево - устанавливаемое значение признака
//
Процедура ЗаполнитьПризнакИспользованияОграниченийПродажРМК(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияОграниченийПродажРМК(Результат);
КонецПроцедуры

// Устанавливает признак использования запретов продаж, поставляемых конфигурацией
//
// Параметры:
//  ИспользоватьОграниченияПродаж - Булево - исходное значение признака
//
Процедура ЗаполнитьПризнакИспользованияПоставляемыхОграниченийПродаж(ИспользоватьОграниченияПродаж) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияПоставляемыхОграниченийПродаж(ИспользоватьОграниченияПродаж);
КонецПроцедуры

// Обновляет признак использования календарного запрета продаж по данным использования поставляемого конфигурацией
// признака запрета продаж
//
// Параметры:
//  ИспользоватьОграниченияПродаж - Булево - устанавливаемое значение признака
//  ПараметрыОбновления - Структура - дополнительные параметры
//
Процедура ОбновитьПризнакИспользованияОграниченийПродаж(ИспользоватьОграниченияПродаж, ПараметрыОбновления) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбновитьПризнакИспользованияОграниченийПродаж(ИспользоватьОграниченияПродаж,
		ПараметрыОбновления);
КонецПроцедуры

// Обновляет регистр сведений запретов продаж по поставляемым (встроенным) конфигурацией ограничениям 
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК- торговый объект для отбора перечня ограничений.
//  Результат - Структура:
//  	* КомментарийОбновленияЗапретов - Строка - при наличии ошибок обновления данных содержит пояснение
//
Процедура ОбновитьОграниченияПродажИзПоставляемыхДанных(ТорговыйОбъект, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбновитьОграниченияПродажИзПоставляемыхДанных(ТорговыйОбъект, Результат);
КонецПроцедуры

#КонецОбласти

#Область Печать_заявления_на_возврат_ПрограммныйИнтерфейс

// Дополняет исходные данные для заявления на возврат 
//
// Параметры:
//  ДанныеЗаявленияНаВозврат - Структура - см. ОбщегоНазначенияРМККлиент.СтруктураЗаявленияНаВозврат()
//
Процедура ДополнитьИсходныеДанныеЗаявленияНаВозврат(ДанныеЗаявленияНаВозврат) Экспорт
	ОбщегоНазначенияРМКУНФ.ДополнитьИсходныеДанныеЗаявленияНаВозврат(ДанныеЗаявленияНаВозврат);
КонецПроцедуры

// Переопределение формирования заявления на возврат
//
// Параметры:
//  ЗаявлениеНаВозврат - ТабличныйДокумент - исходный макет заявления, сформированный по умолчанию
//  ДанныеЗаявленияНаВозврат - Структура - см. ДополнитьИсходныеДанныеЗаявленияНаВозврат(ДанныеЗаявленияНаВозврат)
//
Процедура ЗаполнитьЗаявлениеНаВозврат(ЗаявлениеНаВозврат, ДанныеЗаявленияНаВозврат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьЗаявлениеНаВозврат(ЗаявлениеНаВозврат, ДанныеЗаявленияНаВозврат);
КонецПроцедуры

// Заполняет ФИО и дату рождения клиента по данным карты лояльности
//
// Параметры:
//  ДисконтнаяКартаКлиента - ОпределяемыйТип.ДисконтнаяКартаРМК - карта лояльности, содержащая исходные данные;
//  ФИО - Строка;
//  ДатаРождения - Дата.
//
Процедура ЗаполнитьПерсональныеДанныеПоКартеКлиента(ДисконтнаяКартаКлиента, ФИО, ДатаРождения) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПерсональныеДанныеПоКартеКлиента(ДисконтнаяКартаКлиента,
		ФИО, ДатаРождения);
КонецПроцедуры

// Получает краткое наименование организации
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК;
//  КраткоеНаименованиеОрганизации - Строка.
//
Процедура ЗаполнитьКраткоеНаименованиеОрганизации(Организация, КраткоеНаименованиеОрганизации) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьКраткоеНаименованиеОрганизации(Организация,
		КраткоеНаименованиеОрганизации);
КонецПроцедуры

#КонецОбласти

#Область Переопределение_обработчиков_форм_ПрограммныйИнтерфейс

// Переопределяет поведение формы при создании на сервере
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, поведение которой переопределяется.
//  Отказ - Булево.
//  СтандартнаяОбработка - Булево.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	ОбщегоНазначенияРМКУНФ.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СерверЛояльности

// Заполняет имя реквизита, в котором хранится код карты лояльности.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита.
//  ДисконтнаяКарта - ОпределяемыйТип.ДисконтнаяКартаРМК - Дисконтная карта выбранная в форме РМК
//
Процедура ЗаполнитьИмяРеквизитаКодКартыЛояльности(ИмяРеквизита, ДисконтнаяКарта) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьИмяРеквизитаКодКартыЛояльности(ИмяРеквизита, ДисконтнаяКарта);
	
КонецПроцедуры

// Определяет является ли вид операции операцией возврат.
// Значение по умолчанию - ложь.
//
// Параметры:
//  ВидОперации - ОпределяемыйТип.ВидОперацииРМК - текущий вид операции.
//  ВидОперацииВозврат - Булево - истина, если вид операции - возврат.
//
Процедура ЭтоВидОперацииВозврат (ВидОперации, ВидОперацииВозврат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЭтоВидОперацииВозврат(ВидОперации, ВидОперацииВозврат);
	
КонецПроцедуры
#КонецОбласти

#Область ПараметрыПрограммы

// Заполняет признак использования замены товаров.
//
// Параметры:
//  Результат - Булево - признак использования замены товаров.
//
Процедура ЗаполнитьПризнакИспользоватьЗаменуТоваров(Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользоватьЗаменуТоваров(Результат);
	
КонецПроцедуры

// Заполняет признак использования сервера лояльности.
//
// Параметры:
//  Результат - Булево - признак использования сервера лояльности.
//
Процедура ЗаполнитьПризнакИспользоватьСерверЛояльностиПолучательДанных(Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользоватьСерверЛояльностиПолучательДанных(Результат);
	
КонецПроцедуры

// Заполняет признак использования оплат сертификатами НСПК.
//
// Параметры:
//  Результат - Булево - признак использования оплат сертификатами НСПК.
//
Процедура ЗаполнитьПризнакИспользоватьОплатуСертификатамиНСПК(Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользоватьОплатуСертификатамиНСПК(Результат);
	
КонецПроцедуры

// Заполняет признак использования характеристик в конфигурации.
//
// Параметры:
//  ИспользоватьХарактеристики - Булево - признак использования характеристик.
//
Процедура ЗаполнитьИспользованиеХарактеристик(ИспользоватьХарактеристики) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьИспользованиеХарактеристик(ИспользоватьХарактеристики);
КонецПроцедуры

// Заполняет признак использования упаковок в конфигурации.
//
// Параметры:
//  ИспользоватьУпаковки - Булево - признак использования упаковок.
//
Процедура ЗаполнитьИспользованиеУпаковок(ИспользоватьУпаковки) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьИспользованиеУпаковок(ИспользоватьУпаковки);
КонецПроцедуры

// Заполняет признак использования оплат платежными картами.
//
// Параметры:
//  ИспользоватьОплатуПлатежнымиКартами - Булево - признак использования оплат платежными картами.
//
Процедура ЗаполнитьПризнакИспользованияОплатПК(ИспользоватьОплатуПлатежнымиКартами) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияОплатПК(ИспользоватьОплатуПлатежнымиКартами);
	
КонецПроцедуры

// Устарела. Признак определяется в настройка рмк
// Заполняет признак использования оплат платежными системами.
//
// Параметры:
//  ИспользоватьОплатуПлатежнымиСистемами - Булево - признак использования оплат платежными системами.
//
Процедура ЗаполнитьПризнакИспользованияОплатПлатежнымиСистемами(ИспользоватьОплатуПлатежнымиСистемами) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияОплатПлатежнымиСистемами(ИспользоватьОплатуПлатежнымиСистемами);
	
КонецПроцедуры

// Заполняет признак использования продаж алкогольной продукции.
//
// Параметры:
//  ИспользоватьПродажуАлкоголя - Булево - признак использования продаж алкогольной продукции.
//
Процедура ЗаполнитьПризнакИспользованияПродажАлкоголя(ИспользоватьПродажуАлкоголя) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияПродажАлкоголя(ИспользоватьПродажуАлкоголя);
	
КонецПроцедуры

// Заполняет имя константы в прикладной конфигурации по переданному виду параметра.
//
// Параметры:
//  ВидКонстанты - Строка - вид переданной константы.
//  ИмяКонстанты - Строка - имя константы в прикладной конфигурации.
//
Процедура ЗаполнитьИмяКонстантыПоВиду(ВидКонстанты, ИмяКонстанты) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьИмяКонстантыПоВиду(ВидКонстанты, ИмяКонстанты);
КонецПроцедуры

// Заполняет признак, который определяет, что используется сокращенный сценарий настройки рабочего места кассира.
//
// Параметры:
//  Результат - Булево - признак для заполнения.
//
Процедура ЗаполнитьПризнакЭтоСокращенныйСценарийНастройкиРМК(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакЭтоСокращенныйСценарийНастройкиРМК(Результат);
КонецПроцедуры

 // Заполняет признак формирования отдельного чека ЕГАИС при продаже алкогольной продукции.
//
// Параметры:
//  Результат - Булево - значение признака до переопределения.
//
Процедура ЗаполнитьПризнакПечатиОбщегоКодаДляЧекаККТИЕГАИС(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакПечатиОбщегоКодаДляЧекаККТИЕГАИС(Результат);
КонецПроцедуры

// Заполняет признак формирования слип - чека, встроенного в фискальный чек.
//
// Параметры:
//  Результат - Булево - значение признака до переопределения.
//
Процедура ЗаполнитьПризнакФормированияКороткогоСлипЧека(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакФормированияКороткогоСлипЧека(Результат);
КонецПроцедуры

// Заполняет признак возможности использования промкодов при локальном расчете скидок.
//
// Параметры:
//  Результат - Булево - значение признака до переопределения.
//
Процедура ЛокальныйРасчетСкидокПоддерживаетПромокоды(Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЛокальныйРасчетСкидокПоддерживаетПромокоды(Результат);
	
КонецПроцедуры

// Заполняет узлы, задействованные в обмене с управляющей системой
//
// Параметры:
//  УзлыОбмена - Массив - перечень узлов обмена 1с:РМК
//
Процедура ЗаполнитьУзлыОбменаРМК(УзлыОбмена) Экспорт

КонецПроцедуры

// Заполняет значения по-умолчанию для обмена 1С:РМК
//
// Параметры:
//  УзелОбмена					 - ПланыОбмена.ОбменСУРМК	 - узел обмена 1с:РМК
//  СтруктураДанныхРасписания	 - Структура				 - структура заполнения настроек расписания обмена.
//  * ВидТранспортаОбмена - ПеречислениеСсылка.ВидыТранспортаСообщенийОбмена
//  * РасписаниеРегламентногоЗадания - РасписаниеРегламентногоЗадания
//
Процедура ЗаполнитьРасписаниеПоУмолчаниюОбменРМК(УзелОбмена, СтруктураДанныхРасписания) Экспорт

КонецПроцедуры

//Заполняет список выбора для обмена 1С:РМК
//
// Параметры:
//  УзелОбмена					 - ПланыОбмена.ОбменСУРМК	 - узел обмена 1с:РМК
//  СписокВыбора	 - Структура				 - список выбора транспорта обмена.

Процедура ЗаполнитьСписокВыбораТранспортаОбмена(УзелОбмена, СписокВыбора) Экспорт
	

	
КонецПроцедуры

// Заполняет значения по-умолчанию для обмена 1С:РМК
//
// Параметры:
//  УзелОбмена					 - ПланыОбмена.ОбменСУРМК	 - узел обмена 1с:РМК
//  СтруктураДанныхРасписания	 - Структура				 - структура заполнения настроек расписания обмена.
//
Процедура ДобавитьРасписаниеОбменаРМК(УзелОбмена, СтруктураДанныхРасписания) Экспорт

КонецПроцедуры

// Позволяет перенастроить форму настроек РМК при изменении
// значения констант
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма настроек РМК
// 
Процедура ОбновитьРеквизитыНастроекПоКонстантам(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОбновитьРеквизитыНастроекПоКонстантам(Форма);
	
КонецПроцедуры

// Заполняет признак ведения учета пивной продукции, реализуемой в розлив.
//
// Параметры:
//  Результат - Булево - признак использования оплат сертификатами НСПК.
//
Процедура ЗаполнитьПризнакВеденияУчетаПивнойПродукцииВРозлив(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакВеденияУчетаПивнойПродукцииВРозлив(Результат);
КонецПроцедуры

// Возвращает признак ведения учета продукции ИСМП с частичным выбытием кроме пива.
//
// Возвращаемое значение:
//  Результат - Булево - Истина, если ведется учет
//
Процедура ВедетсяУчетЧастичногоВыбытияИСМПКромеПива(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ВедетсяУчетЧастичногоВыбытияИСМПКромеПива(Результат);
КонецПроцедуры

// Возвращает признак ведения учета продукции с частичным выбытием ЕГАИС.
//
// Возвращаемое значение:
//  Результат - Булево - Истина, если ведется учет
//
Функция ВедетсяУчетЧастичногоВыбытияЕГАИС(Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ВедетсяУчетЧастичногоВыбытияЕГАИС(Результат);
КонецФункции

// Заполняет признак доступности пивной палитры.
//
// Параметры:
//  Результат - Булево - признак использования пивной палитры.
//  Форма - ФормаКлиентскогоПриложения - Форма настроек РМК
//
Процедура ЗаполнитьДоступностьПивнойПалитры(Результат, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДоступностьПивнойПалитры(Результат, Форма);
КонецПроцедуры

// Заполняет префикс штрихкода штучного фасованного товара
//
// Параметры:
//  ПрефиксШтрихкодаШтучногоФасованногоТовара - Число - значение константы ПрефиксШтрихкодаШтучногоФасованногоТовара
//
Процедура ЗаполнитьПрефиксШтрихкодаШтучногоФасованногоТовара(ПрефиксШтрихкодаШтучногоФасованногоТовара) Экспорт

КонецПроцедуры

// Заполняет контрагента по ИНН и КПП
// Параметры:
//  ИНН - Строка
//  КПП - Строка
//  Контрагент - ОпределяемыйТип.КонтрагентРМК - заполняемый контрагент. Возвращаемый параметр.
//
Процедура ЗаполнитьКонтрагентаПоИННКПП(ИНН, КПП, Контрагент) Экспорт
	

	
КонецПроцедуры

#КонецОбласти

#Область Подключаемое_оборудование_ПрограммныйИнтерфейс

// Заполняет параметры по исходным данным 
//
// Параметры:
//	ОбщиеПараметры - Структура -
//		см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека().
//  ПараметрыПакетнойФискализации - Структура - 
//		см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков().
//  ДанныеЗаполнения - Структура - Исходные данные:
//		* ИдентификаторЭТ - СправочникСсылка.ПодключаемоеОборудование.
//		* СуммаОплатыКартой - Число.
//		* ВидОплаты - ОпределяемыйТип.ВидОплатыРМК.
//		* ПроцентКомиссии - Число.
//		* ДанныеЧекаПродажи - ДокументСсылка.ЧекКККМ.
//		* ПараметрыВыдачиНаличных - Структура:
//			** ОрганизацияВыдачи - ОпределяемыйТип.ОрганизацияРМК.
//			** СуммаВыдачи - Число.
//
Процедура ЗаполнитьДанныеДляПакетнойФискализации(ОбщиеПараметры,
	ПараметрыПакетнойФискализации, ДанныеЗаполнения) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеДляПакетнойФискализации(ОбщиеПараметры, ПараметрыПакетнойФискализации,
		ДанныеЗаполнения);
КонецПроцедуры

// Проверяет, что подключаемое оборудование используется
//
// Параметры:
//	ПодключаемоеОборудование - ОпределяемыйТип.ПодключаемоеОборудованиеРМК.
//	ОборудованиеИспользуется - Булево.
//
Процедура ЗаполнитьПризнакИспользованияПодключаемогоОборудования(ПодключаемоеОборудование,
		ОборудованиеИспользуется) Экспорт


КонецПроцедуры

#КонецОбласти

#Область ВыборСкладаИЯчейкиПриПродаже

// Формирует запрос для получения списка складов, которые можно вручную выбрать для продажи в форме РМК.
// Процедура должна сформировать запрос динамического списка "Список" на форме "ФормаВыбораСкладЯчейка".
// Поле запроса должно иметь синоним "ДанныеСтроки".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора склада и ячейки при продаже.
//
Процедура СформироватьЗапросСкладыДляРучногоВыбора(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросСкладыДляРучногоВыбора(Форма);
	
КонецПроцедуры

// Формирует запрос для получения списка ячеек, которые можно вручную выбрать для продажи в форме РМК.
// Процедура должна сформировать запрос динамического списка "Список" на форме "ФормаВыбораСкладЯчейка".
// Поле запроса должно иметь синоним "ДанныеСтроки".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора склада и ячейки при продаже.
//
Процедура СформироватьЗапросЯчейкиДляРучногоВыбора(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросЯчейкиДляРучногоВыбора(Форма);
	
КонецПроцедуры

// Переопределяет поведение формы выбора склада ячейки при закрытии на сервере
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, поведение которой переопределяется.
//
Процедура ПриЗакрытииНаСервереФормыВыбораСкладЯчейка(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПриЗакрытииНаСервереФормыВыбораСкладЯчейка(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область Выдача_наличных_при_продаже_ПрограммныйИнтерфейс

// Перезаполняет и сохраняет документ выдачи наличных как документ возврата.
// Актуально для случаев, когда в рамках пакетной фискализации продажи с выдачей наличных
// возникла ошибка фискализации выдачи, но ранее успешно прошла фискализация продажи.
// В момент отмены фискализации автоматически отменяется 
// фискализация чека продажи, ее нужно отразить возвратом в документах РМК,при этом 
// в РС "Фискальные операции" под регистратором выдачи наличных появится запись фискализации возврата.
//
// Параметры:
//  СсылкаНаЧекВыдачиНаличных - ОпределяемыйТип.ЧекККМРМК - ссылка на изменяемый документ
//  ЧекПродажиПриВыдачеНаличных - ОпределяемыйТип.ЧекККМРМК - исходные данные для перезаполнения.
//  НомерЧекаККМ - Число - номер чека ККМ для постобработки.
//  НомерСменыККМ - Число - номер смены ККМ для постобработки.
//  ПараметрыЭквайринговойОперации - Структура:
//   *ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование
//   *НомерЧекаЭТ - Строка
//   *СсылочныйНомер - Строка
//   *НомерКарты - Строка
//
Процедура ЗаменитьЧекВыдачиНаЧекВозврата(СсылкаНаЧекВыдачиНаличных,ЧекПродажиПриВыдачеНаличных,
	НомерЧекаККМ, НомерСменыККМ, ПараметрыЭквайринговойОперации) Экспорт
		ОбщегоНазначенияРМКУНФ.ЗаменитьЧекВыдачиНаЧекВозврата(СсылкаНаЧекВыдачиНаличных,
			ЧекПродажиПриВыдачеНаличных, НомерЧекаККМ, НомерСменыККМ, ПараметрыЭквайринговойОперации);
КонецПроцедуры

// Дополняет чек продажи данными об оплате картой
// Актуально для пакетной фискализации, в случае успешной фискализации чека продажи
//
// Параметры:
//  ЧекПродажи - ОпределяемыйТип.ЧекККМ - пояснение
//  ДанныеДляЗаполнения - Структура -
//		См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании()
//  ДополнительныеДанные - Структура -
//		См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков()
//
Процедура ЗаполнитьОплатуКартойДляПакетнойФискализации(ЧекПродажи, ДанныеДляЗаполнения, ДополнительныеДанные) Экспорт


КонецПроцедуры

 // Ведется учет ИСМП в конфигурации
// Параметры:
//  УчетПродукцииИСМП - Булево - Ведется учет ИСМП в конфигурации 
//  СтандартнаяОбработка - Булево - Выполнение стандартной обработки
//
Процедура ВедетсяУчетПродукцииИСМП(УчетПродукцииИСМП, СтандартнаяОбработка) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Помощник_настройки_РМК_ПрограммныйИнтерфейс

// Выполняет конвертацию настроек РМК в настройки нового РМК
//
// Параметры:
//  ЭтотОбъект - ФормаКлиентскогоПриложение - общая форма настройки рабочего места кассира
//
Процедура КонвертироватьНастройкиСтарогоРМК(ЭтотОбъект) Экспорт
	ОбщегоНазначенияРМКУНФ.КонвертироватьНастройкиСтарогоРМК(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ПлиточныйИнтерфейсПодбора_ПрограммныйИнтерфейс

// Дополняет данные о цене, особенности учета, виде номенклатуры и остатке
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//
Процедура ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса(Форма) Экспорт
  ОбщегоНазначенияРМКУНФ.ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса(Форма);
КонецПроцедуры

//  Заполняет исходные данные для формы элемента палитры избранных товаров по данным подбора.
//
// Параметры:
//  ИсходныеДанные - Произвольный - исходные данные подбора номенклатуры.
//  Результат - ТаблицаЗначений:
//		* Номенклатура - ОпределяемыйТип.НоменклатураРМК.
//		* Характеристика - ОпределяемыйТип.ХарактеристикаРМК.
//
Процедура ЗаполнитьЗначенияПодбораДляПалитры(ИсходныеДанные, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьЗначенияПодбораДляПалитры(ИсходныеДанные, Результат);
КонецПроцедуры

// Дополняет состав плитки весовым товаром
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//
Процедура ДополнитьОпорныеДанныеПлиткиВесовымТоваром(Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.ДополнитьОпорныеДанныеПлиткиВесовымТоваром(Форма);
КонецПроцедуры

Процедура ОтключитьКегИзПлиткиНаСервере(ДанныеНоменклатуры, Результат) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Локализация

// Настройка локализации картинок на форме.
// Необходимо заполнить значения для ключей структуры: "СкидкаТекущийТоварСумма", "СкидкаНаЧекСуммой".
//
// Параметры:
//  ПараметрыКартинок - Структура - структура с соответствиями картинок.
//    СкидкаНаЧекСуммой - БиблиотекаКартинок.
//    СкидкаТекущийТоварСумма - БиблиотекаКартинок.
//
Процедура ЛокализоватьКартинки(ПараметрыКартинок) Экспорт
	ОбщегоНазначенияРМКУНФ.ЛокализоватьКартинки(ПараметрыКартинок);
КонецПроцедуры

// Заполняет представление национальной валюты.
//
// Параметры:
//  ПредставлениеВалюты - Строка - представление валюты.
//
Процедура ЗаполнитьПредставлениеВалюты(ПредставлениеВалюты) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПредставлениеВалюты(ПредставлениеВалюты);
КонецПроцедуры

// Заполняет параметры национальной валюты.
//
// Параметры:
//  ПараметрыВалюты - Структура - параметры национальной валюты.
//    Код - Строка - код валюты.
//    Наименование - Строка - наименование валюты.
//    СимвольноеПредставление - Строка - символьное представление валюты.
//
Процедура ЗаполнитьПараметрыНациональнойВалюты(ПараметрыВалюты) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыНациональнойВалюты(ПараметрыВалюты);
КонецПроцедуры

// Проверка соответствия валюты в настройках программы и в данных при запуске рабочего места кассира.
//
// Параметры:
//  ВалютаЗаполненаПравильно - Булево - Истина, если валюта укзана верно.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ПроверитьВозможностьРаботыСВалютой(ВалютаЗаполненаПравильно, Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.ПроверитьВозможностьРаботыСВалютой(ВалютаЗаполненаПравильно, Форма);
КонецПроцедуры

#КонецОбласти

#Область КонтрольПродаж

// Заполняет таблицу номенклатуры алкогольной продукцией для палитры.
//
// Параметры:
//  ТаблицаНоменклатуры - Таблица значений. Содержит 2 колонки: "Наименование", "Номенклатура".
//  СлужебнаяОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК.
//
Процедура ПолучитьНоменклатуруДляПалитрыАлкогольнаяПродукция(ТаблицаНоменклатуры, СлужебнаяОсобенностьУчета) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПолучитьНоменклатуруДляПалитрыАлкогольнаяПродукция(ТаблицаНоменклатуры,
		СлужебнаяОсобенностьУчета);
	
КонецПроцедуры

// Заполняет таблицу номенклатуры табачной продукцией для палитры.
//
// Параметры:
//  ТаблицаНоменклатуры - Таблица значений. Содержит 2 колонки: "Наименование", "Номенклатура".
//  СлужебнаяОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК.
//
Процедура ПолучитьНоменклатуруДляПалитрыТабачнаяПродукция(ТаблицаНоменклатуры, СлужебнаяОсобенностьУчета) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПолучитьНоменклатуруДляПалитрыТабачнаяПродукция(ТаблицаНоменклатуры,
		СлужебнаяОсобенностьУчета);
	
КонецПроцедуры

// Заполняет таблицу номенклатуры продукцией "Альтернативный табак" для палитры.
//
// Параметры:
//  ТаблицаНоменклатуры - Таблица значений. Содержит 2 колонки: "Наименование", "Номенклатура".
//  СлужебнаяОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК.
//
Процедура ПолучитьНоменклатуруДляПалитрыАльтернативныйТабак(ТаблицаНоменклатуры, СлужебнаяОсобенностьУчета) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПолучитьНоменклатуруДляПалитрыТабачнаяПродукция(ТаблицаНоменклатуры,
		СлужебнаяОсобенностьУчета);
	
КонецПроцедуры

// Заполняет таблицу номенклатуры подарочными сертификатами для палитры.
//
// Параметры:
//  ТаблицаНоменклатуры - Таблица значений. Содержит 2 колонки: "Наименование", "Номенклатура".
//  СлужебныйВидНоменклатуры - ОпределяемыйТип.ВидНоменклатурыРМК
//
Процедура ПолучитьНоменклатуруДляПалитрыПодарочныеСертификаты(ТаблицаНоменклатуры, СлужебныйВидНоменклатуры) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПолучитьНоменклатуруДляПалитрыПодарочныеСертификаты(ТаблицаНоменклатуры,
		СлужебныйВидНоменклатуры);
	
КонецПроцедуры

// Заполняет переданный массив структурами данных для создания контролей продаж - запретов продаж.
//
// Параметры:
//  МассивОписанийКонтроля - Массив.
//
Процедура ПодготовитьПреобразованиеЗапретовПродажВКонтрольПродаж(МассивОписанийКонтроля) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПодготовитьПреобразованиеЗапретовПродажВКонтрольПродаж(МассивОписанийКонтроля);
	
КонецПроцедуры

// Заполняет данные контроля продаж для переданного списка товаров.
//
// Параметры:
//  ДанныеКонтроляПродаж - Структура - см. ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаКонтроляПродаж().
//  ТаблицаТоваров - ТаблицаЗначений - таблица с товарами (Номенклатура, Характеристика),
//										для которых получается контроль продаж.
//  ДополнительныеДанные - Структура - дополнительные параметры для отбора контроля продаж.
//
Процедура ЗаполнитьДанныеКонтроляПродаж(ДанныеКонтроляПродаж, ТаблицаТоваров, ДополнительныеДанные) Экспорт

	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеКонтроляПродаж(ДанныеКонтроляПродаж, ТаблицаТоваров, ДополнительныеДанные);

КонецПроцедуры

// Заполняет признак учета торговых объектов в контроле продаж
//
// Параметры:
//  УчетТорговыхОбъектов - Булево
//
Процедура ЗаполнитьПризнакУчетаТорговыхОбъектовКонтроляПродаж(УчетТорговыхОбъектов) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакУчетаТорговыхОбъектовКонтроляПродаж(УчетТорговыхОбъектов);
КонецПроцедуры

#КонецОбласти

// Обновляет рабочие места касс ККМ, отличные от текущего рабочего места 
//
Процедура УстановитьТекущееРабочееМестоКассамККМ() Экспорт
	ОбщегоНазначенияРМКУНФ.УстановитьТекущееРабочееМестоКассамККМ();
КонецПроцедуры

// Позволяет реализовать дополнительную логику заполнения подключаемого оборудования при обновлении
//  
// Параметры:
//  СсылкаПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование 
//
Процедура ОбновитьСправочникПодключаемогоОборудования(СсылкаПодключаемоеОборудование) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбновитьСправочникПодключаемогоОборудования(СсылкаПодключаемоеОборудование);
КонецПроцедуры

// Заполняет параметры для работы РМК при запуске
//
// Параметры:
//  ЗапуститьНовыйРМК - Булево - признак того, будет ли запущен РМК при старте системы
//  ЗапуститьНастройкуКСО - Булево - признак того, будет ли запущена форма настройки кассы самообслуживания,
//  РежимКассыСамообслуживания - Булево - признак того, является ли текущий режим приложения кассой самообслуживания.
//  ДополнительныеПараметрыЗапуска - Структура.
//
Процедура ЗаполнитьПараметрыРаботыКлиентаПриЗапуске(ЗапуститьНовыйРМК, 
	ЗапуститьНастройкуКСО, РежимКассыСамообслуживания, ДополнительныеПараметрыЗапуска) Экспорт
	
ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыРаботыКлиентаПриЗапуске(ЗапуститьНовыйРМК, Истина,
		ДополнительныеПараметрыЗапуска);
	
КонецПроцедуры

// Заполняет адрес торгового объекта.
//
// Параметры:
//  АдресМагазина - Строка - адрес торгового объекта.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект для получения адреса.
//
Процедура ЗаполнитьАдресТорговогоОбъекта(АдресМагазина, ТорговыйОбъект) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьАдресТорговогоОбъекта(АдресМагазина, ТорговыйОбъект);
	
КонецПроцедуры

// По переданным параметрам вида операции определяет текущий вид операции.
//
// Параметры:
//  ПараметрыВидаОперации - Структура - см.ОбщегоНазначенияРМККлиентСервер.ПараметрыВидаОперации().
//
Процедура ЗаполнитьВидОперацииЧекаККМ(ПараметрыВидаОперации) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьВидОперацииЧекаККМ(ПараметрыВидаОперации);
	
КонецПроцедуры

// Обновляет исходные данные запрета продаж с выведением статуса обновления.
//
// Параметры:
//  ИсходныеДанные - Структура - содержит десериализованные данные ответа из сервера лояльности.
//  ДанныеОбновлены - Булево - Истина, если данные успешно обновлены.
//
Процедура АктуализироватьДанныеЗапрета(ИсходныеДанные, ДанныеОбновлены) Экспорт
	
	ОбщегоНазначенияРМКУНФ.АктуализироватьДанныеЗапрета(ИсходныеДанные, ДанныеОбновлены);
	
КонецПроцедуры

// Заполняет ставку НДС для товара по данным системы налогообложения.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - данные текущего объекта.
//  ТекущаяСтрока - СтрокаТабличнойЧасти - текущая строка.
//  СНОПоУмолчанию - ОпределяемыйТип.ТипыСистемНалогообложенияККТРМК - СНО по умолчанию в РМК.
//  СтавкаНДС - ОпределяемыйТип.СтавкаНДСРМК - ставка НДС для заполнения.
//
Процедура ЗаполнитьСтавкуНДС(Объект, ТекущаяСтрока, СНОПоУмолчанию, СтавкаНДС) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСтавкуНДС(Объект, ТекущаяСтрока, СНОПоУмолчанию, СтавкаНДС);
	
КонецПроцедуры

// Заполняет текущий торговый объект, который далее используется в РМК.
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - текущий торговый объект РМК.
//
Процедура ОпределитьТекущийТорговыйОбъект(ТорговыйОбъект) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьТекущийТорговыйОбъект(ТорговыйОбъект);
	
КонецПроцедуры

// Настройка элементов формы "Настройки рабочего места кассира".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - общая форма настроек РМК.
//
Процедура ПереопределитьНастройкиРМК(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПереопределитьНастройкиРМК(Форма);
	
КонецПроцедуры

// Процедура заполняет данные для работы рабочего места кассира.
// Список обязательных параметров для заполнения: ВидОперации, ТорговыйОбъект, ЦенаВключаетНДС, УчитыватьМРЦ,
// РозничныйВидЦены, ИспользоватьПодключаемоеОборудование, ИспользоватьСерверЛояльностиПолучательДанных, ИспользоватьОплатуПлатежнымиКартами,
// ИспользоватьКонтрольПродаж, ИспользоватьОплатуПлатежнымиСистемами, ИспользоватьОплатуСертификатамиНСПК, ИспользоватьЗаменуТоваров.
// Также обязательным является формирование текста запроса для реквизита формыРМК "СписокТоваров".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ЗаполнитьДанныеДляРМК(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеДляРМК(Форма);
	
КонецПроцедуры

// Определяет значение налогообложения НДС для текущей организации.
//
// Параметры:
//  НалогообложениеНДС - ОпределяемыйТип.НалогообложениеНДСРМК - налогообложение НДС для организации.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ЗаполнитьСНОНДСДляОрганизации(НалогообложениеНДС, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСНОНДСДляОрганизации(НалогообложениеНДС, Форма);
	
КонецПроцедуры

// Определяет значение налогообложения ККТ для организации.
//
// Параметры:
//  НалогообложениеККТ - ОпределяемыйТип.ТипыСистемНалогообложенияККТРМК - налогообложение ККТ для организации.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ТекущаяСтрока - СтрокаТабличнойЧасти - текущая строка.
//  Дата - ДатаВремя - (необязательный).
//
Процедура ЗаполнитьСНОККТДляОрганизации(НалогообложениеККТ, Форма, ТекущаяСтрока = Неопределено, Дата = '00010101') Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСНОККТДляОрганизации(НалогообложениеККТ, Форма, ТекущаяСтрока, Дата);
	
КонецПроцедуры

// Определяет значение ставки НДС для организации использующей УСН.
//
// Параметры:
//  СтавкаНДСУСН - ОпределяемыйТип.СтавкаНДСРМК - Ставка НДС для организации использующей УСН.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ТекущаяСтрока - СтрокаТабличнойЧасти - текущая строка.
//  Дата - ДатаВремя - (необязательный).
//
Процедура ЗаполнитьСтавкуНДСУСНДляОрганизации(СтавкаНДСУСН, Форма, ТекущаяСтрока = Неопределено, Дата = '00010101') Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСтавкуНДСУСНДляОрганизации(СтавкаНДСУСН, Форма, ТекущаяСтрока, Дата);
	
КонецПроцедуры

// Определяет значение основной организации из настройки РМК.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК - значение основной организации.
//  НастройкаРМК - СправочникСсылка.НастройкиРабочегоМестаКассира - настройка РМК, по которой необходимо определить основную организацию.
//
Процедура ЗаполнитьОрганизациюИзНастройкиРМК(Организация, НастройкаРМК) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьОрганизациюИзНастройкиРМК(Организация, НастройкаРМК);
	
КонецПроцедуры

// Процедура определяет может ли операция являться сторнирующей по таким параметрам как:
// Чек продажи, сумма итого, текущая кассовая смена.
// Результат процедуры необходимо записать в "ПараметрыСторно.Результат".
//
// Параметры:
//  ПараметрыСторно - Структура - параметры операции. Содержит свойства:
//                    ЧекККМПродажа - ОпределяемыйТип.ЧекККМРМК - чек продажи.
//                    СуммаИтого - Число - возвращаемая сумма безналичных оплат по картам.
//                    КассоваяСмена - ДокументСсылка.КассоваяСмена - текущая кассовая смена.
//                    Результат - Булево - признак того, является ли текущая операция сторнирующей.
//                    ЭквайринговыйТерминал - ОпределяемыйТип.ЭквайринговыйТерминалРМК - эквайринговый терминал по которому осуществляется сторно.
//
Процедура ЗаполнитьПризнакЭтоСторно(ПараметрыСторно) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакЭтоСторно(ПараметрыСторно);
КонецПроцедуры

// Обновляет данные карты лояльности
//
// Параметры:
//	КартаЛояльности - СправочникСсылка.КартыЛояльности - карта, данные которой будут изменены
//	ДанныеДляИзменения - Структура
//		* НомерКартыДоИзменения - Строка - предыдущее значение номера карты лояльности
//		* МагнитныйКодКартыЛояльности - Строка - магнитный код карты лояльности
//		* НовыйEmailКлиента - Строка - новый email владельца карты
//		* НовыйНомерТелефонаКлиента - Строка - новый номер телефона владельца карты
//
Процедура СохранитьДанныеКартыЛояльности(КартаЛояльности, ДанныеДляИзменения) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СохранитьДанныеКартыЛояльности(КартаЛояльности, ДанныеДляИзменения);
	
КонецПроцедуры

// Процедура создает отложенный документ "Чек ККМ".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//  ЧекСоздан - Булево - признак, того, что создан отложенный чек.
//
Процедура СоздатьОтложенныйЧек(Форма, ЧекСоздан) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СоздатьОтложенныйЧек(Форма, ЧекСоздан);
	
КонецПроцедуры

// Определяет является ли полученный вид операции операцией продажи.
//
// Параметры:
//  ЭтоОперацияПродажи - Булево - признак, который говорит, что текущий вид операции это продажа.
//  ВидОперации - ОпределяемыйТип.ВидОперацииРМК - текущий вид операции.
//
Процедура ОпределитьВидОперации(ЭтоОперацияПродажи, ВидОперации) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьВидОперации(ЭтоОперацияПродажи, ВидОперации);
	
КонецПроцедуры

// Определяет количество отложенных чеков. Если количество отложенных чеков = 1, то заполняет
// реквизит параметр "ОтложенныйЧек" ссылкой на чекККМ.
//
// Параметры:
//  СтруктураПараметров - Структура - Параметры для выполнения запроса.
//  ОтложенныйЧек - ОпределяемыйТип.ЧекККМРМК - реквизит формы, для хранения текущего отложенного чека.
//  КоличествоЧеков - Число - количество чеков ККМ со статусом "Отложен".
//
Процедура ЗаполнитьКоличествоОтложенныхЧеков(СтруктураПараметров, ОтложенныйЧек, КоличествоЧеков) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьКоличествоОтложенныхЧеков(СтруктураПараметров, ОтложенныйЧек, КоличествоЧеков);
	
КонецПроцедуры

// Формирует и записывает документ "Чек ККМ" перед пробитием на ККТ.
// Ссылку на записанный документ необходимо присвоить реквизиту формы "ЧекККМВОбработке"
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//  Отказ - Булево - признак наличия ошибки при записи документа.
//  ТекстОшибки - Строка - текст ошибки.
//  СистемаНалогообложения - ОпределяемыеТипы.ТипыСистемНалогообложенияККТРМК - СНО ККТ для текущего чека.
//
Процедура ЗаписатьЧекККМПередПробитием(Форма, Отказ, ТекстОшибки, СистемаНалогообложения) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаписатьЧекККМПередПробитием(Форма, Отказ, ТекстОшибки, СистемаНалогообложения);
	
КонецПроцедуры

// Проверяет наличие в документе "ЧекККМ" алкогольной продукции.
//
// Параметры:
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - документ, в котором нужно проверить наличии алкогольной продукции.
//  Результат - Булево - Истина, если в документе есть алкогольная продукция.
//
Процедура ПроверитьНаличиеПродукцииЕГАИСВЧекККМ(ЧекККМ, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ПроверитьНаличиеПродукцииЕГАИСВЧекККМ(ЧекККМ, Результат);
КонецПроцедуры

// Заполняет данные для пробития на ККТ.
//
// Параметры:
//  ЧекККМВОбработке - ОпределяемыйТип.ЧекККМРМК - ссылка на документ печать, которого производится.
//  ДополнительныеПараметры - Структура:
//   *ЕстьПродукцияЕГАИС - Булево - признак наличия маркируемой алкогольной продукции.
//   *ПечататьБумажныйЧек - Булево - признак нужно печатать чек на ККТ или отправлять в эл.виде.
//   *СистемаНалогообложения - ОпределяемыеТипы.ТипыСистемНалогообложенияККТРМК - СНО ККТ для текущего чека.
//   *СворачиватьСтрокиПриПечатиЧека - Булево - признак нужно ли сворачивать маркируемые товары в чеке.
//   *ОсобенностиУчетаВозвращаемойМаркируемойПродукции - Список - значения особенностей учета товаров из чека,
//     по которым осуществляется возврат без марки.
//  ОбщиеПараметры - Массив - см.ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Процедура ПодготовитьДанныеДляПробитияЧека(ЧекККМВОбработке, ДополнительныеПараметры, ОбщиеПараметры) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПодготовитьДанныеДляПробитияЧека(ЧекККМВОбработке, ДополнительныеПараметры, ОбщиеПараметры);
	
КонецПроцедуры

// Процедура обрабатывает ЧекККМ после пробития на ККИ.
//
// Параметры:
//  ВходящиеДанные - Структура - данные о результате пробития чека на ККТ.
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//
Процедура ПробитьЧекЗавершение(ВходящиеДанные, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПробитьЧекЗавершение(ВходящиеДанные, Форма);
	
КонецПроцедуры

// Процедура настраивает динамический список для получения списка чеков для возврата.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековККМНаВозврат(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуЧековККМНаВозврат(Форма);
	
КонецПроцедуры

// Процедура настраивает динамический список для получения списка чеков для коррекции.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековКоррекции(Форма) Экспорт

	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуЧековКоррекции(Форма);

КонецПроцедуры

// Процедура настраивает динамический список для получения списка чеков для проверки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековККМДляПроверки(Форма) Экспорт

КонецПроцедуры

// Процедура настраивает динамический список для получения списка отложенных чеков.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуОтложенныхЧековККМ(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуОтложенныхЧековККМ(Форма);
	
КонецПроцедуры

// Процедура настраивает динамический список для получения списка чеков для повторной печати.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековККМДляПовторнойПечати(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуЧековККМДляПовторнойПечати(Форма);
	
КонецПроцедуры

// Процедура архивирует чеки при закрытии смены. При необходимости удаляет чеки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//  Параметры - Структура - параметры для анализа закрытия смены.
//
Процедура ЗаархивироватьЧекиККМ(Форма, Параметры) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаархивироватьЧекиККМ(Форма, Параметры);
	
КонецПроцедуры

// Процедура заполняет доступные права для текущего пользователя.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//
Процедура ЗаполнитьТаблицуРолейПользователя(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуРолейПользователя(Форма);
	
КонецПроцедуры

// Процедура заполняет данные на форме РМК на основании выбранного чека.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - выбранный чек ККМ.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров для заполнения чека
//     *ПереноситьКодыМаркировки - Булево - признак необходимости заполнить коды маркировки из чека
//
Процедура ЗаполнитьНаОснованииЧекаККМ(Форма, ЧекККМ, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНаОснованииЧекаККМ(Форма, ЧекККМ, ДополнительныеПараметры);
	
КонецПроцедуры

// Процедура заполняет данные на форме РМК на основании выбранного отложенного чека.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//  ОтложенныйЧек - ДокументСсылка.ЧекККМ - выбранный отложенный чек ККМ.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с товарами чека.
//
Процедура ЗаполнитьДанныеИзОтложенногоЧека(Форма, ОтложенныйЧек, ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеИзОтложенногоЧека(Форма, ОтложенныйЧек, ДополнительныеИсходящиеДанные);
	
КонецПроцедуры

// Процедура заполняет данные на форме РМК о номенклатуре.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//
Процедура ДополнитьСведенияОТоварах(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ДополнитьСведенияОТоварах(Форма);
	
КонецПроцедуры

// Определяет систему налогообложения чека ККМ.
//
// Параметры:
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - чек ККМ, для которого нужно определить систему налогообложения.
//  СНО - ОпределяемыйТип.ТипыСистемНалогообложенияККТРМК - система налогообложения.
//
Процедура ЗаполнитьСНОЧекаККМ(ЧекККМ, СНО) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСНОЧекаККМ(ЧекККМ, СНО);
	
КонецПроцедуры

// Процедура устанавливает статус чека.
//
// Параметры:
//  ЧекККМ - ДокументОбъект.ЧекККМ - чек ККМ для смены статуса.
//  Статус - Строка - статус, который необходимо установить. Если пустая строка, то очистить статус.
//
Процедура УстановитьСтатусЧека(ЧекККМ, Статус = "") Экспорт
	
	ОбщегоНазначенияРМКУНФ.УстановитьСтатусЧека(ЧекККМ, Статус)
	
КонецПроцедуры

// Процедура заполняет массив серий, исключая серии, которые уже присутствуют в РМК.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - товар, для которого необходимо заполнить серии.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика, для которой необходимо заполнить серии.
//  МассивСерий - Массив - массив, в который необходимо добавить найденные серии.
//  ИсключаяСерии - Массив - массив, в котором содержаться серии, которые уже присутствуют в РМК и их нужно исключить.
//  ВидОперации - ОпределяемыйТип.ВидОперацииРМК - вид текущей операции.
//
Процедура ЗаполнитьСписокВыбораСерийНоменклатуры(Номенклатура, Характеристика, МассивСерий, ИсключаяСерии, ВидОперации, ТорговыйОбъект) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСписокВыбораСерийНоменклатуры(Номенклатура, Характеристика, МассивСерий, ИсключаяСерии, ВидОперации, ТорговыйОбъект);
	
КонецПроцедуры

// Процедура заполняет шаблон чека в параметры перед пробитием чека на ККТ.
//
// Параметры:
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - ссылка на чек, который будет пробит.
//  ОбщиеПараметры - Структура - см.ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека().
//  ТекущаяНастройкаРМК - СправочникСсылка.НастройкиРабочегоМестаКассира - текущая настройка рабочего места кассира.
//
Процедура ЗаполнитьШаблонЧека(ЧекККМ, ОбщиеПараметры, ТекущаяНастройкаРМК) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьШаблонЧека(ЧекККМ, ОбщиеПараметры);
	
КонецПроцедуры

// Процедура заполняет устройство печати дополнительных документов.
//
// Параметры:
//  ОбщиеПараметры - Структура - см.ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Процедура ЗаполнитьУстройствоПечати(ОбщиеПараметры) Экспорт

КонецПроцедуры

// Процедура очищает значение параметра "ОтложенныйЧек", если у него пустой статус.
//
// Параметры:
//  ОтложенныйЧек - ОпределяемыйТип.ЧекККМРМК - ссылка на отложенный чек.
//
Процедура ОчиститьОтложенныйЧек(ОтложенныйЧек) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОчиститьОтложенныйЧек(ОтложенныйЧек);
	
КонецПроцедуры

// Заполнение данных из выбранного документа заказ покупателя.
//
// Параметры:
//  ЗаказПокупателя - Структура, ДокументСсылка - выбранный документ заказ покупателя;
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира;
//  Отказ - Булево - флаг ошибки при выполнении;
//  ОписаниеОшибки - Строка - описание ошибки выполнения.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с товарами заказа.
//
Процедура ЗаполнитьПоЗаказу(ЗаказПокупателя, Форма, Отказ, ОписаниеОшибки,
		ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПоЗаказу(ЗаказПокупателя, Форма, Отказ, ОписаниеОшибки,
		ДополнительныеИсходящиеДанные);
	
КонецПроцедуры

// Заполнение данных из выбранного документа безналичной оплаты.
//
// Параметры:
//  ДанныеВыбора - Структура - данные выбранного документа безналичной оплаты.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с товарами заказа.
//
Процедура ЗаполнитьПоДокументуБезналичнойОплаты(ДанныеВыбора, Форма,
		ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПоДокументуБезналичнойОплаты(ДанныеВыбора, Форма, ДополнительныеИсходящиеДанные);
	
КонецПроцедуры

// Устанавливает признак формы по одноименному значению функциональной опции.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы.
//  ИмяФункциональнойОпции - Строка.
//
Процедура УстановитьПризнакФормеПоДаннымФункциональнойОпции(Форма, ИмяФункциональнойОпции) Экспорт
	
	ОбщегоНазначенияРМКУНФ.УстановитьПризнакФормеПоДаннымФункциональнойОпции(Форма, ИмяФункциональнойОпции);
	
КонецПроцедуры

// Процедура производит дополнительные действия для настройки работы с оплатой по карте.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы.
//
Процедура НастроитьОплатуПлатежнымиКартами(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НастроитьОплатуПлатежнымиКартами(Форма);
	
КонецПроцедуры

// Находит по магнитному коду карту лояльности и заполняет ее данные.
//
// Параметры:
//  МагнитныйКод - Строка - код, по которому выполняется поиск.
//  ДанныеКарты - Структура - см.ШтрихкодированиеРМК.ДанныеКартыЛояльности().
//
Процедура ЗаполнитьДанныеКартыЛояльности(МагнитныйКод, ДанныеКарты) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеКартыЛояльности(МагнитныйКод, ДанныеКарты);
	
КонецПроцедуры

// Процедура производит обработку выбранного документа расчета.
//
// Параметры:
//  ПараметрыВыбора - Структура - данные выбранного документа расчета.
//  Форма - ФормаКлиентскогоПриложения - данные формы.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с товарами документа.
//
Процедура ОбработатьВыборДокументаРасчета(ПараметрыВыбора, Форма, ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОбработатьВыборДокументаРасчета(ПараметрыВыбора, Форма, ДополнительныеИсходящиеДанные);
	
КонецПроцедуры

// Процедура формирует структуру данных, которая затем будет выгружена в XML.
//
// Параметры:
//  СтруктураНастроек - Структура - структура, в которую нужно добавить настройки.
//  НастройкаРМК - СправочникСсылка.НастройкиРабочегоМестаКассира - текущая настройка РМК.
//
Процедура СформироватьСтруктуруНастроек(СтруктураНастроек, Знач НастройкаРМК) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьСтруктуруНастроек(СтруктураНастроек, НастройкаРМК);
	
КонецПроцедуры

// Процедура производит переопределение запроса для формирования списка продавцов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора продавцов.
//
Процедура ПереопределитьЗапросДоступныхПродавцов(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПереопределитьЗапросДоступныхПродавцов(Форма);
	
КонецПроцедуры

// Процедура записывает в базу штрихкод.
//
// Параметры:
//  ДанныеСтроки - Структура - данные для записи в регистр штрихкодов.
//
Процедура ЗаписатьШтрихкод(ДанныеСтроки) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаписатьШтрихкод(ДанныеСтроки);
	
КонецПроцедуры

// Возвращает структуру дисконтной карты
//
// Параметры:
//  СтруктураРезультат - Структура - параметры создания карты лояльности.
//  Форма - ФормаКлиентскогоПриложения - данные формы.
//
Процедура СоздатьЛокальноКартуЛояльности(СтруктураРезультат, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СоздатьЛокальноКартуЛояльности(СтруктураРезультат, Форма);
	
КонецПроцедуры

// Определяет значение системы налогообложения организации на указанную дату.
//
//  Параметры:
//   Организация - ОпределяемыйТип.ОрганизацияРМК - организация для которой нужно определить СНО.
//   Дата - Дата - дата на которую нужно определить тип СНО.
//   СНОККТ - ОпределяемыйТип.ТипыСистемНалогообложенияККТРМК - значение системы налогообложения ККТ.
//
Процедура ОпределитьСНОККТДляОрганизации(Организация, Дата, СНОККТ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьСНОККТДляОрганизации(Организация, Дата, СНОККТ);
	
КонецПроцедуры

// Заполняет реквизиты кассы ККМ.
//
// Параметры:
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - Ссылка на кассу ККМ.
//  РабочееМесто - ОпределяемыйТип.РабочееМестоРМК, Неопределено - (необязательный) ссылка на рабочее место.
//  Реквизиты - Структура:
//    Организация - ОпределяемыйТип.ОрганизацияРМК.
//    ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК.
//    РабочееМесто - ОпределяемыйТип.РабочееМестоРМК.
//    КассаККМ - ОпределяемыйТип.КассаККМРМК.
//
Процедура ЗаполнитьРеквизитыКассыККМ(КассаККМ, РабочееМесто, Реквизиты) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьРеквизитыКассыККМ(КассаККМ, РабочееМесто, Реквизиты);
	
КонецПроцедуры

// Процедура заполняет организацию продажи в строке.
//
// Параметры:
//  ДанныеСтроки - Структура - данные текущей строки.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ЗаполнитьОрганизациюПродажи(ДанныеСтроки, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьОрганизациюПродажи(ДанныеСтроки, Форма);
	
КонецПроцедуры

// Процедура производит поиск подарочного сертификата.
// Если сертификат найден, то необходимо заполнить реквизит формы "ПодарочныйСертификат".
// Если сертификат найден, то необходимо запросить его баланс и заполнить реквизит формы "СуммаСертификата".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура НайтиСертификатЛокально(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НайтиСертификатЛокально(Форма);
	
КонецПроцедуры

// Процедура производит поиск промокода.
// Если сертификат найден, то необходимо заполнить реквизит формы "ПодарочныйСертификат".
// Если сертификат найден, то необходимо запросить его баланс и заполнить реквизит формы "СуммаСертификата".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура НайтиПромокодЛокально(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НайтиПромокодЛокально(Форма);
	
КонецПроцедуры

// Процедура производит запрос бонусных баллов по данным карты лояльности.
// Если карта содержит бонусы то необходимо заполнить реквизиты формы "КоличествоБонусов", "БонусыДоступноКОплате",
// "ПроцентОплатыБонусами". Установить видимость группе формы "ГруппаБонусыКартыЛояльности", сделать доступной команду "ОплатитьБонусами".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура НайтиБонусыЛокально(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НайтиБонусыЛокально(Форма);
	
КонецПроцедуры

// Определяет необходимость контроля остатков при пробитии чека.
//
// Параметры:
//  ТребуетсяКонтрольОстатков - Булево - признак необходимости контроля остатков.
//
Процедура ОпределитьНеобходимостьКонтролироватьОстатки(ТребуетсяКонтрольОстатков) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьНеобходимостьКонтролироватьОстатки(ТребуетсяКонтрольОстатков);
	
КонецПроцедуры

// Процедура производит контроль остатков.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма РМК.
//  КонтрольОстатковПройден - Булево - признак успешной проверки остатков.
//  ТекстОшибки - Строка - текст возможной ошибки.
//
Процедура ПроверитьНаличиеТоваров(Форма, КонтрольОстатковПройден, ТекстОшибки) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПроверитьНаличиеТоваров(Форма, КонтрольОстатковПройден, ТекстОшибки);
	
КонецПроцедуры

// Процедура производит контроль, чтобы количество возвращаемого товара не превысило количество проданного.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма РМК.
//  КонтрольПройден - Булево - признак успешной проверки количества.
//  ТекстОшибки - Строка - текст возможной ошибки.
//
Процедура ПроверитьВозможностьВозвратаПоЧекуККМ(Форма, КонтрольПройден, ТекстОшибки) Экспорт

	ОбщегоНазначенияРМКУНФ.ПроверитьВозможностьВозвратаПоЧекуККМ(Форма, КонтрольПройден, ТекстОшибки);

КонецПроцедуры

// Заполняет реквизиты эквайринговой операции Чека продажи.
//
// Параметры:
//  ЧекПродажи - ОпределяемыйТип.ЧекККМРМК - чек продажи, основание чека на возврат.
//  Реквизиты - Структура:
//    НомерПлатежнойКарты - Строка.
//    НомерЧекаЭТ - Строка.
//    СсылочныйНомер - Строка.
//    ЭквайринговыйТерминал - ОпределяемыйТип.ЭквайринговыйТерминалРМК.
//
Процедура ЗаполнитьРеквизитыЭквайринговойОперации(ЧекПродажи, Реквизиты) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьРеквизитыЭквайринговойОперации(ЧекПродажи, Реквизиты);
	
КонецПроцедуры

// Процедура устанавливает статус аннулированный у чекаККМ.
//
// Параметры:
//  ЧекККМ - ДокументСсылка.ЧекККМ - документ для изменения статуса.
//
Процедура АннулироватьЧек(ЧекККМ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.АннулироватьЧек(ЧекККМ);
	
КонецПроцедуры

// Переопределяет признак, который определяет возможность запуска РМК.
//
// Параметры:
//  МожноОткрыватьРМК - Булево - признак возможности запуска РМК.
//
Процедура ОпределитьВозможностьЗапускаРМК(МожноОткрыватьРМК) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьВозможностьЗапускаРМК(МожноОткрыватьРМК);
	
КонецПроцедуры

// Возвращает строку для печати на ФР разбитую по ширине ленты.
//
// Параметры:
//  МассивЧеков - Массив - массив документов, для которых нужно сформировать текст товарного чека.
//  ТекстЧека - Строка - текст товарного чека.
//  ШиринаЛенты - Число - ширина ленты печати.
//
Процедура СформироватьТекстТоварногоЧека(МассивЧеков, ТекстЧека, ШиринаЛенты = 32) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьТекстТоварногоЧека(МассивЧеков, ТекстЧека, ШиринаЛенты);
КонецПроцедуры

// Возвращает строку для печати на ФР разбитую по ширине ленты.
//
// Параметры:
//  МассивЧеков - Массив - массив документов, для которых нужно сформировать текст товарного чека.
//  ТекстЧека - Строка - текст товарного чека.
//  ШиринаЛенты - Число - ширина ленты печати.
//  ВыводитьШтрихкод - Булево - выводить штрихкод ссылки на заказ.
//
Процедура СформироватьТекстЗаказа(МассивЧеков, ТекстЧека, ШиринаЛенты = 32, ВыводитьШтрихкод = Ложь) Экспорт
	ОбщегоНазначенияРМКУНФ.СформироватьТекстЗаказа(МассивЧеков, ТекстЧека, ШиринаЛенты);
КонецПроцедуры

// Формирует запрос, который производит поиск чека по фискальному признаку в регистре "Фискальные операции".
//
// Параметры:
//  Запрос - Запрос - переопределяемый запрос.
//  Форма - ФормаКлиентскогоПриложения - форма выбора чека.
//  РасшифровкаКода - Структура - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыQRКодаЧекаККТ().
//
Процедура СформироватьЗапросЧекПоФискальномуПризнаку(Запрос, Форма, РасшифровкаКода) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросЧекПоФискальномуПризнаку(Запрос, Форма, РасшифровкаКода);
	
КонецПроцедуры

// Формирует запрос, который производит поиск чека по фискальному признаку в регистре "Фискальные операции".
//
// Параметры:
//  Запрос - Запрос - переопределяемый запрос.
//  Форма - ФормаКлиентскогоПриложения - форма выбора чека.
//  Штрихкод - Строка.
//
Процедура СформироватьЗапросЧекПоШтрихкоду(Запрос, Форма, Штрихкод) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросЧекПоШтрихкоду(Запрос, Форма, Штрихкод);
	
КонецПроцедуры

// Определяет присутствие товаров с возрастным ограничением в документе "ЧекККМ.
//
// Параметры:
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - анализируемый документ.
//  Результат - Булево - Истина, если в документе есть товары с возрастным ограничением.
//
Процедура ЗаполнитьПризнакЕстьТоварСВозрастнымОграничениемВЧекККМ(ЧекККМ, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакЕстьТоварСВозрастнымОграничениемВЧекККМ(ЧекККМ, Результат);
КонецПроцедуры

// Определяет необходимость ввода характеристики по переданной номенклатуре.
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК - номенклатура, для которой необходимо проверить характеристики.
//  Результат - Булево - признак необходимости ввода характеристики для номенклатуры.
//
Процедура ОпределитьНеобходимостьВводаХарактеристикиДляНоменклатуры(Номенклатура, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьНеобходимостьВводаХарактеристикиДляНоменклатуры(Номенклатура, Результат);
	
КонецПроцедуры

// Определяет текущее рабочее место.
//
// Параметры:
//  РабочееМесто - ОпределяемыйТип.РабочееМестоРМК - текущее рабочее место.
//
Процедура ОпределитьТекущееРабочееМесто(РабочееМесто) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьТекущееРабочееМесто(РабочееМесто);
	
КонецПроцедуры

// Заполняет массив видами номенклатуры, которые определили по значению особенности учета.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - текущее значение особенности учета номенклатуры.
//  МассивВидовНоменклатуры - Массив - массив, в который необходимо добавить значения видов номенклатуры.
//
Процедура ЗаполнитьМассивВидовНоменклатурыПоОсобенностиУчета(ОсобенностьУчета, МассивВидовНоменклатуры) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьМассивВидовНоменклатурыПоОсобенностиУчета(ОсобенностьУчета, МассивВидовНоменклатуры);
	
КонецПроцедуры

// Определяет значение текущего префикса информационной базы.
//
// Параметры:
//  ОчищатьПрефикс - Булево - признак необходимости сброса значения префикса.
//  ТекущийПрефикс - Строка - Значение текущего префикса информационной базы.
//
Процедура ЗаполнитьТекущийПрефиксИБ(ОчищатьПрефикс, ТекущийПрефикс) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТекущийПрефиксИБ(ОчищатьПрефикс, ТекущийПрефикс);
	
КонецПроцедуры

// Определяет физ лицо для текущего пользователя.
//
// Параметры:
//  ФизЛицоПользователя - ОпределяемыйТип.КассирРМК - физ лицо пользователя.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ОпределитьФизЛицоПользователя(ФизЛицоПользователя, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьФизЛицоПользователя(ФизЛицоПользователя, Форма);
	
КонецПроцедуры

// Заполняет ссылку, статус, номер и дату начала кассовой смены.
//
// Параметры:
//  ДанныеСмены - Структура - данные кассовой смены.
//  КассоваяСмена - ОпределяемыйТип.КассоваяСменаРМК.
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - Касса, последняя смена которой определяется.
//
Процедура ЗаполнитьДанныеКассовойСмены(ДанныеСмены, КассоваяСмена = Неопределено, КассаККМ = Неопределено) Экспорт
	

	
КонецПроцедуры

// Закрывает документ кассовой смены без синхронизации с оборудованием.
//
// Параметры:
//  КассоваяСмена - ОпределяемыйТип.КассоваяСменаРМК.
//
Процедура ЗакрытьКассовуюСменуБезОборудования(КассоваяСмена) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗакрытьКассовуюСменуБезОборудования(КассоваяСмена);
	
КонецПроцедуры

// Открывает документ кассовой смены без синхронизации с оборудованием.
//
// Параметры:
//  ПараметрыКассовойСмены - Структура - реквизиты для создания кассовой смены,
//  КассоваяСмена - ОпределяемыйТип.КассоваяСменаРМК,
//  Отказ - Булево - признак не успешности операции.
//
Процедура ОткрытьКассовуюСменуБезОборудования(ПараметрыКассовойСмены, КассоваяСмена, Отказ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОткрытьКассовуюСменуБезОборудования(ПараметрыКассовойСмены, КассоваяСмена, Отказ);
	
КонецПроцедуры

// Заполняет имя кассира и его ИНН для печати на ККТ.
//
// Параметры:
//  ПараметрыОперации - см.ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены().
//  ДополнительныеПараметрыДляПечати - Структура - структура параметров печати.
//
Процедура ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметрыДляПечати) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
	
КонецПроцедуры

// Заполняет сумму оплат, которые были приняты используя эквайринговый
// терминал, подключенный к программе.
//
// Параметры:
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - анализируемый документ.
//  СуммаОплат - Число - сумма безналичной оплаты.
//
Процедура ЗаполнитьСуммуБНОплатыЧекаККМ(ЧекККМ, СуммаОплат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСуммуБНОплатыЧекаККМ(ЧекККМ, СуммаОплат);
	
КонецПроцедуры

// Получает цену ЕМРЦ из данных информационной базы на дату.
//
// Параметры:
//  ОсобенностьУчета - Перечисления.ВидыМаркированнойПродукцииБПО - тип маркированной продукции для проверки цены.
//  Период - Дата - дата проверки цены.
//  ЕМРЦ - Число - значение ЕМРЦ.
//
Процедура ПолучитьЦенуЕМРЦ(ОсобенностьУчета, Период = Неопределено, ЕМРЦ = 0) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПолучитьЦенуЕМРЦ(ОсобенностьУчета, Период, ЕМРЦ);
	
КонецПроцедуры

// Отправляет SMS через настроенного поставщика услуги.
//
// Параметры:
//  НомераПолучателей - Массив из Строка - номера получателей в формате +7ХХХХХХХХХХ.
//  ТекстСообщения - Строка - текст сообщения, максимальная длина у операторов может быть разной.
//  РезультатОтправки - Структура:
//    Результат - Булево - Истина, если отправка SMS прошла успешно.
//    ОписаниеОшибки - Строка - Текст ошибки.
//    НомерТелефона - Строка - номер телефона получателя.
//
Процедура ОтправитьSMS(НомераПолучателей, ТекстСообщения, РезультатОтправки) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОтправитьSMS(НомераПолучателей, ТекстСообщения, РезультатОтправки);
	
КонецПроцедуры

// Заполняет признак возможности отправки СМС.
//
// Параметры:
//  ДоступнаОтправкаSMS - Булево - признак возможности отправки СМС
//
Процедура ПроверитьВозможностьОтправкиSMS(ДоступнаОтправкаSMS) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПроверитьВозможностьОтправкиSMS(ДоступнаОтправкаSMS);
	
КонецПроцедуры

// Процедура обработки документа "ЧекККМ" после пробития на ККТ.
//
// Параметры:
//  ВходящиеДанные - Структура - данные о результате пробития чека на ККТ.
//  ДополнительныеПараметры - Структура - дополнительные параметры пробития чека.
//  РезультатВыполненияПакетнойОперации - Структура, Неопределено - результат выполнения пакетной операции.
//
Процедура ФискализироватьЧекЗавершение(ВходящиеДанные, ДополнительныеПараметры,
		РезультатВыполненияПакетнойОперации = Неопределено, ОбъектОбработан = Истина) Экспорт
	ОбщегоНазначенияРМКУНФ.ФискализироватьЧекЗавершение(ВходящиеДанные, ДополнительныеПараметры,
		РезультатВыполненияПакетнойОперации);
КонецПроцедуры

// Рассчитывает автоматические скидки 
//
// Параметры:
//  ФормаРМК - ДанныеФормыКоллекция - данные объекта рабочего места кассира.
//  РезультатРасчета - Структура - структура результата выполнения расчета скидок
//
Процедура РассчитатьАвтоматическиеСкидки(ФормаРМК, РезультатВыполненияРасчета) Экспорт
	
	ОбщегоНазначенияРМКУНФ.РассчитатьАвтоматическиеСкидки(ФормаРМК, РезультатВыполненияРасчета);
	
КонецПроцедуры

// Заполняет массив особенностями учета номенклатуры, для которых разрешен возврат без указания марки.
//
// Параметры:
//  МассивОсобенностейУчета - Массив - массив особенностей учета номенклатуры.
//
Процедура ЗаполнитьМассивОсобенностейУчетаДляВозвратаБезМарки(МассивОсобенностейУчета) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьМассивОсобенностейУчетаДляВозвратаБезМарки(МассивОсобенностейУчета);
	
КонецПроцедуры

// Определяет является ли переданное значение особенности учета табачной продукцией.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета - табачная продукция.
//
Процедура ОпределитьОсобенностьУчетаТабачнаяПродукция(ОсобенностьУчета, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьОсобенностьУчетаТабачнаяПродукция(ОсобенностьУчета, Результат);
	
КонецПроцедуры

// Определяет является ли переданное значение особенности учета молочной продукцией.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета - молочная продукция.
//
Процедура ОпределитьОсобенностьУчетаМолочнаяПродукция(ОсобенностьУчета, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьОсобенностьУчетаМолочнаяПродукция(ОсобенностьУчета, Результат);
	
КонецПроцедуры

// Определяет является ли переданное значение особенности учета алкогольная продукцией.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета - алкогольная продукция.
//
Процедура ОпределитьОсобенностьУчетаАлкогольнаяПродукция(ОсобенностьУчета, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьОсобенностьУчетаАлкогольнаяПродукция(ОсобенностьУчета, Результат);
	
КонецПроцедуры

// Определяет является ли переданное значение особенности учета альтернативный табак.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета - альтернативный табак.
//
Процедура ОпределитьОсобенностьУчетаАльтернативныйТабак(ОсобенностьУчета, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьОсобенностьУчетаАльтернативныйТабак(ОсобенностьУчета, Результат);
	
КонецПроцедуры

// Определяет является ли переданное значение типа номенклатуры подарочный сертификат.
//
// Параметры:
//  ТипНоменклатуры - ОпределяемыйТип.ТипыНоменклатурыРМК - тип номенклатуры.
//  Результат - Булево - Истина, если типа номенклатуры - подарочный сертификат.
//
Процедура ОпределитьЭтоПодарочныйСертификатПоТипу(ТипНоменклатуры, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьТипНоменклатурыПодарочныйСертификат(ТипНоменклатуры, Результат);
	
КонецПроцедуры

// Определяет является ли документ чеком продажи.
//
// Параметры:
//  Результат - Булево - Истина, если документ - чек продажи.
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - чек ккм.
//
Процедура ОпределитьЧекККМПродажа(Результат, ЧекККМ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьЧекККМПродажа(Результат, ЧекККМ);
	
КонецПроцедуры

// Процедура заполняет свойства "КодТРУ" и "ВозможнаОплатаЭС" в строке товара.
//
// Параметры:
//  ДанныеСтроки - Структура - данные текущей строки.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ЗаполнитьВозможностьОплатыЭС(ДанныеСтроки, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьВозможностьОплатыЭС(ДанныеСтроки, Форма);
	
КонецПроцедуры

// В процедуре описывается условное оформление для настроек рабочего места кассира.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура НастроитьУсловноеОформлениеВНастройкахРМК(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НастроитьУсловноеОформлениеВНастройкахРМК(Форма);
	
КонецПроцедуры

// Процедура заполняет массив серий, исключая серии, которые уже присутствуют в РМК.
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК - товар, для которого необходимо заполнить партии.
//  МассивПартий - Массив - массив, в который необходимо добавить найденные партии.
//
Процедура ЗаполнитьСписокВыбораПартийНоменклатуры(Номенклатура, МассивПартий) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСписокВыбораПартийНоменклатуры(Номенклатура, МассивПартий);
	
КонецПроцедуры

// В процедуре производится прикладная логика, влияющая на
// заполнение серий и партий в строке товаров.
//
// Параметры:
//  ТекущаяСтрока - ДанныеТекущейСтроки - текущая строка товаров.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ПереопределитьПараметрыЗаполненияСерийИПартий(ТекущаяСтрока, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПереопределитьПараметрыЗаполненияСерийИПартий(ТекущаяСтрока, Форма);
	
КонецПроцедуры

// Заполняет таблицу данными о переданных товарах.
// Таблица должна содержать данные для заполнения табличной части "Товары" обработки "РабочееМестоКассира".
//
// Параметры:
//  МассивТоваров - Массив - массив, в котором содержится список товаров.
//  ТаблицаТовары - ТаблицаЗначений - таблица, в которую необходимо поместить информацию по товарам.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с получаемым товаром,
//												но не относящиеся к добавляемой строке товара непосредственно.
//
Процедура ЗаполнитьТаблицуТовары(МассивТоваров, ТаблицаТовары, ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуТовары(МассивТоваров, ТаблицаТовары, ДополнительныеИсходящиеДанные);
	
КонецПроцедуры

// В процедуре производится получение состава набора и заполнение
// таблицы товарами, которые входят в состав набора.
// Также необходимо заполнить в таблице все данные для товара, которые получают в
// ОбщегоНазначенияРМКПереопределяемый.ТаблицаДанныхОТоварах.
//
// Параметры:
//  ДанныеНабора - Структура - данные выбранного набора.
//  ТаблицаСоставНабора - ТаблицаЗначений - таблица, в которой находятся строки с товарами из состава набора и их данные.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с получаемым товаром,
//												но не относящиеся к добавляемой строке товара непосредственно.
//
Процедура ЗаполнитьСоставНабора(ДанныеНабора, ТаблицаСоставНабора, Форма,
		ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСоставНабора(ДанныеНабора, ТаблицаСоставНабора, Форма, ДополнительныеИсходящиеДанные);
	
КонецПроцедуры

// Формирует текст сообщения по шаблону сообщения.
//
// Параметры:
//  ШаблонСообщения - СправочникСсылка.ШаблоныСообщений - ссылка на шаблон сообщения.
//  ДополнительныеПараметры - Структура - список дополнительных параметров, который будет передан в параметр
//                                        Сообщение в процедурах ПриФормированииСообщения при создании сообщения.
//  ТекстСообщения - Строка - текст отправляемого сообщения.
//
Процедура СформироватьТекстСообщения(ШаблонСообщения, ДополнительныеПараметры, ТекстСообщения) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьТекстСообщения(ШаблонСообщения, ДополнительныеПараметры, ТекстСообщения);
	
КонецПроцедуры

// Процедура настраивает динамический список для получения списка чеков для возврата скупки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековККМНаВозвратСкупки(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуЧековККМНаВозвратСкупки(Форма);
	
КонецПроцедуры

// Определяет необходимость выполнения интерактивной проверки кода маркировки в форме РМК.
// Под проверкой понимается отправка и ожидание результата проверки кода маркировки от ОИСМ (если настройка включена).
//
// Параметры:
//  ПроверятьМаркированныйТоварНаККТ - Булево - признак необходимости проверки марки на ККТ.
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
// 
Процедура ЗаполнитьНеобходимостьПроверкиМаркиНаККТ(ПроверятьМаркированныйТоварНаККТ, ПодключаемоеОборудование) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНеобходимостьПроверкиМаркиНаККТ(
		ПроверятьМаркированныйТоварНаККТ,
		ПодключаемоеОборудование);
	
КонецПроцедуры

// Настраивает запрос по умолчанию для динамического списка реквизита "ТаблицаЧековККМ".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура СформироватьЗапросТаблицаЧековПоУмолчанию(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.СформироватьЗапросТаблицаЧековПоУмолчанию(Форма);
	
КонецПроцедуры

// Настраивает динамический список для получения списка чеков предоплаты.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековККМПредоплаты(Форма) Экспорт

КонецПроцедуры

// Настраивает динамический список для получения списка чеков оплаченных в рассрочку.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы выбора чеков.
//
Процедура ЗаполнитьТаблицуЧековККМОплаченныхВРассрочку(Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуЧековККМОплаченныхВРассрочку(Форма);
КонецПроцедуры

// Обрабатывает результат подбора товаров из формы подбора товаров.
// Метод вызывается после обработки оповещения о закрытии формы подбора товаров.
//
// Параметры:
//  РезультатПодбора - ПроизвольноеЗначение - результат подбора товаров из формы подбора товаров;
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ДополнительныеИсходящиеДанные - Структура - дополнительные данные, связанные с заполняемым товаром,
//												но не относящиеся к добавляемой строке товара непосредственно.
//
Процедура ЗаполнитьПоПодборуТоваров(РезультатПодбора, Форма, ДополнительныеИсходящиеДанные = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПоПодборуТоваров(РезультатПодбора, Форма, ДополнительныеИсходящиеДанные);
КонецПроцедуры

// Процедура настраивает элементы настроек форм подбора в настройках РМК.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы настроек РМК.
//
Процедура НастроитьЭлементыПодбораТоваров(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НастроитьЭлементыПодбораТоваров(Форма);
	
КонецПроцедуры

// Метод реализующий дополнительную логику при сохранении настроек рабочего места кассира.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ОбщаяФорма.НастройкиРабочегоМестаКассира.
//  Результат - Структура - возвращаемый параметр работы метода, ключи структуры:
//   * ВыполненоУспешно - Булево - Ложь, если сохранение настроек формы недопустимо.
//   * ТекстПредупрежденийОшибок - Строка - текст сообщения об ошибке, который будет выведен пользователю.
//
Процедура ПриСохраненииНастроекРМК(Форма, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПриСохраненииНастроекРМК(Форма, Результат);
	
КонецПроцедуры

// Позволяет обработать событие ОбработкаОповещения для формы Обработки.РабочееМестоКассира.Формы.ФормаРМК. на сервере.
// Дополнительно см. метод ОбщегоНазначенияРМККлиентПереопределяемый.ОбработкаОповещения.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - текущая форма приложения.
//  ИмяСобытия - Строка - название текущего события.
//  Параметр - Неопределено, Структура - параметры обработки оповещения.
//  Источник - Строка - название источника оповещения.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

// Переопределяет значение владельца кода доступа по исходным данным
//
// Параметры:
//  ВладелецКодаДоступа - ОпределяемыйТип.КассирРМК
//
Процедура ПереопределитьВладельцаКодаДоступа(ВладелецКодаДоступа) Экспорт
	ОбщегоНазначенияРМКУНФ.ПереопределитьВладельцаКодаДоступа(ВладелецКодаДоступа);
КонецПроцедуры

// Создает документ внесения ДС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ОбщаяФорма.НастройкиРабочегоМестаКассира.
//  Отказ - Булево - флаг ошибки при выполнении;
//  ОписаниеОшибки - Строка - описание ошибки выполнения. 
//
Процедура СоздатьВнесениеДС(Форма, Отказ, ОписаниеОшибки) Экспорт
КонецПроцедуры

// Создает документ выемки ДС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ОбщаяФорма.НастройкиРабочегоМестаКассира.
//  Отказ - Булево - флаг ошибки при выполнении;
//  ОписаниеОшибки - Строка - описание ошибки выполнения. 
//
Процедура СоздатьВыемкуДС(Форма, Отказ, ОписаниеОшибки) Экспорт
КонецПроцедуры

// Проверяет серию подарочного сертификата на факт использования
// 
// Параметры:
//  Серия - ОпределяемыйТип.СерияРМК - Серия проверяемого подарочного сертификата
//  ТекущаяНастройкаРМК - Справочник.НастройкиРабочегоМестаКассира - текущие настройки РМК
//  Результат - Булево - результат проверки серии подарочного сертификата
//
Процедура ПроверитьСериюПодарочногоСертификата(Серия, ТекущаяНастройкаРМК, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ПроверитьСериюПодарочногоСертификата(Серия, ТекущаяНастройкаРМК, Результат);
КонецПроцедуры

// Проверяет настройки касс ККМ перед открытием формы РМК.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  Отказ - Булево - флаг ошибки.
//  ТекстЗаголовка - Строка - текст заголовка ошибки.
//  ТекстСообщения - Строка - текст сообщения ошибки.
//
Процедура ПроверитьНастройкиКассККМ(Форма, Отказ, ТекстЗаголовка, ТекстСообщения) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПроверитьНастройкиКассККМ(Форма, Отказ, ТекстЗаголовка, ТекстСообщения);
	
КонецПроцедуры

// Заполняет вид номенклатуры
// 
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК номенклатура вид которой необходимо получить
//  Результат - ОпределяемыйТип.ВидНоменклатурыРМК - результат заполнения
//
Процедура ЗаполнитьВидНоменклатуры(Номенклатура, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьВидНоменклатуры(Номенклатура, Результат);
КонецПроцедуры

// Заполняет тип номенклатуры
// 
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК номенклатура вид которой необходимо получить
//  Результат - ПеречислениеСсылка.ТипНоменклатуры - результат заполнения
//
Процедура ЗаполнитьТипНоменклатуры(Номенклатура, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТипНоменклатуры(Номенклатура, Результат);
КонецПроцедуры

// Получает ссылку на подарочный сертификат по ГУИД.
//
// Параметры:
//  ГУИД - Строка - значение ГУИД, по которому необходимо получить подарочный сертификат.
//  Результат - ОпределяемыйТип.НоменклатураРМК, Неопределено - возвращаемый параметр для значения подарочного сертификата.
//
Процедура ПодарочныйСертификатПоГУИД(ГУИД, Результат = Неопределено) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПодарочныйСертификатПоГУИД(ГУИД, Результат = Неопределено);
	
КонецПроцедуры

// Процедура определяет актуальный баланс подарочного сертификата.
//
// Параметры:
//  ПараметрыСертификата - Структура:
//    БалансСертификата - Число - баланс подарочного сертификата.
//    Сертификат - ОпределяемыйТип.НоменклатураРМК - подарочный сертификат.
//    Серия - ОпределяемыйТип.СерияРМК - серия подарочного сертификата.
//
Процедура ЗапроситьБалансСертификата(ПараметрыСертификата) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗапроситьБалансСертификата(ПараметрыСертификата);
КонецПроцедуры

// Процедура корректирует цену подарочного сертификата в строке.
// Если текущая операция возврат и в текущей строке серийный подарочный сертификат, то цена должна быть установлена
// равной 0, чтобы запросить актуальный баланс сертификата.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ТекущаяСтрока - Структура - данные текущей строки.
//
Процедура СкорректироватьЦенуПодарочногоСертификата(Форма, ТекущаяСтрока) Экспорт
	ОбщегоНазначенияРМКУНФ.СкорректироватьЦенуПодарочногоСертификата(Форма, ТекущаяСтрока);
КонецПроцедуры

// Рассчитывает цену на товар, который был выбран в строке быстрого добавления товара..
//
// Параметры:
//  ПараметрыРасчетаЦены - см. ОбщегоНазначенияРМК.ПараметрыРасчетаЦены().
//
Процедура РассчитатьЦенуВыбранногоТовара(ПараметрыРасчетаЦены) Экспорт
	ОбщегоНазначенияРМКУНФ.РассчитатьЦенуВыбранногоТовара(ПараметрыРасчетаЦены);
КонецПроцедуры

// Процедура позволяет переопределить данные в строке после выбора серии и/или партии.
//
// Параметры:
//  ТекущаяСтрока - Структура - данные текущей строки.
//
Процедура УточнитьДанныеДляСтрокиПриВыбореСерииИПартии(ТекущаяСтрока) Экспорт
	ОбщегоНазначенияРМКУНФ.УточнитьДанныеДляСтрокиПриВыбореСерииИПартии(ТекущаяСтрока);
КонецПроцедуры

// Переопределение формирования отчета за смену
//
// Параметры:
//  ИсходныеДанные - Структура. Структура с параметрами отбора для формирования отчета за смену.
//  ДанныеДляОтчета - Структура (см. ОбщегоНазначенияРМК.ПолучитьДанныеОтчетаЗаСмену)
//
Процедура ЗаполнитьДанныеОтчетаЗаСмену(ИсходныеДанные, ДанныеДляОтчета) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеОтчетаЗаСмену(ИсходныеДанные, ДанныеДляОтчета);
	
КонецПроцедуры

// Процедура заполняет данные чеков для расшифровки отчета за смену
//
// Параметры:
//  ДеревоЧековТоваров - ДеревоЗначений. Колонки:
//     *Чек - ОпределяемыйТип.ЧекККМРМК. Заполняется на первом уровне,
//     *ЧекПредставление - Строка. Заполняется на первом уровне,
//     *Сумма - Число 15, 2. На первом уровне сумма чека, на втором сумма товара,
//     *ТекстОшибки - Строка. Заполняется на первом уровне,
//     *НоменклатураПредставление - Строка. Заполняется на втором уровне,
//     *Количество - Число 15, 3. Количество товара. Заполняется на втором уровне.
//
Процедура ЗаполнитьДеталиЧековДляРасшифровкиОтчетаЗаСмену(ДеревоЧековТоваров) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДеталиЧековДляРасшифровкиОтчетаЗаСмену(ДеревоЧековТоваров);
	
КонецПроцедуры

// Устанавливает признаки видов оплат в настройкахРМК по данным информационной базы.
//
// Параметры:
//  ОбъектНастройкаРМК - СправочникОбъект.НастройкиРабочегоМестаКассира - настройка РМК.
//
Процедура ОбновитьНастройкиПризнаковВидовОплат(ОбъектНастройкаРМК) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбновитьНастройкиПризнаковВидовОплат(ОбъектНастройкаРМК);
КонецПроцедуры

// Устанавливает признак использовать оплату платежными картами в настройкахРМК по данным информационной базы.
//
// Параметры:
//  ОбъектНастройкаРМК - СправочникОбъект.НастройкиРабочегоМестаКассира - настройка РМК.
//
Процедура ОбновитьПризнакОплатыПлатежнымиКартами(ОбъектНастройкаРМК) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбновитьПризнакОплатыПлатежнымиКартами(ОбъектНастройкаРМК);
КонецПроцедуры

// Определяет существование кода у кассира
//
// Параметры:
//  КассирДляПроверки - ОпределяемыйТип.КассирРМК - проверяемый кассир
//  Результат - Булево - признак установленного кода у кассира
//
Процедура ОпределитьСуществованиеКодаУКассира(КассирДляПроверки, Результат, ДополнительныеПараметры = Неопределено) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСуществованиеКодаУКассира(КассирДляПроверки, Результат);
КонецПроцедуры

// Заполняет ТаблицаОстатков на форме РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ПараметрыПолученияОстатков - Структура:
//    Номенклатура - ОпределяемыйТип.НоменклатураРМК - номенклатура.
//    Характеристика - ОпределяемыйТип.ХарактеристикаРМК - характеристика.
//    Упаковка - ОпределяемыйТип.УпаковкаРМК - упаковка.
//
Процедура ЗаполнитьТаблицуОстатков(Форма, ПараметрыПолученияОстатков) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТаблицуОстатков(Форма, ПараметрыПолученияОстатков);
	
КонецПроцедуры

// Заполняет номенклатуру по кодам ТРУ.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  МассивТРУ - Массив - массив кодов ТРУ.
//
Процедура ЗаполнитьНоменклатуруПоТРУ(Форма, МассивТРУ) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНоменклатуруПоТРУ(Форма, МассивТРУ);
КонецПроцедуры

// Устанавливает признак наличия в программе сотрудников с правами отмены чека, у которых введен код подтверждения.
//
// Параметры:
//  НастроеныСотрудникиДляОтменыЧека - Булево.
//  ДополнительныеПараметры - Структура - дополнительные параметры для проверки. Необязательный.
//
Процедура ПроверитьНаличиеКодаПодтвержденияУСотрудниковСПравамиОтменыЧека(НастроеныСотрудникиДляОтменыЧека,
		ДополнительныеПараметры = Неопределено) Экспорт
		


	
КонецПроцедуры

// Дополняет подменю настроек РМК сценариями использования РМК
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма настроек рабочего места кассира.
//
Процедура ДополнитьДоступныеСценарииИспользованияРМК(Форма) Экспорт
	

	
 КонецПроцедуры
 
// Дозаполняет значения по умолчанию в настройках РМК для сценария "Терминал самообслуживания"
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки рабочего места кассира.
//
Процедура ДополнитьЗначенияНастроекДляТерминалаСамообслуживания(Форма) Экспорт
	
	 
	 
КонецПроцедуры

// Настраивает видимость элементов формы настроек РМК в зависимости от выбранного сценария использования
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки рабочего места кассира.
//
Процедура НастроитьВидимостьЭлементовНастройкиРМК(Форма) Экспорт
	

	
КонецПроцедуры

// Заполняет максимальный кассовый профиль переданного пользователя
// 
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК - пользователь, чей максимальный профиль необходимо определить.
//  МаксимальныйПрофиль - СправочникСсылка.ПрофилиГруппДоступа - максимальный кассовый профиль пользователя.
//
Процедура ЗаполнитьМаксимальныйКассовыйПрофильПользователя(Пользователь, МаксимальныйПрофиль) Экспорт
	

	
КонецПроцедуры

// Проверяет, что пользователю доступен только режим кассы самообслуживания.
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК - пользователь, чей максимальный профиль необходимо определить.
//  ДоступенТолькоРежимКСО - Булево.
//
Процедура УстановитьПользователюПризнакДоступностиТолькоРежимаКСО(Пользователь, ДоступенТолькоРежимКСО) Экспорт
	

	
КонецПроцедуры

// Обновляет динамический список товаров каталога на форме РМК.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки рабочего места кассира.
//  СтандартнаяОбработка - Булево.
//
Процедура ОбновитьДинамическийСписокТоваров(Форма, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Настройка элементов формы "Помощник настройки РМК".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма обработки помощник настроек РМК.
//
Процедура ПереопределитьНастройкиПомощникРМК(Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.ПереопределитьНастройкиПомощникРМК(Форма);
КонецПроцедуры

// Заполняет таблицу данных контрагента по переданному контрагенту
//
// Параметры:
//  Контрагент - ОпределяемыйТип.КонтрагентРМК.
//  АдресТаблицыДанныеКлиента - Строка - Адрес таблицы данных клиентов
//  	*Карта - ссылка на карту лояльности
//  	*НомерКарты - номер карты лояльности (штрихкод или магнитный код)
//  	*НомерТелефона - номер телефона владельца карты лояльности
//
Процедура ПолучитьДанныеЛокальнойКартыКонтрагента(Контрагент, АдресТаблицыДанныеКлиента) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПолучитьДанныеЛокальнойКартыКонтрагента(Контрагент, АдресТаблицыДанныеКлиента);
	
КонецПроцедуры

// Процедура заполняет остаток по строке
//
// Параметры:
//  ДанныеСтроки - Структура - данные текущей строки.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект для отбора остатков
//
Процедура ЗаполнитьКолонкуОстаток(ДанныеСтроки, ТорговыйОбъект) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьКолонкуОстаток(ДанныеСтроки, ТорговыйОбъект);
	
КонецПроцедуры

// Возвращает значение перезаполнения данных в панели избранных товаров
//
// Параметры:
//  ОтображатьОстаток - Булево
//
// Возвращаемое значение:
//  Результат - Булево - признак перезаполнения данных в панели избранных товаров.
//
Функция ПерезаполнитьИзбранное(ОтображатьОстаток) Экспорт
	Возврат ОбщегоНазначенияРМКУНФ.ПерезаполнитьИзбранное(ОтображатьОстаток);
КонецФункции

// Возвращает значение перезаполнения данных в плиточном интерфейсе
//
// Параметры:
//  ОтображатьОстаток - Булево
//
// Возвращаемое значение:
//  Результат - Булево - признак перезаполнения данных в плиточном интерфейсе.
//
Функция ПерезаполнитьПлиточныйИнтерфейс(ОтображатьОстаток) Экспорт
	Возврат ОбщегоНазначенияРМКУНФ.ПерезаполнитьПлиточныйИнтерфейс(ОтображатьОстаток);
КонецФункции

// Проверяет соответствие чека по заказу покупателя
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма настройки рабочего места кассира.
//  ТекстОшибки - Строка - текст возможной ошибки.
//
Процедура ПроверитьСоответствиеЗаказу(Форма, ТекстОшибки) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПроверитьСоответствиеЗаказу(Форма, ТекстОшибки);
	
КонецПроцедуры

// Настраивает форму РМК при создании нового набора
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура НастроитьФормуПриСозданииНовогоНабора(Форма) Экспорт

КонецПроцедуры

// Создает новый заказ покупателя из формы РМК
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура СоздатьЗаказПокупателя(Форма) Экспорт

КонецПроцедуры

// Проверяет наличие признака НДС сверху, для организаций плательщиков НДС 
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  Отказ - Истина - признак наличия отказа, выставляется при выявлении ошибки настройки.
//  ТекстЗаголовка - Строка - текст заголовка ошибки для передачи в заголовок панели ошибок формы РМК.
//  ТекстСообщения - Строка - текст ошибки для передачи в тело ошибки панели ошибок формы РМК.
//
//
Процедура ПроверитьИспользованиеНДССверху(Форма, Отказ, ТекстЗаголовка, ТекстСообщения) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПроверитьИспользованиеНДССверху(Форма, Отказ, ТекстЗаголовка, ТекстСообщения);
	
КонецПроцедуры

// Переопределение увеличения размеров команд на форме РМК.
// Вызывается при заполнении формы после создания на сервере.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ПараметрыУвеличенногоИнтерфейса - Структура - см. ИнтерфейсРМКСлужебный.ПараметрыУвеличенногоИнтерфейса.
//
//
Процедура УвеличитьРазмерКоманд(Форма, ПараметрыУвеличенногоИнтерфейса) Экспорт
	
	//
	
КонецПроцедуры

// Заполняет данные выбора по номенклатуре, для добавления в корзину РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира
//  ДанныеВыбора - Структура:
//    Номенклатура - ОпределяемыйТип.НоменклатураРМК - номенклатура.
//    Характеристика - ОпределяемыйТип.ХарактеристикаРМК - характеристика.
//    Упаковка - ОпределяемыйТип.УпаковкаРМК - упаковка.
//    Цена
//    ОсобенностьУчета
//    ВидНоменклатуры
//    ВыборТовараВручную
//
Процедура ПодготовитьДанныеВыбораНоменклатуры(Форма, ДанныеВыбора) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПодготовитьДанныеВыбораНоменклатуры(Форма, ДанныеВыбора);
	
КонецПроцедуры

// Устанавливает значение для видимости ручной скидки на форме РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира
//
//
Процедура УстановитьЗначениеПримененияРучнойСкидки(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.УстановитьЗначениеПримененияРучнойСкидки(Форма);
	
КонецПроцедуры

// Устанавливает видимость элементов доступных остатков в зависимости от настройки РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира
//
Процедура ДополнитьНастройкиОтображенияОстатков(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ДополнитьНастройкиОтображенияОстатков(Форма);
	
КонецПроцедуры

// Устанавливает видимость элементов функционала предоплаты и рассрочки в зависимости от настройки РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира
//
Процедура НастроитьЭлементыПредоплатыИРассрочки(Форма) Экспорт
	

	
КонецПроцедуры

// Устанавливает признак пересчета автоматических скидок
//
// Параметры:
//  ВыполнитьПересчетАвтоматическихСкидок - Булево - признак пересчета автоматических скидок, после применения ручных
//
Процедура ЗаполнитьПризнакПересчетаСкидок(ВыполнитьПересчетАвтоматическихСкидок) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакПересчетаСкидок(ВыполнитьПересчетАвтоматическихСкидок);
	
КонецПроцедуры

// Переопределяет запрос динамического списка.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - общая форма настроек РМК.
//
Процедура ПереопределитьДинамическийСписокКассирыДляВхода(Форма) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Переопределяет настройки отображения продавцов
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - общая форма настроек РМК.
//
Процедура ПереопределитьНастройкиПродавцов(Форма) Экспорт
	

	
КонецПроцедуры

// Заполняет признак учета дисконтных карт на форме РМК
// 
// Параметры:
//  ВводДисконтныхКарт - Булево - заполняемый признак учета.
//
Процедура ЗаполнитьВводДисконтныхКарт(ВводДисконтныхКарт) Экспорт
	
	ВводДисконтныхКарт = Истина;
	ОбщегоНазначенияРМКУНФ.ЗаполнитьВводДисконтныхКарт(ВводДисконтныхКарт);
	
КонецПроцедуры

// Заполняет признак выбора склада при продаже в РМК
// 
// Параметры:
//  ИспользоватьВыборСкладаПриПродаже - Булево - заполняемый признак.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект для которого происходит настройка.
//
Процедура ЗаполнитьПризнакИспользованияВыборСкладаПриПродаже(ИспользоватьВыборСкладаПриПродаже, ТорговыйОбъект) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияВыборСкладаПриПродаже(ИспользоватьВыборСкладаПриПродаже, ТорговыйОбъект);
	
КонецПроцедуры

// Заполняет параметры формы настроек рабочего места кассира
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма настроек рабочего места кассира.
//
Процедура ЗаполнитьПараметрыФормыНастроекРабочегоМестаКассира(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыФормыНастроекРабочегоМестаКассира(Форма);
	
КонецПроцедуры

// Формирует печатную форму согласия на обработку персональных данных при выдаче дисконтной карты
// 
// Параметры:
//  Форма - ТабличныйДокумент - табличный документ для формирования печатной формы.
//  ДанныеПокупателя - Структура - информация о покупателе, которую необходимо разместить в печатной форме
//
Процедура СформироватьТабличныйДокументСогласияНаОбработкуПерсональныхДанных(ТабличныйДокумент, ДанныеПокупателя) Экспорт	
	
	ОбщегоНазначенияРМКУНФ.СформироватьТабличныйДокументСогласияНаОбработкуПерсональныхДанных(ТабличныйДокумент, ДанныеПокупателя);

КонецПроцедуры

// Выполняет автоматическое распределение подобранных товаров по партиям
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира
//
Процедура ВыполнитьРаспределениеТоваровПоПартиям(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ВыполнитьРаспределениеТоваровПоПартиям(Форма);
	
КонецПроцедуры

// Заполняет признак использования продавцов в Рабочем месте кассира
//
// Параметры:
//  НеИспользоватьПродавцов - Булево - заполняемый признак учета
//
Процедура ЗаполнитьПризнакИспользованияПродавцовВРМК(НеИспользоватьПродавцов) Экспорт
	

	
КонецПроцедуры

// Заполняет признак использования серий в Рабочем месте кассира
//
// Параметры:
//  СерииНеВыгружаются - Булево - заполняемый признак учета
//
Процедура ЗаполнитьПризнакИспользованияСерийВРМК(СерииНеВыгружаются) Экспорт
	

	
КонецПроцедуры

// Определяет факт наличия синхронизации РМК с мастер - системой.
//
// Параметры:
//  НастройкаСуществует - Булево - истина, если настройка существует.
//
Процедура ОпределитьСуществованиеНастройкиСинхронизацииДанных(НастройкаСуществует) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьСуществованиеНастройкиСинхронизацииДанных(НастройкаСуществует);
	
КонецПроцедуры

// Определяет используется ли стандартный расчет скидок
//
// Параметры:
//  СтандартныйРасчетСкидок - Булево - определяет способ расчета скидок.
Процедура ОпределитьСтандартныйРасчетСкидок(СтандартныйРасчетСкидок) Экспорт
	
	
	
КонецПроцедуры

// Проверяет, были ли необходимые подарка добавлены в состав чека ранее. 
// Убирает из исходной таблицы те подарки что уже были выбраны ранее, и корректирует идентификатор строк в таблице скидок.
//
// Параметры:
//  ФормаРМК - ФормаКлиентскогоПриложения - форма рабочего места кассира
//  ТаблицаТоваров - ТаблицаЗначений - Таблица товаров формы РМК
//  ТаблицаПодарков - ТаблицаЗначений - Таблица подарков, которые необходимо выдать по результату расчета
//  ТаблицаСкидкиНаценки - ТаблицаЗначений - Таблица скидок. Связывает сработавшие скидки-подарки со строками самих подарков в товарах, если они были выбраны в чек ранее
//
Процедура ОбработатьТаблицуПодарков(ФормаРМК, ТаблицаТоваров, ТаблицаПодарков, ТаблицаСкидкиНаценки) Экспорт

	ОбщегоНазначенияРМКУНФ.ОбработатьПолученнуюТаблицуПодарков(ФормаРМК, ТаблицаТоваров, ТаблицаПодарков, ТаблицаСкидкиНаценки);
	//ОписаниеРанееВыданныхПодарков = СкидкиНаценкиСервер.УчестьРанееВыданныеПодарки(ТаблицаТоваров, ТаблицаПодарков,,Истина)
	//СоответствиеСтрокПодарковТоварам = ОписаниеРанееВыданныхПодарков["СоответствиеСтрокПодарковТоварам"];
	//ТоварыУдалить  = ОписаниеРанееВыданныхПодарков["ТоварыУдалить"];
	//Если ТоварыУдалить.Количество() > 0 Тогда
	//	ОчиститьЗапасыОтПодарков(Объект, НаименованиеТЧ, ТоварыУдалить); 
	//КонецЕсли;
	//ПодаркиУдалить = ОписаниеРанееВыданныхПодарков["ПодаркиУдалить"];
	//Если Не ТЧПодарки = Неопределено И ПодаркиУдалить.Количество() > 0 Тогда
	//	Для Каждого СтрокаУдалить Из ПодаркиУдалить Цикл
	//		ТЧПодарки.Удалить(СтрокаУдалить);
	//	КонецЦикла;
	//КонецЕсли;

	//СтрокиПодароковНаВыбор = ТаблицаПодарков.НайтиСтроки(Новый Структура("ПодарокИзСписка", Истина));
	//ТаблицаПодарковНаВыбор = ТаблицаПодарков.Скопировать(СтрокиПодароковНаВыбор);
	//Если ТаблицаПодарковНаВыбор.Количество() > 0 Тогда
	//	Для Каждого строкаПодаркаНаВыбор Из ТаблицаПодарковНаВыбор Цикл 
	//		ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(ТаблицаПодарковНаВыбор, строкаПодаркаНаВыбор, "КлючСвязи");
	//	КонецЦикла;
	//	РасчетныеСкидки.Вставить("ТаблицаПодарковНаВыбор", ТаблицаПодарковНаВыбор);
	//КонецЕсли;
	//Для Каждого СтрокаПодаркаНаВыбор Из СтрокиПодароковНаВыбор Цикл
	//	ТаблицаПодарков.Удалить(СтрокаПодаркаНаВыбор);
	//КонецЦикла;   

	//ОбновитьСкидкиПослеПереносаПодарков(СоответствиеСтрокПодарковТоварам, Объект, НаименованиеТЧ, РасчетныеСкидки);

	//НовыеПодарки = ТаблицаПодарков.НайтиСтроки(Новый Структура("УжеВыдан", Ложь));
	//Для Каждого ПодарокВыдать Из НовыеПодарки Цикл
	//	НоваяСтрока = Объект.Подарки.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодарокВыдать);
	//	ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(Объект.Подарки, НоваяСтрока, "КлючСвязи");
	//КонецЦикла;

КонецПроцедуры

// Получает данные продаж за смену.
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - кассовая смена для получения данных продаж 
//  ДанныеСмены - Структура - структура данных за смену
//
Процедура ПолучитьДанныеПродажЗаСмену(КассоваяСмена, ДанныеСмены) Экспорт
	
	РозничныеПродажиСервер.ПолучитьДанныеПродажЗаСмену(КассоваяСмена, ДанныеСмены);
	
КонецПроцедуры

// Получает данные продаж за смену.
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - кассовая смена для получения данных продаж 
//  МассивФискальныхДокументов - Массив - Данные по документам за смену
//
Процедура ЗаписатьДанныеДокументовЗаСмену(КассоваяСмена, МассивФискальныхДокументов) Экспорт
	
	РозничныеПродажиСервер.ЗаписатьДанныеДокументовЗаСмену(КассоваяСмена, МассивФискальныхДокументов);
	
КонецПроцедуры

// Заполняет нормализованный код маркировки
//
// Параметры:
//  КодМаркировки - Строка - исходный код маркировки
//  КодНормализованный - Строка - нормализованный код маркировки
Процедура ЗаполнитьНормализованныйКодМаркировки(КодМаркировки, КодНормализованный) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНормализованныйКодМаркировки(КодМаркировки, КодНормализованный);
	
КонецПроцедуры

// Заполняет коды маркировки по данным информационной базы, актуальные для строки товаров.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ТекущаяСтрока - Структура - данные текущей строки.
//  КодыМаркировки - Таблица значений, См. ОбщегоНазначенияРМК.КодыМаркировкиПоДаннымИБШаблон - возвращаемое значение.
//
Процедура ЗаполнитьКодыМаркировкиПоДаннымИБ(Форма, ТекущаяСтрока, КодыМаркировки) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьКодыМаркировкиПоДаннымИБ(Форма, ТекущаяСтрока, КодыМаркировки);
КонецПроцедуры

// Заполняет список распознанных весовых товаров, находящихся в продаже, по данных кодов SKU,
// полученных от устройства распознавания
//
// Параметры:
//  ПараметрыПолученияТоваров - Структура - данные для отборов при получении списка распознанных товаров:
//		*ВесовыеТовары - ТаблицаЗначений с колонками:
//			*Номенклатура - ОпределяемыйТип.НоменклатураРМК,
//			*Характеристика - ОпределяемыйТип.ХарактеристикаРМК.
//		*РаспознанныеТовары - ТаблицаЗначений с колонками:
//			*Код - Число - код SKU, полученный от устройства распознавания
//			*Вероятность - Число - вероятнось совпадения товара
//		(*) - дополнительные параметры прикладного решения. Подробнее в переопределяемых модулях прикладного решения.
//  РезультатФункции - Массив - элементы, структура, с данными товаров, с колонками:
//								"Номенклатура", "Характеристика", "Вероятность".
//
Процедура ЗаполнитьТоварыПоДаннымРаспознавания(ПараметрыПолученияТоваров, РезультатФункции) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТоварыПоДаннымРаспознавания(ПараметрыПолученияТоваров, РезультатФункции);
	
КонецПроцедуры

// Заполняет таблицу весовых товаров, которые могут быть загружены в устройства, требующие кода SKU
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма обучения устройств распознавания.
//  РезультатФункции - Таблица значений с колонками:
//		*Номенклатура - ОпределяемыйТип.НоменклатураРМК,
//		*Характеристика - ОпределяемыйТип.ХарактеристикаРМК,
//		*Весовой - Булево,
//		*SKU - Число.
//
Процедура ЗаполнитьВесовыеТоварыДляРаботыСУстройствами(Форма, РезультатФункции) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьВесовыеТоварыДляРаботыСУстройствами(Форма, РезультатФункции);
	
КонецПроцедуры

// Настраивает форму обучения устройств распознавания
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма обучения устройств распознавания.
//
Процедура НастроитьФормуОбученияУстройствРаспознавания(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НастроитьФормуОбученияУстройствРаспознавания(Форма);
	
КонецПроцедуры

// Определяет является ли период хранения бессрочным.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения бессрочный.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияВесьПериод(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияВесьПериод(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - день.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = День.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияДень(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияДень(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - неделя.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = Неделя.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияНеделя(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияНеделя(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - декада.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = Декада.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияДекада(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияДекада(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - месяц.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = Месяц.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияМесяц(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияМесяц(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - квартал.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = Квартал.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияКвартал(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияКвартал(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - полугодие.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = Полугодие.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияПолугодие(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияПолугодие(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Определяет является ли период хранения - год.
//
// Параметры:
//  РезультатФункции - Булево - признак, который говорит, что период хранения = Год.
//  ПериодХранения - ОпределяемыйТип.ПериодХраненияИсторииРМК - текущий период хранения.
//
Процедура ОпределитьСрокХраненияГод(РезультатФункции, ПериодХранения) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьСрокХраненияГод(РезультатФункции, ПериодХранения);
КонецПроцедуры

// Выполняет дополнительные настройки перед компоновкой результата отчета "Незавершенные действия с чеком"
//
// Параметры:
//  ОбъектОтчет - ОтчетОбъект.НезавершенныеДействияСЧекомРМК
//
Процедура ПриКомпоновкеРезультатаОтчетаНезавершенныхДействийСЧеком(ОбъектОтчет) Экспорт

КонецПроцедуры

// Добавляет пользователя в группу доступа из формы "Помощник настройки РМК"
//
// Параметры:
//  Пользователь - Справочник.Пользователи - выбранный пользователь в таблице.
//  ГруппаДоступа - Справочник.ГруппыДоступа - выбранная группа доступа в таблице.
//  ТекстСообщения - Строка - Текст сообщения пользователю.
//  Успешно - Булево - Результат выполнения процедуры
//
Процедура ДобавитьПользователяВГруппуДоступаПомощникРМК(Пользователь, ГруппаДоступа, ТекстСообщения, Успешно) Экспорт
	

	
КонецПроцедуры

// Удаляет пользователя из группы доступа из формы "Помощник настройки РМК"
//
// Параметры:
//  Пользователь - Справочник.Пользователи - выбранный пользователь в таблице.
//  ГруппаДоступа - Справочник.ГруппыДоступа - выбранная группа доступа в таблице.
//  ТекстСообщения - Строка - Текст сообщения пользователю.
//
Процедура УдалитьПользователяИзГруппыДоступаПомощникРМК(Пользователь, ГруппаДоступа, ТекстСообщения) Экспорт
	

	
КонецПроцедуры

// Процедура проверяет наличие пользователей в группе доступа "Администраторы"
//
// Параметры:
//  ЕстьПользовательАдминистратор	 - Булево	 - Признак наличия пользователей в профиле группы доступа "Администраторы".
//
Процедура ПроверитьПользователяАдминистратор(ЕстьПользовательАдминистратор) Экспорт

КонецПроцедуры

// Процедура создает пользователя "Администратор" и добавляет в группу доступа "Администраторы"
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект для которого происходит настройка.
//  СообщениеОбОшибке	 - Строка	 - Сообщение пользователю об ошибки.
//
Процедура СоздатьПользователяАдминистратор(ТорговыйОбъект, СообщениеОбОшибке) Экспорт

КонецПроцедуры

// Поиск записи персонального кода для входа из формы "Помощник настройки РМК"
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК - выбранный пользователь в таблице.
//  Кассир - ОпределяемыйТип.КассирРМК - выбранная группа доступа в таблице.
//  КодСотрудника - Строка - Код сотрудника.
//  ИНН - Строка - ИНН сотрудника.
//
Процедура НайтиЗаписьРегистраПерсональныйКод(Пользователь, Кассир, КодСотрудника, ИНН) Экспорт
	

	
КонецПроцедуры

// Добавляет персональный код для кассира из формы "Помощник настройки РМК"
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК - выбранный пользователь в таблице.
//  Кассир - ОпределяемыйТип.КассирРМК - выбранная группа доступа в таблице.
//  КодСотрудника - Строка - Код сотрудника.
//  ИНН - Строка - ИНН сотрудника.
//
Процедура ПрисвоитьПерсональныйКод(Пользователь, Кассир, КодСотрудника, ИНН) Экспорт
	

	
КонецПроцедуры

// Заполняет установленную цену на серию
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК - выбранная номенклатура.
//  Характеристика - ОпределяемыйТип.ХарактеристикаРМК - выбранная характеристика номенклатуры.
//  Серия - ОпределяемыйТип.СерияРМК - выбранная серия номенклатура.
//  Цена - Число - цена установленная на серию.
//
Процедура ЗаполнитьЦенуСерии(Номенклатура, Характеристика, Серия, Цена) Экспорт
	
	
	
КонецПроцедуры

// Заполняет уникальный идентификатор вида цены
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект.
//  УИДВидаЦен - Строка - уникальный идентификатор вида цены продажи.
//
Процедура ВернутьВидЦены(ТорговыйОбъект, УИДВидаЦен) Экспорт
	
	
	
КонецПроцедуры

// Заполняет признак использования КМ по номенклатуре
//
// Параметры:
//  Номенклатура - Ссылка - номенклатура
//  НоменклатураИспользующаяКМ - Булево - Ложь, если номенклатура маркируется средством идентификации, не имеющий кода маркировки, иначе Истина
//
Процедура ЗаполнитьПризнакИспользованияКМПоНоменклатуре(Номенклатура, НоменклатураИспользующаяКМ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияКМПоНоменклатуре(Номенклатура, НоменклатураИспользующаяКМ);
	
КонецПроцедуры

// Настраивает подменю "Заполнить" на форме элемента справочника "Палитра товаров"
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочнимка "Палитра Товаров".
//
Процедура НастроитьДоступныеСпособыЗаполненияПалитры(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.НастроитьДоступныеСпособыЗаполненияПалитры(Форма);
	
КонецПроцедуры

// Настраивает подменю "Заполнить" на форме элемента справочника "Контроль продаж"
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочнимка "Контроль продаж".
//
Процедура НастроитьДоступныеСпособыЗаполненияНоменклатурыКонтроляПродаж(Форма) Экспорт
	

	
КонецПроцедуры

// Процедура проверяет непробитые и отложенные чеки при закрытии смены.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//  КоличествоНепробитыхЧеков - Число - количество непробитых чеков.
//
Процедура ПроверитьКоличествоНепробитыхЧеков(Форма) Экспорт

КонецПроцедуры

// Определяет требуется ли обновление ключа сессии.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак стандартной обработки события.
//  РезультатВыполнения - Структура - результат выполнения
//
Процедура ТребуетсяОбновлениеКлючаСессии(СтандартнаяОбработка, РезультатВыполнения) Экспорт
	
КонецПроцедуры

// Устанавливает ключ сессии.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак стандартной обработки события.
//  ДанныеКлюча - Структура - данные ключа
//
Процедура УстановитьКлючСессии(СтандартнаяОбработка, ДанныеКлюча) Экспорт
	
КонецПроцедуры

// Определяет использование разрешительного режима библиотекой ГосИС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  Результат - Булево - признак использования.
//
Процедура ОпределитьИспользованиеРазрешительногоРежимаГосИС(Форма, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОпределитьИспользованиеРазрешительногоРежимаГосИС(Форма, Результат);
	
КонецПроцедуры

// Получает список организаций для обновления розничного токена авторизации.
//
// Параметры:
//  ОрганизацииДляПроверкиРозничногоТокена - Массив - Организации для обновления
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//
Процедура ОрганизацииДляПроверкиРозничногоТокена(ОрганизацииДляПроверкиРозничногоТокена, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОрганизацииДляПроверкиРозничногоТокена(ОрганизацииДляПроверкиРозничногоТокена, Форма);
	
КонецПроцедуры

// Требуется обновление списка CDN площадок ИС "Честный знак".
//
// Параметры:
//  ТребуетсяОбновлениеСпискаCDNПлощадок - Булево - Результат обновления списка CDN площадок
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ТребуетсяОбновлениеСпискаCDNПлощадок(ТребуетсяОбновлениеСпискаCDNПлощадок, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ТребуетсяОбновлениеСпискаCDNПлощадок(ТребуетсяОбновлениеСпискаCDNПлощадок, СтандартнаяОбработка);
	
КонецПроцедуры

// Получает настройки ТСПИоТ для переданного фискального накопителя
// Параметры:
//  НастройкиТСПИоТ - Структура
//                  * НастроенТСПИоТ - Булево - признак наличия настроек
//                  * ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - ККМ
//  СтрокаКассыККМ - СтрокаТаблицыЗначений - Параметры кассы и организации
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//
Процедура НастройкиТСПИоТ(НастройкиТСПИоТ, СтрокаКассыККМ, Форма) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НастроенТСПИоТ", Ложь);
	Результат.Вставить("АварийныйРежимТСПИоТ", Ложь);
	Результат.Вставить("ВнешнийТСПИоТ", Ложь);
	Результат.Вставить("ПодключаемоеОборудование");
	
	ОбщегоНазначенияРМКУНФ.НастройкиТСПИоТ(Результат, СтрокаКассыККМ, Форма); // НЕ РМК
	
	НастройкиТСПИоТ = Результат;
	
КонецПроцедуры

// Процедура - Определяет параметры ошибки невозможности подбора
//
// Параметры:
//  ЗаголовокОшибки - Текст
//  ТекстСообщения - Текст
//  ПараметрыОшибки - Структура - Параметры ошибки для вывода в стакан формы РМК
//  РезультатОбработкиШтрихкода - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьРезультатОбработкиШтрихкода)
//
Процедура ОпределитьПараметрыОшибкиНевозможностиПодбора(ЗаголовокОшибки, ТекстСообщения, ПараметрыОшибки, РезультатОбработкиШтрихкода) Экспорт



КонецПроцедуры

// Добавляет реквизиты проверки средствами ККТ при встраивании проверки непосредственно в форму РМК не используя отдельную форму ожидания ККТ.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма РМК
//  ДобавляемыеРеквизиты - Массив из РеквизитФормы - Реквизиты, которые будут добавлены на форму.
//
Процедура ДобавитьРеквизитыПроверкиСредствамиККТ(Форма, ДобавляемыеРеквизиты) Экспорт
	

	
КонецПроцедуры

// Заполняет параметры необходимые для проверки марки при сканировании
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма РМК
//  СтрокаКассыККМ - СтрокаТаблицыЗначений - Параметры кассы и организации
//
Процедура ЗаполнитьПараметрыКассыМаркируемойПродукции(Форма, СтрокаКассыККМ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыКассыМаркируемойПродукции(Форма, СтрокаКассыККМ);
	
КонецПроцедуры

// Заполняет признак ведения учета маркируемой продукции переданного вида.
//
// Параметры:
//  ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции
//  Результат - Булево - признак ведения учета маркируемой продукции переданного вида.
//
Процедура ЗаполнитьПризнакВедениеУчетМаркируемойПродукции(ВидМаркируемойПродукции, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакВедениеУчетМаркируемойПродукции(ВидМаркируемойПродукции, Результат);
	
КонецПроцедуры

// Заполняет заказ покупателя по чеку.
//
// Параметры:
//  ЧекККМ - ОпределяемыйТип.ЧекККМРМК - чек ккм.
//  ЗаказПокупателя - ОпределяемыйТип.ЗаказПокупателяРМК - заказ покупателя.
//
Процедура ЗаполнитьЗаказПокупателяПоЧеку(ЧекККМ, ЗаказПокупателя) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьЗаказПокупателяПоЧеку(ЧекККМ, ЗаказПокупателя);
	
КонецПроцедуры

// Заполняет структуру шаблона чека по исходным данным
//
// Параметры:
//  ПараметрыЧека - Структура
//  СтрокаОсновногоРаздела - СтрокаДереваЗначений
//  ТаблицаДанных - ТаблицаЗначений - см. ПечатьФискальныхЧековРМК.ТаблицаСКД()
//  ФискальныеПозицииЧека - Структура
//
Процедура ОбработатьПараметрыШаблонаЧека(СКД, ДокументСсылка) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОбработатьПараметрыШаблонаЧека(СКД, ДокументСсылка);

КонецПроцедуры

// Обновляет кэш особенностей учета номенклатуры, которую можно продать/вернуть без марки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма РМК
//
Процедура ОбновитьКэшОсобенностейУчетаБезМарки(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ОбновитьКэшОсобенностейУчетаБезМарки(Форма);
	
КонецПроцедуры

// Заполняет номенклатуру по уникальному идентификатору
//
// Параметры:
//  НоменклатураГУИД - Уникальный идентификатор
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК
//
Процедура ЗаполнитьНоменклатуруПоУникальномуИдентификатору(НоменклатураГУИД, Номенклатура) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНоменклатуруПоУникальномуИдентификатору(НоменклатураГУИД, Номенклатура);

КонецПроцедуры

// Заполняет характеристику по уникальному идентификатору
//
// Параметры:
//  ХарактеристикаГУИД - Уникальный идентификатор
//  Характеристика - ОпределяемыйТип.ХарактеристикаРМК
//
Процедура ЗаполнитьХарактеристикуПоУникальномуИдентификатору(ХарактеристикаГУИД, Характеристика) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьХарактеристикуПоУникальномуИдентификатору(ХарактеристикаГУИД, Характеристика);

КонецПроцедуры

// Заполняет упаковку по уникальному идентификатору
//
// Параметры:
//  УпаковкаГУИД - Уникальный идентификатор
//  Упаковка - ОпределяемыйТип.УпаковкаРМК
//
Процедура ЗаполнитьУпаковкуПоУникальномуИдентификатору(УпаковкаГУИД, Упаковка) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьУпаковкуПоУникальномуИдентификатору(УпаковкаГУИД, Упаковка);

КонецПроцедуры

// Заполняет день недели по номеру дня
//
// Параметры:
//  НомерДняНедели - Число
//  ДеньНедели - ОпределяемыйТип.ДниНеделиРМК
//
Процедура ЗаполнитьДеньНеделиПоНомеруДня(НомерДняНедели, ДеньНедели) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДеньНеделиПоНомеруДня(НомерДняНедели, ДеньНедели);

КонецПроцедуры

// Удаляет архивные чеки
//
Процедура ОчиститьАрхивныеЧеки(ПараметрыОперации) Экспорт
	

	
КонецПроцедуры

// Дополняет массив недостающими ролями для запуска РМК
// необходимыми в прикладном решении.
//
// Параметры:
//  МассивРолей - Массив - Массив обязательных прикладных ролей необходимых пользователю для запуска РМК.
//
Процедура ДополнитьОбязательныеРолиДляЗапускаРМК(МассивРолей) Экспорт
	

	
КонецПроцедуры

#Область ШаблонЧека

// Заполняет текущую кассу ККМ шаблона чека по параметрам сеанса
//
// Параметры:
//  ПараметрыСеанса - ПараметрыСеанса - ПараметрыСеанса.
//  ТекущаяКассаККМ - ОпределяемыйТип.ПодключаемоеОборудованиеРМК - подключаемое оборудование касса, для заполнения.
//
Процедура ЗаполнитьТекущуюКассуККМШаблонаЧека(ПараметрыСеанса, ТекущаяКассаККМ) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьТекущуюКассуККМШаблонаЧека(ПараметрыСеанса, ТекущаяКассаККМ);
	
КонецПроцедуры

// Заполняет документ для интерфейсной работы шаблона чека ККМ
//
// Параметры:
//  ДокументДляПечатиШаблона - ОпределяемыйТип.ЧекККМРМК - заполняемый параметр, документ для интерфейсной работы шаблона чека ККМ.
//
Процедура ЗаполнитьДокументДляШаблонаЧека(ДокументДляПечатиШаблона) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДокументДляШаблонаЧека(ДокументДляПечатиШаблона);
	
КонецПроцедуры

// Заполняет количество миллиметров в пикселе
//
// Параметры:
//  КоличествоМиллиметровВПикселе - Число - количество миллиметров в пикселе, для заполнения.
//
Процедура ЗаполнитьКоличествоМиллиметровВПикселе(КоличествоМиллиметровВПикселе) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьКоличествоМиллиметровВПикселе(КоличествоМиллиметровВПикселе);
	
КонецПроцедуры

// Заполняет макет шаблона чека
//
// Параметры:
//  МакетШаблонаЧека - СхемаКомпоновкиДанных - макет шаблона чека, для заполнения.
//
Процедура ЗаполнитьМакетШаблонаЧека(МакетШаблонаЧека) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьМакетШаблонаЧека(МакетШаблонаЧека);
	
КонецПроцедуры

// Заполняет данные чека, необходимые для фискализации.
//
// Параметры:
//  ДокументСсылка - ОпределяемыйТип.ЧекККМРМК  - документ, по которому формируются исходные данные в формате БПО.
//  ДанныеЧека - Структура  - данные чека, необходимые для фискализации.
//
Процедура ЗаполнитьДанныеДляПробитияЧека(ДокументСсылка, ДанныеЧека) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеДляПробитияЧека(ДокументСсылка, ДанныеЧека);
	
КонецПроцедуры

// Заполняет описание условия, допустимые виды сравнения и тип значения сравнения для условия.
//
// Параметры:
//  Условие - ПеречислениеСсылка.УсловиеВыводаСекцииШаблонаРМК - Условие.
//  ОписаниеУсловия - Структура - содержит данные по условию:
//   * ДопустимыеВидыСравнения - Массив - допустимые виды сравнения.
//   * ТипЗначения - ОписаниеТипов - допустимый тип значения сравнения.
//
Процедура ЗаполнитьОписаниеУсловия(Условие, ОписаниеУсловия) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьОписаниеУсловия(Условие, ОписаниеУсловия);
	
КонецПроцедуры

// Заполняет доступные условия
//
// Параметры:
//  ДоступныеУсловия - Массив - доступные условия для вывода в секции шаблона РМК.
//  СекцияПромокода - Булево - СекцияПромокода.
//  СекцияБонусов - Булево - СекцияБонусов.
//
Процедура ЗаполнитьДоступныеУсловия(ДоступныеУсловия, СекцияПромокода = Ложь, СекцияБонусов = Ложь) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДоступныеУсловия(ДоступныеУсловия, СекцияПромокода, СекцияБонусов);
	
КонецПроцедуры

// Вычисляет левое значение в зависимости от условия из данных чека
//
// Параметры:
//  Условие - ПеречислениеСсылка.УсловиеВыводаСекцииШаблонаРМК - Условие.
//  ДанныеЧека - Структура - данные чека.
//  ЛевоеЗначение - ОпределяемыйТип.ЗначениеУсловияВыводаШаблонаРМК - левое значение по условию, для заполнения.
//
Процедура ВычислитьЛевоеЗначениеУсловия(Условие, ДанныеЧека, ЛевоеЗначение) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ВычислитьЛевоеЗначениеУсловия(Условие, ДанныеЧека, ЛевоеЗначение);
	
КонецПроцедуры

// Добавляет параметры в шаблон чека.
//
// Параметры:
//  ШаблонЧека - ДанныеФормыДерево - Шаблон чека
//
Процедура ДобавитьПараметрыВШаблонЧека(ШаблонЧека) Экспорт
	
КонецПроцедуры

// Настройка элементов формы "Редактирование шаблона чека ККТ"
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложение - форма редактирования шаблона чека ККТ.
//
Процедура ПереопределитьНастройкиФормыРедактированияШаблонаЧекаККТ(Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ПереопределитьНастройкиФормыРедактированияШаблонаЧекаККТ(Форма);
	
КонецПроцедуры

// Процедура настраивает форму для получения дополнительных параметров шаблона чека.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура НастроитьДополнительныеПараметрыШаблонаЧека(Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.НастроитьДополнительныеПараметрыШаблонаЧека(Форма);
КонецПроцедуры

#КонецОбласти

// Определяет является ли переданное значение особенности учета меховой продукцией.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета - алкогольная продукция.
//
Процедура ОпределитьОсобенностьУчетаМеховаяПродукция(ОсобенностьУчета, Результат) Экспорт

КонецПроцедуры

// Определяет является ли переданное значение особенности учета пивной продукцией.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета - алкогольная продукция.
//
Процедура ОпределитьОсобенностьУчетаПивнаяПродукция(ОсобенностьУчета, Результат) Экспорт

КонецПроцедуры

// Процедура заполняет систему налогообложения по складу
// для случаев если настроено распределение продаж в разрезе складов.
//
// Параметры:
//  ДанныеСтроки - Структура - данные текущей строки.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ЗаполнитьСНОСтрокиПоСкладу(ДанныеСтроки, Форма) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьОрганизациюПродажи(ДанныеСтроки, Форма);
	
КонецПроцедуры

// Заполняет признак запрета сопоставления товара на форме РМК
//
// Параметры:
//  ЗапретитьСопоставлениеТовара - Булево - Признак запрета сопоставления товара кассиром.
//
Процедура ЗаполнитьПризнакЗапретаСопоставленияТовара(ЗапретитьСопоставлениеТовара) Экспорт
	
	
	
КонецПроцедуры

#Область УчетНаличных

// Заполняет признак контроля остатка наличных в кассе если используется переопределение настроек.
//
// Параметры:
//  КонтролироватьОстатокНаличных - Булево - заполняемый признак учета
//
Процедура ЗаполнитьПризнакКонтролироватьОстатокНаличных(КонтролироватьОстатокНаличных) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакКонтролироватьОстатокНаличных(КонтролироватьОстатокНаличных);
	
КонецПроцедуры

// Заполняет количество наличных денежных средств в кассе ккм.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК - Организация
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - КассаККМ
//  Результат - Число - Наличные денежные средства в кассе ККМ.
//
Процедура ЗаполнитьНаличныеДенежныеСредстваВКассеККМ(Организация, КассаККМ, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьНаличныеДенежныеСредстваВКассеККМ(Организация, КассаККМ, Результат);
	
КонецПроцедуры

// Заполняет параметры автоматической выемки денежных средств в кассе ккм
// при закрытии смены.
// 
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК - Организация
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - КассаККМ
//  Результат - Структура - Структура параметров выемки
//   *ТребуетсяВыемкаПриЗакрытииСмены - Булево - Признак необходимости делать автовыемку при закрытии смены.
//   *МинимальныйОстатокНаличныхВКассе - Число - Минимальный остаток наличных при автовыемки.
//
Процедура ЗаполнитьПараметрыВыемкиПриЗакрытииСмены(Организация, КассаККМ, Результат) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыВыемкиПриЗакрытииСмены(Организация, КассаККМ, Результат);
	
КонецПроцедуры

// Отражает изменения наличных денежных средств после проведения операции.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК - Организация
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - КассаККМ
//  Сумма - Число - Наличные денежные средства в кассе ККМ.
//
Процедура ОтразитьИзменениеНаличныхДенежныхСредств(Организация, КассаККМ, Сумма) Экспорт
	

	
КонецПроцедуры

// Фиксирует наличные денежные средства на начало и конец смены
// в служебном регистре 1С:РМК.
//
// Параметры:
//  СписокСмен - Список строк ТаблицаКассККМОрганизаций формы РМК
//
Процедура ЗафиксироватьНаличныеДенежныеСредстваСмены(СписокСмен) Экспорт
	

	
КонецПроцедуры

#КонецОбласти


#Область ЗаполнениеХарактеристик

// Заполняет данные о характеристиках товаров
//
// Параметры:
//  СтруктураПараметров			 - Структура		 - настройки заполнения данных.
//  		* Номенклатура - ОпределяемыйТип.НоменклатураРМК - номенклатура текущей строки.
//  		* Характеристика - ОпределяемыйТип.ХарактеристикаРМК - характеристика текущей строки.
//  		* ВидЦены - ОпределяемыйТип.ВидЦеныРМК - вид цены рабочего места кассира.
//  		* ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - торговый объект рабочего места кассира.
//  ДанныеПлиткиПодбораЗначений	 - ТаблицаЗначений	 - таблица для заполнения плитки значениями подбора.
//
Процедура ЗаполнитьДанныеПлиткиВыбораЗначений(СтруктураПараметров, ДанныеПлиткиПодбораЗначений) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДанныеПлиткиВыбораЗначений(СтруктураПараметров, ДанныеПлиткиПодбораЗначений);
КонецПроцедуры

#КонецОбласти

#Область НастройкиРасчетаСкидокИДисконтныхКарт
// Заполняет признак использования автоматических скидок в форме "Настройки рабочего места кассира"
//
// Параметры:
//  ИспользоватьСерверЛояльностиПолучательДанных - Булево	 - признак использования сервера лояльности.
//  ИспользоватьАвтоматическиеСкидки			 - Булево	 - признак использования автоматических скидок.
//  ЕстьАвтоматическиеСкидки					 - Булево	 - признак использования локальных автоматических скидок.
//
Процедура ЗаполнитьИспользованиеАвтоматическихСкидок(ИспользоватьСерверЛояльностиПолучательДанных, ИспользоватьАвтоматическиеСкидки, ЕстьАвтоматическиеСкидки) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьИспользованиеАвтоматическихСкидок(ИспользоватьСерверЛояльностиПолучательДанных,
		ИспользоватьАвтоматическиеСкидки, ЕстьАвтоматическиеСкидки);
	
КонецПроцедуры

// Заполняет признак использования дисконтных карт
//
// Параметры:
//  ИспользоватьДисконтныеКарты	 - Булево	 - признак использования дисконтных карт
//
Процедура ЗаполнитьПризнакИспользованияДисконтныхКарт(ИспользоватьДисконтныеКарты) Экспорт
	
	ИспользоватьДисконтныеКарты = Истина;
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПризнакИспользованияДисконтныхКарт(ИспользоватьДисконтныеКарты);
	
КонецПроцедуры
#КонецОбласти


#Область СписаниеБалловПоВладельцу

// Процедура дополняет данные о карте в форме списания баллов по владельцу
//
// Параметры:
//  СтрокаПриемник - СтрокаТаблицыЗначений - строка таблицы значений таблицы данных дисконтной карты.
//  СтрокаИсточник - СтрокаТаблицыЗначений - строка таблицы значений источника.
Процедура ДополнитьДанныеОКарте(СтрокаПриемник, СтрокаИсточник) Экспорт
	ОбщегоНазначенияРМКУНФ.ДополнитьДанныеОКарте(СтрокаПриемник, СтрокаИсточник);
КонецПроцедуры

// Процедура объединяет бонусные баллы дисконтных карт
//
// Параметры:
//  БонуснаяПрограмма	 - Строка						 - идентификатор бонусной программы.
//  БонуснаяКарта		 - ОпределяемыйТип.ДисконтнаяКартаРМК	 - Дисконтная карта начисления.
//  ТаблицаВыбранныхКарт - ТаблицаЗначений						 - таблица бонусных карт для объединения.
//  СтруктураОтвета		 - Структура							 - структура ответа по бонусным картам.
//
Процедура ОбъединитьБонусныеБаллы(БонуснаяПрограмма, БонуснаяКарта, ТаблицаВыбранныхКарт, СтруктураОтвета) Экспорт
	ОбщегоНазначенияРМКУНФ.ОбъединитьБонусныеБаллы(БонуснаяПрограмма, БонуснаяКарта, ТаблицаВыбранныхКарт, СтруктураОтвета);
КонецПроцедуры
#КонецОбласти

// Процедура заполняет признак доступности группы СМС в форме настройки рабочего места кассира
//
// Параметры:
//  ДоступностьГруппыСМС - Булево	 - признак доступности группы СМС.
//
Процедура НастроитьИспользованиеОтправкиSMS(ДоступностьГруппыСМС) Экспорт
	ДоступностьГруппыСМС = Истина;
	ОбщегоНазначенияРМКУНФ.НастроитьИспользованиеОтправкиSMS(ДоступностьГруппыСМС); // НЕ РМК
КонецПроцедуры

// Заполняет колонки таблиц, которые необходимо передавать на сервер для подготовки данных перед пробитием чека
//
// Параметры:
//  КолонкиТаблицФормы - Структура - структура, где именем ключа является имя таблицы,
//									значением массив с именами колонок.
//
Процедура ЗаполнитьКолонкиТаблицФормыРабочегоМестаКассира(КолонкиТаблицФормы) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьКолонкиТаблицФормыРабочегоМестаКассира(КолонкиТаблицФормы);
	
КонецПроцедуры

// Получает данные из сервиса ОФД по смене.
//
// Параметры:
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - касса ккм для сверки
//  НомерСмены - Число - номер смены
//  ДанныеСверки - Произвольный - структура данных для сверки
//  СтандартнаяОбработка - Булево - признак стандартной обработки
//
Процедура ОборотыКассовойСмены(КассаККМ, НомерСмены, ДанныеСверки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Получает данные из сервиса ОФД по чекам за смену.
//
// Параметры:
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - касса ккм для сверки
//  НомерСмены - Число - номер смены
//  ДанныеПоЧекам - Произвольный - структура данных по чекам
//  СтандартнаяОбработка - Булево - признак стандартной обработки
//
Процедура ЧекиКассовойСмены(КассаККМ, НомерСмены, ДанныеПоЧекам, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Процедура пересчитывает количество упаковок в количество базовых единиц
//
// Параметры:
//  Количество	 - Число					 - Количество упаковок.
//  Упаковка	 - ОпределяемыйТип.УпаковкаРМК	 - упаковка из таблицы товаров.
//
Процедура ПересчитатьКоличествоПоКоэффициентуУпаковок(Количество, Упаковка) Экспорт
	

	
КонецПроцедуры

// Добавляет связь сотрудника и пользователя информационной базы
//
// Параметры:
//  Сотрудник		 - ОпределяемыйТип.ПродавецРМК	 - Сотрудник рабочего места кассира.
//  Пользователь	 - ОпределяемыйТип.ПользовательРМК	 - Пользователь информационной базы.
//  СтруктураРезультата	 - Структура					 - Структура результата добавления записи.
//  * СообщениеПользователю - Строка - описание результата.
//  * Результат - Булево - Результат выполнения.
//
Процедура ДобавитьСотрудникаКПользователю(Сотрудник, Пользователь, СтруктураРезультата) Экспорт
	ОбщегоНазначенияРМКУНФ.ДобавитьСотрудникаКПользователю(Сотрудник, Пользователь, СтруктураРезультата);
КонецПроцедуры

// Записывает код сотрудника из формы "Помощник настройки РМК"
//
// Параметры:
//  Сотрудник - ОпределяемыйТип.ПродавецРМК - выбранный сотрудник в таблице.
//  КодСотрудника - Строка - код сотрудника.
//
Процедура ЗаписатьКодСотрудника(Сотрудник, КодСотрудника) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаписатьКодСотрудника(Сотрудник, КодСотрудника);
	
КонецПроцедуры

// Заполняет дерево сотрудников в помощнике настройки рабочего места кассира
//
// Параметры:
//  ЭтотОбъект	 - ФормаКлиентскогоПриложение - форма помощника настройки рабочего места кассира 
//
Процедура ЗаполнитьДеревоСотрудников(ЭтотОбъект) Экспорт
	ОбщегоНазначенияРМКУНФ.ЗаполнитьДеревоСотрудников(ЭтотОбъект);
КонецПроцедуры

// Записывает настройку запуска рабочего места кассира из формы "Помощник настройки РМК"
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК - Выбранный пользователь в таблице.
//  СтруктураРезультата	 - Структура					 - Структура установки торгового объекта.
//  * СообщениеПользователю - Строка - описание результата.
//  * Результат - Булево - Результат выполнения.
//
Процедура ЗапускатьРМКПриСтарте(Пользователь, СтруктураРезультата) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗапускатьРМКПриСтарте(Пользователь, СтруктураРезультата);
	
КонецПроцедуры

// Удаляет связь сотрудника и пользователя информационной базы
//
// Параметры:
//  Сотрудник		 - ОпределяемыйТип.ПродавецРМК	 - Сотрудник рабочего места кассира.
//  Пользователь	 - ОпределяемыйТип.ПользовательРМК	 - Пользователь информационной базы.
//  СтруктураРезультата	 - Структура					 - Структура результата удаления записи.
//  * СообщениеПользователю - Строка - описание результата.
//  * Результат - Булево - Результат выполнения.
//
Процедура УдалитьСотрудникаПользователя(Сотрудник, Пользователь, СтруктураРезультата) Экспорт
	ОбщегоНазначенияРМКУНФ.УдалитьСотрудникаПользователя(Сотрудник, Пользователь, СтруктураРезультата);
КонецПроцедуры

// Записывает настройку торгового объекта из формы "Помощник настройки РМК"
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК - Выбранный пользователь в таблице.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - Торговый объект.
//  СтруктураРезультата	 - Структура					 - Структура установки торгового объекта.
//  * СообщениеПользователю - Строка - описание результата.
//  * Результат - Булево - Результат выполнения.
//
Процедура УстановитьТорговыйОбъектПользователя(Пользователь, ТорговыйОбъект, СтруктураРезультата) Экспорт
	ОбщегоНазначенияРМКУНФ.УстановитьТорговыйОбъектПользователя(Пользователь, ТорговыйОбъект, СтруктураРезультата);
КонецПроцедуры

// Заполняет кассира по данным из параметра запуска.
//
// Параметры:
//  Кассир - ОпределяемыйТип.КассирРМК - кассир.
//
Процедура ЗаполнитьКассираИзПараметраЗапуска(Кассир) Экспорт
	

	
КонецПроцедуры

// Получает кассиров, доступных для работы под текущим пользователем.
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК.
//  ДоступныеКассиры - Массив - список кассиров, доступных для работы под текущим пользователем.
//
Процедура ЗаполнитьДоступныхКассировПользователя(Пользователь, ДоступныеКассиры) Экспорт
	

	
КонецПроцедуры

// Получает кассиров для входа для пользователя.
//
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательРМК.
//  КассирыДляВхода - Массив - список кассиров для входа.
//
Процедура ЗаполнитьКассировДляВхода(Пользователь, КассирыДляВхода) Экспорт
	

	
КонецПроцедуры

// Заполняет соответствие применяемых в СНО ставок НДС для чека коррекции
//
// Параметры:
//  СтавкиНДСПоСНО - ФиксированноеСоответствие - Список значения ставок НДС по ключу Системы налогообложения.
//
// Пример:
//	Ключ: УСН
//	Значение: СписокЗначений ставок НДС (20, 10, 0, БезНДС, 5, 7)
//
Процедура ЗаполнитьСоответствиеСтавокНДСДляЧекаКоррекции(СтавкиНДСПоСНО) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьСоответствиеСтавокНДСДляЧекаКоррекции(СтавкиНДСПоСНО);
	
КонецПроцедуры

// Заполняет признак использования штрихкодирования заказов покупателей
//
// Параметры:
//  ФормаРМК - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
Процедура ЗаполнитьПризнакИспользованияШтрихкодированияЗаказов(ФормаРМК) Экспорт
	

	
КонецПроцедуры

// Настраивает элементы формы для отображения состава чека на форме выбора чека
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора чека.
//
Процедура НастроитьОтображениеТоваровНаФормеВыбораЧека(Форма) Экспорт
	ОбщегоНазначенияРМКУНФ.НастроитьОтображениеТоваровНаФормеВыбораЧека(Форма);
КонецПроцедуры

// Устанавливает признак продан у подарочного сертификата
//  Процедура - Установить признак продан подарочный сертификат
//
// Параметры:
//  СерияПодарочногоСертификата	 - ОпределяемыеТипы.СерияРМК - Серия подарочного сертификата
//  ЭтоОперацияВозврат			 - 	Булево - Признак операции возврат.
//
Процедура УстановитьПризнакПроданПодарочныйСертификат(СерияПодарочногоСертификата, ЭтоОперацияВозврат) Экспорт

КонецПроцедуры

// Заполняет в переданной таблице значений реквизиты: Крепость, ВидПродукции и Объем.
//
// Параметры:
//  ТаблицаНоменклатуры - ТаблицаЗначений - таблица номенклатуры с колонками: НомерСтроки, Номенклатура.
Процедура ЗаполнитьРеквизитыАлкогольнойПродукции(ТаблицаНоменклатуры) Экспорт
	

	
КонецПроцедуры

// Устанавливает признак контроля организации, которая изначально продала этот сертификат
//
// Параметры:
//  ПодарочныйСертификат	 	- ОпределяемыеТипы.Номенклатура - Серия подарочного сертификата
//  Результат					- Булево - Признак необходимости контроля организации.
Процедура ЗаполнитьПризнакКонтроляОрганизацийПодарочногоСертификата(ПодарочныйСертификат, Результат) Экспорт

КонецПроцедуры

// Заполняет АдресРасчетов И МестоРасчетов для печати на ККТ.
//
// Параметры:
//  ПараметрыОперации - см.ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены().
//  ДополнительныеПараметрыДляПечати - Структура - структура параметров печати.
//
Процедура ЗаполнитьПараметрыАдресаМестаРасчетов(ПараметрыОперации, ДополнительныеПараметрыДляПечати) Экспорт
	
	ОбщегоНазначенияРМКУНФ.ЗаполнитьПараметрыАдресаМестаРасчетов(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
	
КонецПроцедуры

// Записывает изменения настроек параметров подключения MAX
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма настройки параметров подключения MAX.
//  Отказ - Булево.
//
Процедура СохранитьИзмененияПараметровПодключенияMAX(Форма, Отказ) Экспорт
	ОбщегоНазначенияРМКУНФ.СохранитьИзмененияПараметровПодключенияMAX(Форма, Отказ);
КонецПроцедуры

// Переопределение формирования инструкции покупателя MAX
//
// Параметры:
//  ИнструкцияПокупателейMAX - ТабличныйДокумент - исходный макет инструкциb покупателя MAX
//
Процедура ДополнитьМакетИнструкцииПокупателяMAX(ИнструкцияПокупателейMAX) Экспорт
	
КонецПроцедуры

// Получает адрес таблицы значений с используемыми подарочными сертификатами.
//
// Параметры:
//  Адрес - Строка - переменная, куда будет записан адрес таблицы с подарочными сертификатами.
//
Процедура ПолучитьАдресТаблицыПодарочныхСертификатов(Адрес = "") Экспорт
	ОбщегоНазначенияРМКУНФ.ПолучитьАдресТаблицыПодарочныхСертификатов(Адрес);
КонецПроцедуры

// Определяет используются ли серии для номенклатуры
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураРМК - позиция номенклатуры, для которой будет определяться использование серий.
//  Результат - Булево - переменная, куда будет записан результат проверки использования серий.
//
Процедура ОпределитьИспользованиеСерий(Номенклатура, Результат) Экспорт
	ОбщегоНазначенияРМКУНФ.ОпределитьИспользованиеСерий(Номенклатура, Результат);
КонецПроцедуры

#КонецОбласти

#Область УточненияПринадлежностиЗапасов

// Устанавливает признак использования уточнения принадлежности запасов
//
// Параметры:
//  ИспользоватьУточненияПринадлежностиЗапасов - Булево - Признак операции возврат.
//
Процедура УстановитьИспользованиеУточненияПринадлежностиЗапасов(ИспользоватьУточненияПринадлежностиЗапасов) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
