#Область ПрограммныйИнтерфейс
// Показывает вопрос перед очисткой настроек авторизации.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ОчисткаНастроекАвторизацииВопрос(Форма) Экспорт

	//@skip-check notify-description-to-server-procedure
	//@skip-check bsl-legacy-check-string-literal
	Оповещение = Новый ОписаниеОповещения("ОчиститьНастройкиЗавершение", Форма);
	ТекстВопроса = НСтр("ru = 'Настройки авторизации будут удалены, что приведет к невозможности управления продажами товаров текущей учетной записи.
			|Очистить настройки?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КэшПодсистемы()

	ИмяПодсистемы = "Продажи.РаботаСOzon";
	Если ПараметрыПриложения[ИмяПодсистемы] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПодсистемы, Новый Структура);
	КонецЕсли;

	Возврат ПараметрыПриложения[ИмяПодсистемы];

КонецФункции

Функция КэшКатегорий() Экспорт

	КэшПодсистемы = КэшПодсистемы();

	КэшКатегорий     = Неопределено;
	НаименованиеКэша = "КэшКатегорийOzon";

	КэшПодсистемы.Свойство(НаименованиеКэша, КэшКатегорий);

	Если КэшКатегорий = Неопределено Тогда
		КэшПодсистемы.Вставить(НаименованиеКэша, Новый Структура);
	КонецЕсли;

	Возврат КэшПодсистемы[НаименованиеКэша];

КонецФункции

// Возвращает данные из кэша категорий по запрашиваемому идентификатору.
//
// Параметры:
//  ИдентификаторДанных - Строка - идентификатор данных, начинается с "Категория_", "ХарактеристикаКатегории_",
//                                 например: "Категория_100549328", "ХарактеристикаКатегории_8229".
//
// Возвращаемое значение:  
//  - Неопределено - при отсутствии данных в кэше для переданного идентификатора.
//  - ТаблицаЗначений - данные, помещаемые в кэш для переданного идентификатора,
//
Функция ПолучитьДанныеИзКэшаКатегорий(ИдентификаторДанных) Экспорт

	КэшКатегорий = КэшКатегорий(); 

	ДанныеИзКэша = Неопределено;
	КэшКатегорий.Свойство(ИдентификаторДанных, ДанныеИзКэша); 

	Возврат ДанныеИзКэша;

КонецФункции

// Помещает данные в кэш категорий по переданному идентификатору.
//
// Параметры:
//  ДанныеКэша - ТаблицаЗначений - данные, помещаемые в кэш для переданного идентификатора,
//  ИдентификаторДанных - Строка - идентификатор данных, начинается с "Категория_", "ХарактеристикаКатегории_",
//                                 например: "Категория_100549328", "ХарактеристикаКатегории_8229".
//
Процедура СохранитьДанныеВКэшКатегорий(ДанныеКэша, ИдентификаторДанных) Экспорт

	КэшКатегорий = КэшКатегорий();
	КэшКатегорий.Вставить(ИдентификаторДанных, ДанныеКэша);

КонецПроцедуры

Функция КэшПодсистемыДанныеПолучить( ИдентификаторДанных ) Экспорт

	КэшПодсистемы = КэшПодсистемы(); 

	ДанныеИзКэша = Неопределено;
	КэшПодсистемы.Свойство( ИдентификаторДанных, ДанныеИзКэша );

	Возврат ДанныеИзКэша;

КонецФункции

Процедура КэшПодсистемыДанныеСохранить( ДанныеКэша, ИдентификаторДанных ) Экспорт

	КэшПодсистемы = КэшПодсистемы(); 
	КэшПодсистемы.Вставить( ИдентификаторДанных, ДанныеКэша );

КонецПроцедуры

// Показывает состояние выполнения действия.
//
// Параметры:
//   Результат                - Структура - любая структура, ожидаются ключи "КодОшибки", "ОписаниеОшибки".
//   ДополнительныеПараметры  - Неопределено - 
//                            - см. НовоеОписаниеПараметровДействия.
//   ВывестиСообщениеОбОшибке - Булево - признак вывода сообщения.
//
Процедура ВывестиСостояние(Результат, ДополнительныеПараметры = Неопределено, ВывестиСообщениеОбОшибке = Ложь) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ПустаяСтрока(Результат.КодОшибки) Тогда
		Если ВывестиСообщениеОбОшибке И Результат.Свойство("ОписаниеОшибки") И Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ОписаниеОшибки);
		КонецЕсли;
		
		Если ВывестиСообщениеОбОшибке
				И Результат.Свойство("Детализация")
				И Результат.Детализация <> Неопределено Тогда
				
			Префикс = ?(Результат.Свойство("ОписаниеОшибки"), Символы.Таб, "");
			Для Индекс = 0 По Мин(4, Результат.Детализация.ВГраница()) Цикл
				ЭлементКоллекции = Результат.Детализация[Индекс];
				ОбщегоНазначенияКлиент.СообщитьПользователю(Префикс + ЭлементКоллекции);
			КонецЦикла;
			
			Если Результат.Детализация.ВГраница() > 4 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(Префикс + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'и еще %1 аналогичных сообщений'"),
					Результат.Детализация.Количество() - 5));
			КонецЕсли;
		КонецЕсли;

		Если ДополнительныеПараметры <> Неопределено Тогда
			Состояние(ДополнительныеПараметры.ОписаниеДействия,, ДополнительныеПараметры.РезультатСОшибками, БиблиотекаКартинок.ЛоготипOzon2);
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры <> Неопределено Тогда
		Состояние(ДополнительныеПараметры.ОписаниеДействия,, ДополнительныеПараметры.УспешныйРезультат, БиблиотекаКартинок.ЛоготипOzon2);
	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьНастройкуИнтеграции( УчетнаяЗаписьМаркетплейса = Неопределено, Параметры = Неопределено ) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить( "УчетнаяЗапись", УчетнаяЗаписьМаркетплейса );	
	ПараметрыФормы.Вставить( "ДополнительныеПараметры", Параметры);
	
	ОповещениеОЗакрытии = ИнтеграцияСМаркетплейсамиКлиентСервер.ПолучитьЗначениеПоля( Параметры, "ОповещениеОЗакрытии", Неопределено );
	
	ОткрытьФорму( "Обработка.МаркетплейсOzon.Форма.АвторизацияДляИмпортаОтчетов", ПараметрыФормы, , , , , ОповещениеОЗакрытии,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
	
КонецПроцедуры

Процедура ОткрытьФормуИмпортаКарточекТоваровССайтаOzonПоИдентификаторам( УчетнаяЗаписьМаркетплейса, ИдентификаторыТоваровДляИмпорта ) Экспорт
    
    ВариантЗагрузкиЗагрузитьНесопоставленныеКарточкиТоваровПоИдентификаторам =
	ИнтеграцияСМаркетплейсомOzonКлиентСервер.ВариантЗагрузкиЗагрузитьНесопоставленныеКарточкиТоваровПоИдентификаторам();
	
	ПараметрыФормы = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПараметрыИмпортаДляДетальнойЗагрузки();
	
	ПараметрыФормы.УчетнаяЗаписьМаркетплейса = УчетнаяЗаписьМаркетплейса;
	ПараметрыФормы.ИдентификаторыТоваровДляИмпорта = ИдентификаторыТоваровДляИмпорта;
	ПараметрыФормы.ВариантЗагрузкиДанных = ВариантЗагрузкиЗагрузитьНесопоставленныеКарточкиТоваровПоИдентификаторам;
	ПараметрыФормы.ИмяИдентификатора = "ИдентификаторПубликации";
	ПараметрыФормы.ЗагрузитьЦеныПродажи = Ложь;
	ПараметрыФормы.СоздатьХарактеристикиНоменклатуры = Ложь;
	ПараметрыФормы.ЗагрузитьОписанияАрхивныхПозиций = Истина;
	ПараметрыФормы.РазмерПорцииЗагрузкиДанных = 
	ИнтеграцияСМаркетплейсомOzonКлиентСервер.МаксимальныйРазмерПорцииЗагрузкиДанных();
	
	УникальностьФормы = "" + УчетнаяЗаписьМаркетплейса.УникальныйИдентификатор()
	+ ВариантЗагрузкиЗагрузитьНесопоставленныеКарточкиТоваровПоИдентификаторам;
	ОткрытьФорму("Обработка.МаркетплейсOzon.Форма.ИмпортДанныхТоваровСТорговойПлощадки", ПараметрыФормы, , УникальностьФормы);				

КонецПроцедуры

#КонецОбласти

