#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьОпрос(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://regevent.1c.ru/questions/nomenklatura.php");
	ЗавершитьОпрос(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтОпроса(Команда)
	
	ЗавершитьОпрос(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершитьОпрос(ОпросПройден)
	
	ЗавершитьОпросСервер();
	Закрыть(ОпросПройден);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьОпросСервер()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ОпросРаботаСНоменклатуройПройден.Установить(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
