
#Область ПрограммныйИнтерфейс

// Процедура заполняет список выбора времени.
// 
// Параметры:
//  ПолеВводаФормы - ПолеВвода - Элемент-владелец списка.
//  Интервал - Число - Количество секунд в интервале между элементами.
//  Начало - Дата - Начальная дата интервала
//  Окончание - Дата - Конечная дата интервала
//
Процедура ЗаполнитьСписокВыбораВремени(ПолеВводаФормы, Интервал = 3600, Начало = '00010101080000', Окончание = '00010101200000') Экспорт
	
	СписокВремен = ПолеВводаФормы.СписокВыбора;
	СписокВремен.Очистить();
	
	ВремяСписка = НачалоЧаса(Начало);
	
	Пока НачалоЧаса(ВремяСписка) <= НачалоЧаса(Окончание) Цикл
		
		Если НЕ ЗначениеЗаполнено(ВремяСписка) Тогда
			ПредставлениеВремени = "00:00";
		Иначе
			ПредставлениеВремени = Формат(ВремяСписка,"ДФ=ЧЧ:мм");
		КонецЕсли;
		
		СписокВремен.Добавить(ВремяСписка, ПредставлениеВремени);
		
		ВремяСписка = ВремяСписка + Интервал;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьКорректностьАдресаЭлектроннойПочты(Адрес) Экспорт
	
	ТекстОшибки = "";
	РезультатПроверки = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Адрес, Ложь);
	
	Для Каждого ПроверенныйАдрес Из РезультатПроверки Цикл
		Если Не ЗначениеЗаполнено(ПроверенныйАдрес.Адрес)
			Или Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ПроверенныйАдрес.Адрес) Тогда
			
			ТекстОшибки = НСтр("ru='Указан некорректный адрес электронной почты.'");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Процедура заполняет указанный реквизит формы представлением продолжительности.
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения
//  ИмяРеквизита - Строка - Имя реквизита формы, который будет заполнен
//  Начало - Дата - Дата начала
//  Окончание - Дата - Дата окончания
//
Процедура СформироватьПредставлениеПродолжительности(Форма, ИмяРеквизита, Начало, Окончание) Экспорт
	
	ПредставлениеПродолжительности = "";
	
	Если Не ЗначениеЗаполнено(Начало)
		Или Не ЗначениеЗаполнено(Окончание) Тогда
		
		Форма[ИмяРеквизита] = ПредставлениеПродолжительности;
		Возврат;
		
	КонецЕсли;
	
	СекундВСутках = 86400;
	СекундВЧасе   = 3600;
	СекундВМинуте = 60;
	
	ДлительностьСек = Окончание - Начало;
	
	Дней = Цел(ДлительностьСек / СекундВСутках);
	ПодписьДней = СтрокаСЧислом(НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'"), Дней,
		ВидЧисловогоЗначения.Количественное);
	
	Часов = Цел((ДлительностьСек - Дней * СекундВСутках) / СекундВЧасе);
	ПодписьЧасов = СтрокаСЧислом(НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'"), Часов,
		ВидЧисловогоЗначения.Количественное);

	Минут = Цел((ДлительностьСек - Дней * СекундВСутках - Часов * СекундВЧасе) / СекундВМинуте);
	ПодписьМинут = СтрокаСЧислом(НСтр("ru = ';%1 минута;;%1 минуты;%1 минут;%1 минуты'"), Минут,
		ВидЧисловогоЗначения.Количественное);
	
	Если Дней > 0 Тогда 
		ПредставлениеПродолжительности = ПредставлениеПродолжительности + ПодписьДней;
	КонецЕсли;
	
	Если Часов > 0 Тогда 
		
		Если Дней > 0 Тогда
			ПредставлениеПродолжительности = ПредставлениеПродолжительности + " ";
		КонецЕсли;
		
		ПредставлениеПродолжительности = ПредставлениеПродолжительности + ПодписьЧасов;
	КонецЕсли;
	
	Если Минут > 0 Тогда 
		
		Если Дней > 0 Или Часов > 0 Тогда
			ПредставлениеПродолжительности = ПредставлениеПродолжительности + " ";
		КонецЕсли;
		
		ПредставлениеПродолжительности = ПредставлениеПродолжительности + ПодписьМинут;
	КонецЕсли;
	
	Форма[ИмяРеквизита] = ПредставлениеПродолжительности;
	
КонецПроцедуры

#КонецОбласти
