///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ПоискКонтрагентов".
// ОбщийМодуль.ПоискКонтрагентовКлиентСерверПереопределяемый.
//
// Переопределяемые методы.
// - Изменение списка выводимых полей по умолчанию.
// - Настройка отчета по умолчанию.
// - Заполнение дополнительной информации для строк отчета.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет изменить список полей, выводимый по умолчанию для определенного вида контрагента.
//  - Если пользователь не указал, какие поля необходимо выводить в отчет, то будут отмечены те поля, идентификаторы которых
//    указаны в параметре ПоляПоУмолчанию.
//  - Порядок полей в параметре ПоляПоУмолчанию соответствует тому, в каком порядке поля будут выведены в отчет.
//  - Идентификаторы полей задаются на стороне веб-сервиса и могут меняться независимо от версии библиотеки.
//  - Если будет указан идентификатор, которого нет в текущей версии доступных полей, то он будет проигнорирован.
//  - Допускается дублирование полей. Выведено будет только первое.
//
// Параметры:
//  ВидКонтрагента - Строка - идентификатор вида контрагента может принимать значения "ЮрЛицо" или "ИП".
//  ПоляПоУмолчанию - Массив Из Строка - идентификаторы полей, выводимых по умолчанию для указанного вида контрагента.
//
// Пример:
//  Если выполняется получение списка полей по умолчанию для юр. лица, то в выводимые поля добавляется "Регион".
//  Если выполняется получение списка полей ИП, то в начало списка добавляется поле "ИНН".
//
//  Если ВидКонтрагента = "ЮрЛицо" Тогда
//      ПоляПоУмолчанию.Добавить("CORP_RFSUBJECT");
//  ИначеЕсли ВидКонтрагента = "ИП" Тогда
//      ПоляПоУмолчанию.Вставить(0, "PERS_INN");
//  КонецЕсли;
//
Процедура ПриОпределенииПолейПоУмолчанию(
		Знач ВидКонтрагента,
		ПоляПоУмолчанию) Экспорт


КонецПроцедуры

// Позволяет определить настройки поиска контрагентов, используемые по умолчанию
//
// Параметры:
//  Настройки - Соответствие Из КлючИЗначение - настройки по умолчанию:
//    * Ключ - Строка - идентификатор вида контрагента. Для получения идентификатора следует использовать
//             методы ПоискКонтрагентовСлужебныйКлиентСервер.ВидКонтрагентаЮрЛицо
//             и ПоискКонтрагентовСлужебныйКлиентСервер.ВидКонтрагентаИП.
//    * Значение - Структура - значение настроек по виду контрагента:
//      ** КоличествоКритериевВБыстромДоступе - Число - количество критериев отбора, которые будут
//           выведены в область быстрого, если нет пользовательских настроек. Значение по умолчанию - 4.
//
Процедура ПриНастройкеПоискаКонтрагентов(Настройки) Экспорт
	
	
КонецПроцедуры

// Позволяет дополнить отчет прикладными данными.
// 
// Параметры:
//  Настройки - Структура - Настройки вывода отчета:
//    * ИНН - Массив Из Строка - ИНН контрагентов, выводимых на текущую страницу отчета.
//    * ДополнительныеДанные - Соответствие Из КлючИЗначение - дополнительная информация, которая будет выведена
//        в отчет. Всегда пустое. Необходимо заполнить прикладной информацией:
//        ** Ключ - Строка - ИНН контрагента;
//        ** Значение - См. ПоискКонтрагентов.НовыйНастройкиСтроки.
//
Процедура ПриНастройкеОтображенияОтчета(Настройки) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
