
#Область ПрограммныйИнтерфейс

// Позволяет переопределить создание нового документа Событие (электронное письмо) по данным сообщения при загрузке почты.
//
// Параметры:
//  Событие - ДокументОбъект.Событие
//  ИнтернетПочтовоеСообщение - ИнтернетПочтовоеСообщение
//
Процедура ПриСозданииСобытияНаОснованииИнтернетПочтовогоСообщения(Событие, ИнтернетПочтовоеСообщение) Экспорт
	
	Справочники.КонтактныеФормыGoogle.ПриСозданииСобытияНаОснованииИнтернетПочтовогоСообщения(Событие, ИнтернетПочтовоеСообщение);
	
КонецПроцедуры

// Вызывается после создания нового документа Событие (электронное письмо) по данным сообщения при загрузке почты.
//
// Параметры:
//  Событие - ДокументОбъект.Событие
//  ИнтернетПочтовоеСообщение - ИнтернетПочтовоеСообщение
//
Процедура ПослеСозданияСобытияНаОснованииИнтернетПочтовогоСообщения(Событие, ИнтернетПочтовоеСообщение) Экспорт
	
	КонтактЦентр.ПослеСозданияСобытияНаОснованииИнтернетПочтовогоСообщения(Событие, ИнтернетПочтовоеСообщение);
	
КонецПроцедуры

#КонецОбласти