#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ТипЗначения", ТипЗначения);
	ПредставлениеТипа = Строка(ТипЗначения.Типы().Получить(0));
	ТекСписок = ХранилищеСистемныхНастроек.Загрузить("БыстрыеНастройкиОформленияОтчетов", ПредставлениеТипа);
	Если Не ТипЗнч(ТекСписок) = Тип("СписокЗначений") Тогда
		ТекСписок = Новый СписокЗначений;
	КонецЕсли;
	Для Каждого Элемент Из ТекСписок Цикл
		БыстрыеНастройки.Добавить(Элемент.Значение, Элемент.Представление, , Элемент.Картинка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБыстрыеНастройки

&НаКлиенте
Процедура БыстрыеНастройкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Принять(Команда)

	ПринятьНаСервере();
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПринятьНаСервере()

	ПредставлениеТипа = Строка(ТипЗначения.Типы().Получить(0));
	ХранилищеСистемныхНастроек.Сохранить("БыстрыеНастройкиОформленияОтчетов", ПредставлениеТипа, БыстрыеНастройки);

КонецПроцедуры

#КонецОбласти
