
#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров для вызова операции, структура может быть расширена пользовательскими параметрами
//
// Возвращаемое значение:
//  Структура:
//   * ПодготовитьДанные - Булево - выполнять подготовку данных на сервере перед обращением к драйверу
//   * ОбработатьДанные - Булево - выполнять обработку данных на сервере после обращения к драйверу
//   * Команда - Строка - строковое представление команды
//
Функция ПараметрыОперации() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("ПодготовитьДанные", Ложь); 
	Параметры.Вставить("ОбработатьДанные", Ложь); 
	Параметры.Вставить("Команда", ""); 
	Возврат Параметры;
	
КонецФункции

// Заполняет структуру параметров передачи драйверу оборудования, структура может быть расширена пользовательскими параметрами
//
// Возвращаемое значение:
//  Структура:
//   * Результат - Булево - результат выполнения операции драйвера
//   * ТекстОшибки - Строка - Текстовое представление ошибки
//
Функция ДанныеОперации() Экспорт
	
	ДанныеОперации = Новый Структура();
	ДанныеОперации.Вставить("Результат", Истина);
	ДанныеОперации.Вставить("ТекстОшибки");
	Возврат ДанныеОперации;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СобытиеЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Несертифицированное оборудование'");
КонецФункции

#КонецОбласти