
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПоступленияСуммаПриИзменении(Элемент)
	ТребованияФНСКлиент.ПересчитатьИтог(ЭтотОбъект, Доходы, "Сумма", "Итого");
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияСуммаОчистка(Элемент, СтандартнаяОбработка)
	ТребованияФНСКлиент.ПересчитатьИтог(ЭтотОбъект, Доходы, "Сумма", "Итого");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВПояснение(Команда)
	
	Результат = Новый Структура();
	
	ДобавитьЗначениеПараметраИзТаблицы(Результат, "Доходы", НСтр("ru = '- %Доход, %Сумма руб.'"));
	ДобавитьЕдиничноеЗначениеПараметра(Результат, "Итого", Итого);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДобавитьЗначениеПараметраИзТаблицы(Результат, ИмяТаблицы, Шаблон, Знач Замена = "")
	
	Значение = СформироватьПараметрИзТаблицы(ИмяТаблицы, Шаблон);
	ДобавитьЕдиничноеЗначениеПараметра(Результат, ИмяТаблицы, Значение);
		
КонецФункции

&НаКлиенте
Функция ДобавитьЕдиничноеЗначениеПараметра(Результат, Ключ, Значение)
	
	ТребованияФНСКлиентСервер.ДобавитьЗначениеПараметраШаблона(
		Результат, 
		Ключ, 
		Значение);
		
КонецФункции

&НаСервере
Функция СформироватьПараметрИзТаблицы(ИмяТаблицы, Знач Шаблон)
	
	Таблица = ЭтотОбъект[ИмяТаблицы];
	Возврат Справочники.ШаблоныПоясненийДляФНС.СформироватьПараметрИзТаблицы(Таблица, Шаблон);

КонецФункции

#КонецОбласти

