//@strict-types

#Область СлужебныеПроцедурыИФункции

// Возвращает объект HTTPСоединение для работы с сервисом электронного документооборота.
// 
// Параметры:
// 	СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
// 	Таймаут - Число
// Возвращаемое значение:
// 	См. ИнтернетСоединениеБЭД.ОписаниеHTTPСоединения
Функция СоединениеССервисом(СпособОбмена, Таймаут = 30) Экспорт
	
	Если СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском Тогда
		ПараметрыСервиса = СервисЭДО.ПараметрыСервиса1СТакском();
	ИначеЕсли СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО Тогда
		ПараметрыСервиса = СервисЭДО.ПараметрыСервиса1СЭДО();
	Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимое значение параметра СпособОбмена метода СервисЭДОПовтИсп.СоединениеССервисом'")
	КонецЕсли;
	
	Возврат ИнтернетСоединениеБЭД.ОписаниеHTTPСоединения(ПараметрыСервиса.АдресВебСервиса, Таймаут)
	
КонецФункции

#КонецОбласти