#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	Настройки = РегистрыСведений.НастройкиПравилОбработкиЗаявокКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиПравилОбработкиЗаявокКабинетСотрудника);
							
	Если СтруктураНастроек.ДнейНаИсполнение = 0 Тогда
		СтруктураНастроек.ДнейНаИсполнение = 7
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Функция СохранитьНастройки(НовыеНастройки) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПравилОбработкиЗаявокКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), НовыеНастройки);
	НаборЗаписей.Записать();

КонецФункции

#КонецОбласти

#КонецЕсли