
#Область СлужебныйПрограммныйИнтерфейс

#Область Лиды

// Процедура - Создание заявки на лида
//
// Параметры:
//  Параметры - Структура:
//   * Лид - СправочникСсылка.Лиды
//   * ЗаявкиИспользуются - Булево
//   * ИспользоватьВидыЗаказов - Булево
//   * Модифицированность - Неопределено, Булево
//   * ПроверитьЗаписьЛида - Неопределено - если передано, то проверяется запись лида
//   * Форма - ФормаКлиентскогоПриложения
//   * ВидОперации - Неопределено, ПеречислениеСсылка.ВидыОперацийЗаказПокупателя
//   * ВариантЗавершенияЛида - Неопределено, ПеречислениеСсылка.ВариантЗавершенияРаботыСЛидом
//   * ПредставлениеЛида - Неопределено, Строка
//
Асинх Процедура СозданиеЗаявкиНаЛидаАсинх(Параметры) Экспорт
	
	Лид = Параметры.Лид;
	ЗаявкиИспользуются = Параметры.ЗаявкиИспользуются;
	ИспользоватьВидыЗаказов = Параметры.ИспользоватьВидыЗаказов;
	ПроверитьЗаписьЛида = Параметры.Свойство("ПроверитьЗаписьЛида");
	
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ВидОперации;
	Иначе
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу");
	КонецЕсли;
	Если Параметры.Свойство("ВариантЗавершенияЛида") Тогда
		ВариантЗавершенияЛида = Параметры.ВариантЗавершенияЛида;
	Иначе
		ВариантЗавершенияЛида = Неопределено;
	КонецЕсли;
	Если Параметры.Свойство("ПредставлениеЛида") Тогда
		ПредставлениеЛида = Параметры.ПредставлениеЛида;
	Иначе
		ПредставлениеЛида = "";
	КонецЕсли;
	Если Параметры.Свойство("Модифицированность") Тогда
		Модифицированность = Параметры.Модифицированность;
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
	ЭтоЗаказПокупателя =
	(ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу"));
	
	Если Не ЗаявкиИспользуются Тогда
		
		Если ЭтоЗаказПокупателя Тогда
			
			Если ИспользоватьВидыЗаказов Тогда
				
				ТекстВопроса = НСтр("ru = 'Заявки для заказов покупателей отключены.
				|Их можно включить через настройку процессов видов заказов.
				|Перейти к видам заказов?'");
				
			Иначе
				
				ТекстВопроса = НСтр("ru = 'Заявки для заказов покупателей отключены.
				|Их можно включить через настройку процессов.
				|Перейти к настройке процессов?'");
				
			КонецЕсли;
			
		Иначе
			
			Если ИспользоватьВидыЗаказов Тогда
				
				ТекстВопроса = НСтр("ru = 'Заявки для заказ-нарядов отключены.
				|Их можно включить через настройку процессов видов заказ-нарядов.
				|Перейти к видам заказов?'");
				
			Иначе
				
				ТекстВопроса = НСтр("ru = 'Заявки для заказ-нарядов отключены.
				|Их можно включить через настройку процессов.
				|Перейти к настройке процессов?'");
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОтветОтПользователя = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Если ОтветОтПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		Если ИспользоватьВидыЗаказов Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ПервоеВключениеЗаявок");
			
			Если ЭтоЗаказПокупателя Тогда
				ОткрытьФорму("Справочник.ВидыЗаказовПокупателей.ФормаСписка", ПараметрыФормы);
			Иначе
				ОткрытьФорму("Справочник.ВидыЗаказНарядов.ФормаСписка", ПараметрыФормы);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
		Если ЭтоЗаказПокупателя Тогда
			ОсновнойВид = ПредопределенноеЗначение("Справочник.ВидыЗаказовПокупателей.Основной");
		Иначе
			ОсновнойВид = ПредопределенноеЗначение("Справочник.ВидыЗаказНарядов.Основной");
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ОсновнойВид);
		ПараметрыФормы.Вставить("НастройкаПроцессов");
		ПараметрыФормы.Вставить("ПервоеВключениеЗаявок");
		
		Если ЭтоЗаказПокупателя Тогда
			ОткрытьФорму("Справочник.ВидыЗаказовПокупателей.ФормаОбъекта", ПараметрыФормы);
		Иначе
			ОткрытьФорму("Справочник.ВидыЗаказНарядов.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьЗаписьЛида И (Лид.Пустая() Или Модифицированность) Тогда
		
		Если Лид.Пустая() Тогда
			ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Создание заявки возможно только после записи данных.
			|Данные будут записаны.'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Перед созданием заявки следует записать лида'");
		КонецЕсли;
		
		ОтветОтПользователя = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветОтПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Параметры.Форма.Записать() Тогда
			Возврат;
		КонецЕсли;
		
		Лид = Параметры.Форма.Объект.Ссылка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВариантЗавершенияЛида) Тогда
		РаботаСЛидамиКлиент.ПоказатьПредупреждениеОЗавершенномЛиде(Лид, ПредставлениеЛида);
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Лид", Лид);
	
	Если Не ЭтоЗаказПокупателя Тогда
		ЗначенияЗаполнения.Вставить(
		"ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ВидыЗаказов

Процедура ПредупреждениеОбИспользованииЗаявокДляСостояния(ПредставлениеСостояния, ЭтоМК) Экспорт
	
	Если ЭтоМК Тогда
		
		ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Состояние ""%1"" используется для заявок.
		|Для исключения состояния из вида перейдите в настольную версию приложения'"),
		ПредставлениеСостояния);
		
	Иначе
		
		ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Состояние ""%1"" используется для заявок.
		|Для исключения состояния из вида отключите использование заявок для такого состояния'"),
		ПредставлениеСостояния);
		
	КонецЕсли;
	
	ПредупреждениеАсинх(ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти

#Область Заказы

Процедура ПредупреждениеОПереводеЗаказаВЗаявку() Экспорт
	
	ПредупреждениеАсинх(НСтр("ru = 'Заказ нельзя переводить в заявку'"));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти