////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер: клиент, сервер
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеПроцедурыИФункции

// Конструктор структуры, описывающей ключевые данные правила интеграции.
//
// Возвращаемое значение:
//  Структура:
//     * Ссылка - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом - правило.
//              - Неопределено
//     * ПредставлениеОбъектаДО - Строка - представление объекта ДО.
//     * ПредставлениеОбъектаИС - Строка - представление объекта ИС.
//     * ТипОбъектаДО - Строка - тип объекта ДО.
//     * ТипОбъектаИС - Строка - тип объекта ИС.
//     * ПредставлениеВидаДокумента - Строка - представление вида документа ДО.
//     * ИдентификаторВидаДокумента - Строка - идентификатор вида документа ДО.
//     * ТипВидаДокумента - Строка - тип вида документа ДО.
//
Функция ДанныеПравилаИнтеграции() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("ТипОбъектаИС", "");
	Результат.Вставить("ТипОбъектаДО", "");
	Результат.Вставить("ПредставлениеОбъектаИС", "");
	Результат.Вставить("ПредставлениеОбъектаДО", "");
	Результат.Вставить("ПредставлениеВидаДокумента", "");
	Результат.Вставить("ИдентификаторВидаДокумента", "");
	Результат.Вставить("ТипВидаДокумента", "");
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры, описывающей реквизит объекта ДО.
//
// Возвращаемое значение:
//  Структура:
//     * Имя - Строка
//     * Тип - Строка
//     * Представление - Строка
//     * ЭтоДополнительныйРеквизитДО - Булево
//     * ДополнительныйРеквизитДОID - Строка
//     * ДополнительныйРеквизитДОТип - Строка
//     * ЭтоТаблица - Булево
//     * Таблица - Строка
//
Функция ДанныеРеквизита() Экспорт
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", "");
	ДанныеРеквизита.Вставить("Тип", "");
	ДанныеРеквизита.Вставить("Представление", "");
	ДанныеРеквизита.Вставить("ЭтоДополнительныйРеквизитДО", Ложь);
	ДанныеРеквизита.Вставить("ДополнительныйРеквизитДОID", "");
	ДанныеРеквизита.Вставить("ДополнительныйРеквизитДОТип", "");
	ДанныеРеквизита.Вставить("ЭтоТаблица", Ложь);
	ДанныеРеквизита.Вставить("Таблица", "");
	
	Возврат ДанныеРеквизита;
	
КонецФункции

// Возвращает структуру данных объекта 1С:Документооборот ссылочного типа.
//
// Параметры:
//   ID - Строка - идентификатор объекта ДО.
//   Тип - Строка - тип объекта XDTO.
//   Наименование - Строка - имя объекта ДО.
//   Представление - Строка - представление объекта ДО.
//   НавигационнаяСсылка - Строка - навигационная ссылка на объект ДО.
//
// Возвращаемое значение:
//   Структура - данные владельца подписей:
//     * ID - Строка - идентификатор объекта ДО.
//     * Тип - Строка - тип объекта XDTO.
//     * Наименование - Строка - имя объекта ДО.
//     * Представление - Строка - представление объекта ДО.
//     * НавигационнаяСсылка - Строка - навигационная ссылка на объект ДО.
//
Функция ДанныеСсылочногоОбъектаДО(ID, Тип, Наименование = "", Представление = "", НавигационнаяСсылка = "") Экспорт
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("ID", ID);
	ДанныеОбъекта.Вставить("Тип", Тип);
	ДанныеОбъекта.Вставить("Наименование", Наименование);
	ДанныеОбъекта.Вставить("Представление", Представление);
	ДанныеОбъекта.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

// Возвращает структуру данных файла.
//
// Параметры:
//   Наименование - Строка - имя объекта ДО.
//   ID - Строка - идентификатор объекта ДО.
//   Тип - Строка - тип объекта XDTO.
//   Расширение - Строка - расширение файла.
//   РольФайлаID - Строка - роль файла.
//
// Возвращаемое значение:
//   Структура - данные владельца подписей:
//     * Наименование - Строка - имя объекта ДО.
//     * ID - Строка - идентификатор объекта ДО.
//     * Тип - Строка - тип объекта XDTO.
//     * Расширение - Строка - расширение файла.
//     * РольФайлаID - Строка - роль файла.
//                   - Неопределено
//     * СсылкаНаДвоичныеДанныеФайла - Строка - адрес данных файла во временном хранилище.
//     * Описание - Строка - описание файла.
//     * Размер - Число - размер файла.
//     * ДатаМодификации - Дата - дата модификации файла.
//     * ДатаМодификацииУниверсальная - Дата - дата модификации файла универсальная.
//     * ИмяФайла - Строка - имя файла с расширением.
//     * Текст - Строка - текст файла.
//
Функция ДанныеФайла(Наименование, ID, Тип, Расширение = "", РольФайлаID = Неопределено) Экспорт
	
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("Наименование", Наименование);
	ДанныеФайла.Вставить("ID", ID);
	ДанныеФайла.Вставить("Тип", Тип);
	ДанныеФайла.Вставить("Расширение", Расширение);
	ДанныеФайла.Вставить("РольФайлаID", РольФайлаID);
	ДанныеФайла.Вставить("СсылкаНаДвоичныеДанныеФайла", "");
	ДанныеФайла.Вставить("Описание", "");
	ДанныеФайла.Вставить("Размер", 0);
	ДанныеФайла.Вставить("ДатаМодификации", Дата(1,1,1));
	ДанныеФайла.Вставить("ДатаМодификацииУниверсальная", Дата(1,1,1));
	ДанныеФайла.Вставить("ИмяФайла", ИмяФайлаСРасширением(Наименование, Расширение));
	ДанныеФайла.Вставить("Текст", "");
	
	Возврат ДанныеФайла;
	
КонецФункции

// Конструктор структуры, описывающей событие произошедшее с файлом, а также формы, которые требуется
// проинформировать о данном событии.
//
// Возвращаемое значение:
//   Структура:
//     * ЗаписьФайла - Булево
//     * ИзменениеАктивнойВерсииФайла - Булево
//     * ИзменениеРолиФайла - Булево
//     * ИзменениеЭПФайла - Булево
//     * РедактированиеФайла - Булево
//     * РедактированиеФайлаЗавершено - Булево
//     * СозданиеФайла - Булево
//     * УдалениеФайла - Булево
//     * ИнформироватьФормуФайла - Булево - нужно проинформировать форму файла.
//     * ИнформироватьФормуСпискаФайлов - Булево - нужно проинформировать форму, содержащую список файлов, например,
//         формы ПрисоединенныеФайлы, ЗадачиМне, Задача.
//
Функция ДействиеНадФайлом() Экспорт
	
	ДействиеНадФайлом = Новый Структура;
	// Событие произошедшее с файлом.
	ДействиеНадФайлом.Вставить("ЗаписьФайла", Ложь);
	ДействиеНадФайлом.Вставить("ИзменениеАктивнойВерсииФайла", Ложь);
	ДействиеНадФайлом.Вставить("ИзменениеРолиФайла", Ложь);
	ДействиеНадФайлом.Вставить("ИзменениеЭПФайла", Ложь);
	ДействиеНадФайлом.Вставить("РедактированиеФайла", Ложь);
	ДействиеНадФайлом.Вставить("РедактированиеФайлаЗавершено", Ложь);
	ДействиеНадФайлом.Вставить("СозданиеФайла", Ложь);
	ДействиеНадФайлом.Вставить("УдалениеФайла", Ложь);
	// Формы, которые требуется проинформировать.
	ДействиеНадФайлом.Вставить("ИнформироватьФормуФайла", Ложь);
	ДействиеНадФайлом.Вставить("ИнформироватьФормуСпискаФайлов", Ложь);
	
	Возврат ДействиеНадФайлом;
	
КонецФункции

// Извлечь текст из файла OpenDocument и возвратить его в виде строки.
//
// Параметры:
//   ПутьКФайлу - Строка - Полное имя файла.
//   Отказ - Булево - Отказ.
//
// Возвращаемое значение:
//   Строка - Извлеченный текст.
//
Функция ИзвлечьТекстOpenDocument(ПутьКФайлу, Отказ) Экспорт
	
	ИзвлеченныйТекст = "";
	
#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
	
	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	ВременныйZIPФайл = ПолучитьИмяВременногоФайла("zip");
	
	КопироватьФайл(ПутьКФайлу, ВременныйZIPФайл);
	Файл = Новый Файл(ВременныйZIPФайл);
	Файл.УстановитьТолькоЧтение(Ложь);

	Попытка
		Архив = Новый ЧтениеZipФайла();
		Архив.Открыть(ВременныйZIPФайл);
		Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		Архив.Закрыть();
		ЧтениеXML = Новый ЧтениеXML();
		
		ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/content.xml");
		ИзвлеченныйТекст = ИзвлечьТекстИзContentXML(ЧтениеXML);
		ЧтениеXML.Закрыть();
	Исключение
		// Не считаем ошибкой, т.к. например расширение OTF может быть как OpenDocument, так и шрифт OpenType.
		Архив = Неопределено;
		ЧтениеXML = Неопределено;
		Отказ = Истина;
		ИзвлеченныйТекст = "";
	КонецПопытки;
	
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ВременныйZIPФайл);
	
#КонецЕсли
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

// Извлекает текст в соответствии с кодировкой.
// Если кодировка не задана - сама вычисляет кодировку.
//
// Параметры:
//   ПолноеИмяФайла - Строка - Полное имя файла.
//   Кодировка - Строка - Кодировка.
//   Отказ - Булево - Отказ.
//
// Возвращаемое значение:
//   Строка - Извлеченный текст.
//
Функция ИзвлечьТекстИзТекстовогоФайла(ПолноеИмяФайла, Кодировка, Отказ) Экспорт
	
	ИзвлеченныйТекст = "";
	
#Если Не ВебКлиент Тогда
	
	// Определение кодировки.
	Если Не ЗначениеЗаполнено(Кодировка) Тогда
		Кодировка = Неопределено;
	КонецЕсли;
	
	Попытка
		КодировкаДляЧтения = ?(Кодировка = "utf-8_WithoutBOM", "utf-8", Кодировка);
		ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла, КодировкаДляЧтения);
		ИзвлеченныйТекст = ЧтениеТекста.Прочитать();
	Исключение
		Отказ = Истина;
		ИзвлеченныйТекст = "";
	КонецПопытки;
	
#КонецЕсли
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

// Формирует имя типа из полного имени объекта метаданных.
//
// Параметры:
//   ПолноеИмя - Строка - полное имя объекта метаданных.
//   ЭтоСсылка - Булево - требуется получить тип ссылки или тип объекта.
//   ВызыватьИсключение - Булево - вызывать исключение если передано не корректное полное имя.
//
// Возвращаемое значение:
//   Строка - имя типа.
//
Функция ИмяТипаИзПолногоИмени(ПолноеИмя, ЭтоСсылка = Истина, ВызыватьИсключение = Истина) Экспорт
	
	СоставИмени = СтрРазделить(ПолноеИмя, ".");
	Если СоставИмени.Количество() < 2
			Или (СоставИмени[0] <> "Справочник"
				И СоставИмени[0] <> "Документ"
				И СоставИмени[0] <> "ПланСчетов"
				И СоставИмени[0] <> "ПланВидовРасчета"
				И СоставИмени[0] <> "ПланВидовХарактеристик"
				И СоставИмени[0] <> "БизнесПроцесс"
				И СоставИмени[0] <> "Задача") Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось определить имя типа из строки ""%1""'"), ПолноеИмя);
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоСсылка Тогда
		Дополнение = "Ссылка";
	Иначе
		Дополнение = "Объект";
	КонецЕсли;
	
	Возврат СтрШаблон("%1%2.%3", СоставИмени[0], Дополнение, СоставИмени[1]);
	
КонецФункции

// Получает имя файла с расширением (если расширение пусто - только имя).
//
// Параметры:
//   ПолноеНаименование - Строка - полное наименование файла.
//   Расширение - Строка - расширение файла.
//
// Возвращаемое значение:
//   Строка - Имя с расширением. Если расширение пусто - только имя.
//
Функция ИмяФайлаСРасширением(ПолноеНаименование, Расширение) Экспорт
	
	ИмяСРасширением = ПолноеНаименование;
	
	Если Расширение <> "" Тогда
		ИмяСРасширением = СтрШаблон("%1.%2", ИмяСРасширением, Расширение);
	КонецЕсли;
	
	Возврат ИмяСРасширением;
	
КонецФункции

// Получает индекс пиктограммы файла - индекс в картинке КоллекцияПиктограммФайлов.
//
// Параметры:
//   РасширениеФайла - Строка - расширение файла.
//
// Возвращаемое значение:
//   Число
//
Функция ИндексПиктограммыФайла(Знач РасширениеФайла) Экспорт
	
	Если ТипЗнч(РасширениеФайла) <> Тип("Строка") Или ПустаяСтрока(РасширениеФайла) Тогда
		Возврат 0;
	КонецЕсли;
	
	РасширениеФайла = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
	
	Расширение = "." + НРег(РасширениеФайла) + ";";
	
	Если СтрНайти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
		Возврат 6; // Файлы 1С.
		
	ИначеЕсли Расширение = ".mxl;" Тогда
		Возврат 8; // Табличный Файл.
		
	ИначеЕсли СтрНайти(".txt;.log;.ini;", Расширение) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли Расширение = ".epf;" Тогда
		Возврат 12; // Внешние обработки.
		
	ИначеЕсли СтрНайти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли СтрНайти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли СтрНайти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли СтрНайти(".xls;.xlw;",Расширение) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли СтрНайти(".ppt;.pps;",Расширение) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли СтрНайти(".vsd;",Расширение) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mpp;",Расширение) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли СтрНайти(".xml;",Расширение) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли СтрНайти(".msg;.eml;",Расширение) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли СтрНайти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли СтрНайти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли СтрНайти(".grs;",Расширение) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли СтрНайти(".geo;",Расширение) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли СтрНайти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли СтрНайти(".bmp;.dib;",Расширение) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли СтрНайти(".tif;.tiff;",Расширение) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли СтрНайти(".gif;",Расширение) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли СтрНайти(".png;",Расширение) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли СтрНайти(".pdf;",Расширение) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли СтрНайти(".odt;",Расширение) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли СтрНайти(".odf;",Расширение) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли СтрНайти(".odp;",Расширение) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли СтрНайти(".odg;",Расширение) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли СтрНайти(".ods;",Расширение) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли СтрНайти(".mp3;",Расширение) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли СтрНайти(".erf;",Расширение) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли СтрНайти(".docx;",Расширение) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли СтрНайти(".xlsx;",Расширение) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли СтрНайти(".pptx;",Расширение) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли СтрНайти(".p7s;",Расширение) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли СтрНайти(".p7m;",Расширение) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

// Возвращает строку с размером файла в кратком и удобном для чтения формате.
//
// Параметры:
//   Размер - Число - размер файла в байтах.
//
// Возвращаемое значение:
//   Строка - размер файла в виде 123.4 Кб
//
Функция КраткоеПредставлениеРазмера(Знач Размер) Экспорт
	
	Если Размер = 0 Тогда
		Возврат "-";
		
	ИначеЕсли Размер < 1024 * 10 Тогда // < 10 Кб.
		Возврат СтрШаблон(НСтр("ru = '%1 Кб'"), Формат(РазмерВКб(Размер), "ЧГ=0"));
		
	ИначеЕсли Размер < 1024 * 1024 Тогда // < 1 Мб.
		Возврат СтрШаблон(НСтр("ru = '%1 Кб'"), Формат(РазмерВКб(Размер), "ЧГ=0"));
		
	ИначеЕсли Размер < 1024 * 1024 * 10 Тогда // < 10 Мб.
		Возврат СтрШаблон(НСтр("ru = '%1 Мб'"), Формат(РазмерВМб(Размер), "ЧГ=0"));
		
	Иначе // >= 10 Мб.
		Возврат СтрШаблон(НСтр("ru = '%1 Мб'"), Формат(РазмерВМб(Размер), "ЧГ=0"));
		
	КонецЕсли;
	
КонецФункции

// Настраивает параметры элемента формы.
//
// Параметры:
//   ПолеВвода - ПолеФормы - элемент формы.
//   ОписаниеТипа - ОписаниеТипов - описание типа значения в поле ввода.
//
Процедура НастроитьПолеВводаПоТипу(ПолеВвода, ОписаниеТипа) Экспорт
	
	ПервыйТип = ОписаниеТипа.Типы()[0];
	Если ПервыйТип = Тип("Дата") Тогда
		ПолеВвода.КнопкаРегулирования = Истина;
	ИначеЕсли ПервыйТип = Тип("Число") Тогда
		ПолеВвода.КнопкаРегулирования = Истина;
		КвалификаторыЧисла = ОписаниеТипа.КвалификаторыЧисла;
		ПолеВвода.МаксимальноеЗначение =
			(pow(10, КвалификаторыЧисла.Разрядность) -1) / pow(10, КвалификаторыЧисла.РазрядностьДробнойЧасти);
		Если КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный Тогда
			ПолеВвода.МинимальноеЗначение = 0;
		Иначе
			ПолеВвода.МинимальноеЗначение = 0 - ПолеВвода.МаксимальноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Конструктор структуры, описывающей настройку связи между объектами ДО.
//
// Параметры:
//   СсылкаИз - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//   СсылкаНа - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//   ТипСвязи - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//
// Возвращаемое значение:
//  Структура:
//     * СсылкаИз - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//     * СсылкаНа - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//     * ТипСвязи - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//     * ТипСвязиКомментарий - Строка
//
Функция НастройкаСвязиОбъектовДО(СсылкаИз, СсылкаНа, ТипСвязи) Экспорт
	
	НастройкаСвязиОбъектовДО = Новый Структура;
	НастройкаСвязиОбъектовДО.Вставить("СсылкаИз", СсылкаИз);
	НастройкаСвязиОбъектовДО.Вставить("СсылкаНа", СсылкаНа);
	НастройкаСвязиОбъектовДО.Вставить("ТипСвязи", ТипСвязи);
	НастройкаСвязиОбъектовДО.Вставить("ТипСвязиКомментарий", "");
	
	Возврат НастройкаСвязиОбъектовДО;
	
КонецФункции

// Конструктор структуры, описывающей настройки авторизации в 1С:Документообороте.
//
// Возвращаемое значение:
//  Структура:
//     * ИмяПользователя - Строка - имя пользователя ДО, или
//                       - Неопределено - признак необходимости получить имя, сохраненное в параметрах сеанса.
//     * Пароль - Строка - пароль пользователя ДО, или
//              - Неопределено - признак необходимости получить пароль, сохраненное в параметрах сеанса.
//     * ПарольСохранен - Булево - Истина, если пароль сохранен пользователем.
//     * ИспользуетсяАутентификацияОС - Булево - Истина, если используется аутентификация операционной системы.
//     * ИспользуетсяАутентификацияJWT - Булево - Истина, если используется аутентификация через JWT-токены.
//     * ИспользоватьКеш - Булево - прокси будет получен из данных, записанных в параметры сеанса.
//
Функция НастройкиАвторизацииВ1СДокументообороте() Экспорт
	
	НастройкиАвторизации = Новый Структура;
	НастройкиАвторизации.Вставить("ИмяПользователя", Неопределено);
	НастройкиАвторизации.Вставить("Пароль", Неопределено);
	НастройкиАвторизации.Вставить("ПарольСохранен", Ложь);
	НастройкиАвторизации.Вставить("ИспользуетсяАутентификацияОС", Ложь);
	НастройкиАвторизации.Вставить("ИспользуетсяАутентификацияJWT", Ложь);
	НастройкиАвторизации.Вставить("ИспользоватьКеш", Истина);
	
	Возврат НастройкиАвторизации;
	
КонецФункции

// Возвращает пустые параметры создания файла для вызова
// ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьФайлВДокументообороте.
//
// Параметры:
//   ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//
// Возвращаемое значение:
//   Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * АдресВременногоХранилищаФайла - Неопределено
//     * Владелец - Неопределено
//     * ЯвляетсяСканКопией - Булево
//     * ШаблонID - Строка
//     * ВнешнийОбъект - Структура:
//       ** ID - Строка
//       ** type - Строка
//       ** name - Строка
//
Функция НовыеПараметрыСозданияФайла(ТекущийФайл) Экспорт
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("ТекущийФайл", ТекущийФайл);
	ПараметрыСоздания.Вставить("АдресВременногоХранилищаФайла", Неопределено);
	ПараметрыСоздания.Вставить("Владелец", Неопределено);
	ПараметрыСоздания.Вставить("ЯвляетсяСканКопией", Ложь);
	ПараметрыСоздания.Вставить("ШаблонID", "");
	ПараметрыСоздания.Вставить("ВнешнийОбъект", Новый Структура("ID, type, name"));
	
	Возврат ПараметрыСоздания;
	
КонецФункции

// Возвращает данные объекта ДО, переданные в форму объекта ИС при ее создании.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма объекта ИС.
//
// Возвращаемое значение:
//   см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//
Функция ОбъектДОИзДанныхФормы(Форма) Экспорт
	
	Если Форма = Неопределено Тогда
		Возврат ДанныеСсылочногоОбъектаДО("", "");
	КонецЕсли;
	
	ДанныеФормы = Новый Структура(
		"ИнтеграцияС1СДокументооборотом_ИдентификаторОбъектаДО, ИнтеграцияС1СДокументооборотом_ТипОбъектаДО");
	ЗаполнитьЗначенияСвойств(ДанныеФормы, Форма);
	
	// Команда используется для передачи идентификатора объекта ДО при создании на основании.
	КомандаИдентификатор = Форма.Команды.Найти("ИдентификаторОбъектаДО");
	Если КомандаИдентификатор <> Неопределено Тогда
		ДанныеФормы.ИнтеграцияС1СДокументооборотом_ИдентификаторОбъектаДО = КомандаИдентификатор.Действие;
	КонецЕсли;
	
	Возврат ДанныеСсылочногоОбъектаДО(
		ДанныеФормы.ИнтеграцияС1СДокументооборотом_ИдентификаторОбъектаДО,
		ДанныеФормы.ИнтеграцияС1СДокументооборотом_ТипОбъектаДО);
	
КонецФункции

// Возвращает представление участника задачи ДО.
//
// Параметры:
//   Исполнитель - Строка - представление исполнителя. Роль или сотрудник.
//   ОсновнойОбъектАдресации - Строка - представление основного объекта адресации.
//   ДополнительныйОбъектАдресации - Строка - представление дополнительного объекта адресации.
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеУчастникаЗадачи(Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации) Экспорт
	
	МассивСтрок = Новый Массив;
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		МассивСтрок.Добавить(Исполнитель);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОсновнойОбъектАдресации) Тогда
		МассивСтрок.Добавить(ОсновнойОбъектАдресации);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДополнительныйОбъектАдресации) Тогда
		МассивСтрок.Добавить(ДополнительныйОбъектАдресации);
	КонецЕсли;
	
	Возврат СтрСоединить(МассивСтрок, ", ");
	
КонецФункции

// Возвращает размер файла в килобайтах.
//
// Параметры:
//   Размер - Число - размер файла в байтах.
//
// Возвращаемое значение:
//   Число - размер файла в Кб.
//
Функция РазмерВКб(Знач Размер) Экспорт
	
	Если Размер = 0 Тогда
		Возврат 0;
		
	ИначеЕсли Размер < 1024 * 10 Тогда // < 10 Кб
		Возврат Макс(1, Окр(Размер / 1024, 1, 1));
		
	Иначе
		Возврат Цел(Размер / 1024);
		
	КонецЕсли;
	
КонецФункции

// Возвращает размер файла в мегабайтах.
//
// Параметры:
//   Размер - Число - размер файла в байтах.
//
// Возвращаемое значение:
//   Число - размер файла в Мб.
//
Функция РазмерВМб(Знач Размер) Экспорт
	
	Если Размер = 0 Тогда
		Возврат 0;
		
	ИначеЕсли Размер < 1024 * 1024 * 10 Тогда // < 10 Мб.
		Возврат Окр(Размер / 1024 / 1024, 1, 1);
		
	Иначе // >= 10 Мб.
		Возврат Цел(Размер / 1024 / 1024);
		
	КонецЕсли;
	
КонецФункции

// Возвращает строку с размером файла в удобном для чтения формате с указанием количества байт.
//
// Параметры:
//   Размер - Число - размер файла в байтах.
//
// Возвращаемое значение:
//   Строка - размер файла в виде 123.4 Кб (123 456 байт)
//
Функция ПодробноеПредставлениеРазмера(Знач Размер) Экспорт
	
	Если Размер = 0 Тогда
		Возврат "-";
	КонецЕсли;
	
	Возврат СтрШаблон(НСтр("ru = '%1 (%2 байт)'"),
		КраткоеПредставлениеРазмера(Размер),
		Формат(Размер, "ЧДЦ=; ЧРГ=' '; ЧГ=3,0"));
	
КонецФункции

// Получить строку с представлением размера файла - например для отображения в Состояние при передаче файла.
//
// Параметры:
//   РазмерВМб - Число - Размер в Мб.
//
// Возвращаемое значение:
//   Строка - размера файла.
//
Функция ПолучитьСтрокуСРазмеромФайла(Знач РазмерВМб) Экспорт
	
	Если РазмерВМб < 0.1 Тогда
		РазмерВМб = 0.1;
	КонецЕсли;
	
	Если РазмерВМб >= 1 Тогда
		ФорматнаяСтрока = "ЧДЦ=0";
	Иначе
		ФорматнаяСтрока = "ЧДЦ=1; ЧН=0";
	КонецЕсли;
	
	Возврат Формат(РазмерВМб, ФорматнаяСтрока);
	
КонецФункции

// Сверяет размер файла с максимально допустимым размером, заданным в настройках интеграции.
//
// Параметры:
//   МаксРазмерФайла - Число - максимально допустимый размер файла.
//   Размер - Число - размер файла в байтах.
//   ИмяФайла - Строка - наименование файла.
//   ВызыватьИсключение - Булево - вызывать исключение если максимальный размер превышен.
//   ТекстСообщения - Строка - неявно возвращаемое значение, текст сообщения пользователю.
//
// Возвращаемое значение:
//   Булево - размер файла превышает максимально допустимый.
//
Функция РазмерФайлаПревышаетМаксимальноДопустимый(МаксРазмерФайла, Размер, ИмяФайла,
		ВызыватьИсключение = Истина, ТекстСообщения = "") Экспорт
	
	Если Размер > МаксРазмерФайла Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Размер файла ""%1"" (%2) превышает максимально допустимый (%3).'"),
			ИмяФайла,
			КраткоеПредставлениеРазмера(Размер),
			КраткоеПредставлениеРазмера(МаксРазмерФайла));
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстСообщения;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Разделяет пароль на две независимые части для последующего восстановления функцией СобратьПароль.
//
// Параметры:
//   Пароль - Строка - разделяемый пароль.
//
// Возвращаемое значение:
//   Массив из Строка - массив из двух строк, содержащих шестнадцатиричное представление пароля.
//
Функция РазделитьПароль(Пароль) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("");
	Результат.Добавить("");
	Генератор = Неопределено;
	
	// Разложим пароль в массив чисел попарно.
	МассивЧисел = Новый Массив;
	Индекс = 1;
	Пока Индекс <= СтрДлина(Пароль) Цикл
		Число = КодСимвола(Пароль, Индекс);
		Индекс = Индекс + 1;
		Если Индекс <= СтрДлина(Пароль) Тогда
			Число = Число * 65536 + КодСимвола(Пароль, Индекс);
			Индекс = Индекс + 1;
		КонецЕсли;
		МассивЧисел.Добавить(Число);
	КонецЦикла;
	
	// Разделим каждое из полученных чисел.
	Для Каждого Число Из МассивЧисел Цикл
		РазделенноеЧисло = РазделитьЧисло(Число, Генератор); // ((1, NNN), (2, MMM))
		Результат[0] = Результат[0] + ШестнадцатиричноеПредставлениеЧисла(РазделенноеЧисло[0][1], 8);
		Результат[1] = Результат[1] + ШестнадцатиричноеПредставлениеЧисла(РазделенноеЧисло[1][1], 8);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает Истина, если файл с таким расширением находится в списке расширений.
//
// Параметры:
//   СписокРасширений - Строка - Список расширений.
//   РасширениеФайла - Строка - Расширение файла.
//
// Возвращаемое значение:
//   Булево
//
Функция РасширениеФайлаВСписке(СписокРасширений, РасширениеФайла) Экспорт
	
	РасширениеФайлаБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
	
	МассивРасширений = СтрРазделить(НРег(СписокРасширений), " ", Ложь);
	
	Если МассивРасширений.Найти(РасширениеФайлаБезТочки) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Конструктор структуры, описывающей свойства файла.
//
// Возвращаемое значение:
//   Структура:
//     * ИдентификаторФайла - Строка - идентификатор файла в 1С:Документооборот.
//                          - Неопределено
//     * ИмяФайла - Строка - имя файла.
//                - Неопределено
//     * ОписаниеФайла - Строка - описание файла.
//                     - Неопределено
//     * Редактируется - Булево - файл находится на редактировании.
//                     - Неопределено
//     * Зашифрован - Булево - файл зашифрован.
//                  - Неопределено
//     * ДанныеПодписейФайла - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи
//                           - Неопределено
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//                                    - Неопределено
//     * ВладелецФайла - Строка - идентификатор владельца файла в 1С:Документооборот.
//                     - Неопределено
//
Функция СвойстваФайла() Экспорт
	
	СвойстваФайла = Новый Структура;
	СвойстваФайла.Вставить("ИдентификаторФайла", Неопределено);
	СвойстваФайла.Вставить("ИмяФайла", Неопределено);
	СвойстваФайла.Вставить("ОписаниеФайла", Неопределено);
	СвойстваФайла.Вставить("Редактируется", Неопределено);
	СвойстваФайла.Вставить("Зашифрован", Неопределено);
	СвойстваФайла.Вставить("ДанныеПодписейФайла", Неопределено);
	СвойстваФайла.Вставить("УникальныйИдентификаторФормы", Неопределено);
	СвойстваФайла.Вставить("ВладелецФайла", Неопределено);
	
	Возврат СвойстваФайла;
	
КонецФункции

// Конструктор структуры, описывающей недостающую связь между объектами ДО.
//
// Возвращаемое значение:
//  Структура:
//     * СсылкаНа - Строка
//     * СсылкаНаID - Строка
//     * СсылкаНаТип - Строка
//     * ТипСвязиID - Строка
//     * Комментарий - Строка
//
Функция СвязьКСозданию() Экспорт
	
	СвязьКСозданию = Новый Структура;
	СвязьКСозданию.Вставить("СсылкаНа", "");
	СвязьКСозданию.Вставить("СсылкаНаID", "");
	СвязьКСозданию.Вставить("СсылкаНаТип", "");
	СвязьКСозданию.Вставить("ТипСвязиID", "");
	СвязьКСозданию.Вставить("Комментарий", "");
	
	Возврат СвязьКСозданию;
	
КонецФункции

// Определяет доступность сервиса ДО по номеру версии.
//
// Параметры:
//   ВерсияСервиса - Строка - версия сервиса ДО.
//
// Возвращаемое значение:
//   Булево
//
Функция СервисДоступен(ВерсияСервиса) Экспорт
	
	Возврат ВерсияСервиса <> "" И ВерсияСервиса <> "0.0.0.0";
	
КонецФункции

// Собирает пароль из двух частей, ранее разделенных функцией РазделитьПароль.
// В случае повреждения строк возвращает Неопределено.
//
// Параметры:
//   РазделенныйПароль - Массив из Строка - две строки, содержащие разделенный пароль.
//
// Возвращаемое значение:
//   Строка - собранный пароль или
//   Неопределено - если строки повреждены.
//
Функция СобратьПароль(Знач РазделенныйПароль) Экспорт
	
	Если РазделенныйПароль.Количество() <> 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	РазделенныйПароль[0] = СокрЛП(РазделенныйПароль[0]);
	РазделенныйПароль[1] = СокрЛП(РазделенныйПароль[1]);
	Если СтрДлина(РазделенныйПароль[0]) <> СтрДлина(РазделенныйПароль[1]) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтрДлина(РазделенныйПароль[0]) % 8 <> 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Результат = "";
	Чисел = Цел(СтрДлина(РазделенныйПароль[0])) / 8;
	Для НЧисла = 1 По Чисел Цикл
		РазделенноеЧисло = Новый Массив;
		Для НЧасти = 0 По 1 Цикл
			Пара = Новый Массив;
			Пара.Добавить(НЧасти + 1);
			Представление = Сред(РазделенныйПароль[НЧасти], 1 + (НЧисла - 1) * 8, 8);
			Пара.Добавить(ЧислоИзШестнадцатеричногоПредставления(Представление));
			РазделенноеЧисло.Добавить(Пара);
		КонецЦикла;
		СобранноеЧисло = СобратьЧисло(РазделенноеЧисло);
		Если СобранноеЧисло >= 65536 Тогда
			Результат = Результат + Символ(Цел(СобранноеЧисло / 65536));
		КонецЕсли;
		Результат = Результат + Символ(СобранноеЧисло % 65536);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выводит сообщение в HTML представление, которое будет отображаться в области предпросмотра.
//
// Параметры:
//   Сообщение - Строка - сообщение для области предпросмотра.
//   ЗаголовокСообщенияВОбластиПредпросмотра - Строка - заголовок, содержащий настройки вывода сообщения.
//
// Возвращаемое значение:
//   Строка - HTML представление сообщения.
//
Функция СообщениеВПредпросмотр(Знач Сообщение, ЗаголовокСообщенияВОбластиПредпросмотра) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("<html>");
	Результат.Добавить(ЗаголовокСообщенияВОбластиПредпросмотра);
	Результат.Добавить("<div class=""block"">");
	
	Сообщение = СтрЗаменить(Сообщение, Символы.ПС, "<br>");
	Результат.Добавить(Сообщение);
	
	Результат.Добавить(
		"</div>
		|</body>
		|</html>");
	
	Возврат СтрСоединить(Результат, Символы.ПС);
	
КонецФункции

// Выводит сообщение об отсутствии HTML представления файла.
//
// Параметры:
//   ЗаголовокСообщенияВОбластиПредпросмотра - Строка - заголовок, содержащий настройки вывода сообщения.
//
// Возвращаемое значение:
//   Строка
//
Функция СообщениеОбОтсутствииПредпросмотра(ЗаголовокСообщенияВОбластиПредпросмотра) Экспорт
	
	Возврат СообщениеВПредпросмотр(
		НСтр("ru='Данные предпросмотра отсутствуют'"), ЗаголовокСообщенияВОбластиПредпросмотра);
	
КонецФункции

// Выводит сообщение о редактировании файла.
//
// Параметры:
//   ЗаголовокСообщенияВОбластиПредпросмотра - Строка - заголовок, содержащий настройки вывода сообщения.
//
// Возвращаемое значение:
//   Строка
//
Функция СообщениеОРедактировании(ЗаголовокСообщенияВОбластиПредпросмотра) Экспорт
	
	Возврат СообщениеВПредпросмотр(
		СтрШаблон("%1<br>
			|<font color=""#006699""><a href = ""OpenForEdit"">%2</a></font>",
			НСтр("ru='Данный файл занят вами на редактирование'"),
			НСтр("ru='Открыть'")),
		ЗаголовокСообщенияВОбластиПредпросмотра);
	
КонецФункции

// Получает из формы клиентского приложения ссылку на объект, интегрируемый с ДО.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется поиск ссылки.
//   ИмяРеквизита - Строка - имя реквизита, содержащего ссылку на интегрируемый с 1С:Документооборотом объект.
//   ТипИнтегрируемогоОбъекта - Тип - тип ссылки, которую требуется найти на форме.
//
// Возвращаемое значение:
//   ЛюбаяСсылка - ссылка на интегрируемый объект.
//
Функция СсылкаНаИнтегрируемыйОбъектИзФормы(Форма, ИмяРеквизита = "", ТипИнтегрируемогоОбъекта = Неопределено) Экспорт
	
	СсылкаНаИнтегрируемыйОбъект = Неопределено;
	
	ЗначенияРеквизитовФормы = ФормаИнтегрируемогоОбъекта();
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовФормы, Форма);
	
	// Если в событии формы ПриСозданииНаСервере вызывался метод
	// ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере, то имя реквизита, содержащего
	// ссылку на объект, будет браться из реквизита формы ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом.
	Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
		СсылкаНаИнтегрируемыйОбъект = Форма;
		Для Каждого Реквизит Из СтрРазделить(ИмяРеквизита, ".") Цикл
			СсылкаНаИнтегрируемыйОбъект = СсылкаНаИнтегрируемыйОбъект[Реквизит];
		КонецЦикла;
	КонецЕсли;
	
	// В остальных случаях проверим реквизиты формы Параметры.Ключ и Объект, если они есть.
	Если СсылкаНаИнтегрируемыйОбъект = Неопределено
			И (ТипЗнч(ЗначенияРеквизитовФормы.Параметры) = Тип("ДанныеФормыСтруктура")
				Или ТипЗнч(ЗначенияРеквизитовФормы.Параметры) = Тип("Структура"))
			И ЗначенияРеквизитовФормы.Параметры.Свойство("Ключ")
			И (ТипИнтегрируемогоОбъекта = Неопределено
				Или ТипЗнч(ЗначенияРеквизитовФормы.Параметры.Ключ) = ТипИнтегрируемогоОбъекта) Тогда
		СсылкаНаИнтегрируемыйОбъект = ЗначенияРеквизитовФормы.Параметры.Ключ;
	КонецЕсли;
	Если СсылкаНаИнтегрируемыйОбъект = Неопределено
			И (ТипЗнч(ЗначенияРеквизитовФормы.Объект) = Тип("ДанныеФормыСтруктура")
				Или ТипЗнч(ЗначенияРеквизитовФормы.Объект) = Тип("Структура"))
			И ЗначенияРеквизитовФормы.Объект.Свойство("Ссылка")
			И (ТипИнтегрируемогоОбъекта = Неопределено
				Или ТипЗнч(ЗначенияРеквизитовФормы.Объект.Ссылка) = ТипИнтегрируемогоОбъекта) Тогда
		СсылкаНаИнтегрируемыйОбъект = ЗначенияРеквизитовФормы.Объект.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаНаИнтегрируемыйОбъект;
	
КонецФункции

// Возвращает Строку сообщения о недопустимости подписания зашифрованного файла.
//
// Параметры:
//   ФайлСсылка - ЛюбаяСсылка - ссылка на файл.
//
// Возвращаемое значение:
//   Строка
//
Функция СтрокаСообщенияОНедопустимостиПодписанияЗашифрованногоФайла(ФайлСсылка = Неопределено) Экспорт
	
	Если ФайлСсылка = Неопределено Тогда
		Возврат НСтр("ru = 'Нельзя подписать зашифрованный файл.'");
	Иначе
		Возврат СтрШаблон(НСтр("ru = 'Нельзя подписать зашифрованный файл: %1.'"), ФайлСсылка);
	КонецЕсли;
	
КонецФункции

// Конструктор структуры, описывающей тип операции над задачей.
//
// Возвращаемое значение:
//   Структура:
//     * ВыполнитьДействиеЗадачи - Булево
//     * ВзятьВРаботу - Булево
//     * ОтменитьВзятиеВРаботу - Булево
//     * Перенаправить - Булево
//     * УстановитьФлаг - Булево
//     * ВыполнитьПодключаемоеДействиеЗадачи - Булево
//     * ВыполнитьДействиеЗадачиПоШаблону - Булево
//     * ВыбратьШаблонДляВыполненияЗадачи - Булево
//     * ОтменитьВыполнение - Булево
//
Функция ТипОперацииНадЗадачей() Экспорт
	
	ТипОперации = Новый Структура;
	ТипОперации.Вставить("ВыполнитьДействиеЗадачи", Ложь);
	ТипОперации.Вставить("ВзятьВРаботу", Ложь);
	ТипОперации.Вставить("ОтменитьВзятиеВРаботу", Ложь);
	ТипОперации.Вставить("УстановитьФлаг", Ложь);
	ТипОперации.Вставить("Перенаправить", Ложь);
	ТипОперации.Вставить("ВыполнитьПодключаемоеДействиеЗадачи", Ложь);
	ТипОперации.Вставить("ВыполнитьДействиеЗадачиПоШаблону", Ложь);
	ТипОперации.Вставить("ВыбратьШаблонДляВыполненияЗадачи", Ложь);
	ТипОперации.Вставить("ОтменитьВыполнение", Ложь);
	
	Возврат ТипОперации;
	
КонецФункции

// Обрабатывает текст исключения для показа пользователю. Убирает из текста техническую информацию.
// Полный текст ошибки нужно поместить в журнал регистрации.
//
// Параметры:
//   ТекстОшибки - Строка - текст исключения.
//
// Возвращаемое значение:
//   Строка
//
Функция УдалитьТехИнформациюИзТекстаОшибки(Знач ТекстОшибки) Экспорт
	
	МассивСтрокОшибки = СтрРазделить(ТекстОшибки, Символы.ПС);
	КоличествоСтрок = МассивСтрокОшибки.Количество();
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		ИндексСтроки = КоличествоСтрок - НомерСтроки;
		СтрокаОшибки = МассивСтрокОшибки[ИндексСтроки];
		Если СтрНайти(СтрокаОшибки, "{ОбщийМодуль.") = 1
				Или СтрНайти(СтрокаОшибки, "{Справочник.") = 1
				Или СтрНайти(СтрокаОшибки, "{Документ.") = 1
				Или СтрНайти(СтрокаОшибки, "{WebСервис.") = 1
				Или СтрНайти(СтрокаОшибки, "[ОшибкаВоВремяВыполненияВстроенногоЯзыка") = 1
				Или (НомерСтроки > 1 И ПустаяСтрока(СтрокаОшибки) И СледующаяСтрокаПустая(МассивСтрокОшибки, ИндексСтроки)) Тогда
			МассивСтрокОшибки.Удалить(ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	МассивСтрокОшибки.Добавить("");
	МассивСтрокОшибки.Добавить("-----");
	МассивСтрокОшибки.Добавить(НСтр("ru = 'Подробности см. в журнале регистрации.'"));
	
	Возврат СтрСоединить(МассивСтрокОшибки, Символы.ПС);
	
КонецФункции

// Конструктор структуры, описывающей форму клиентского приложения объекта ИС.
//
// Возвращаемое значение:
//   Структура:
//     * ИмяФормы - Строка
//     * Параметры - Неопределено
//     * Объект - Неопределено
//     * ИспользоватьИнтеграциюДО2 - Булево
//     * ИспользоватьИнтеграциюДО3 - Булево
//     * ИспользоватьПрисоединенныеФайлы1СДокументооборота - Булево
//     * ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом - Строка
//     * ИнтеграцияС1СДокументооборотом_ТипОбъектаДО - Строка
//     * ИнтеграцияС1СДокументооборотом_ИдентификаторОбъектаДО - Строка
//
Функция ФормаИнтегрируемогоОбъекта() Экспорт
	
	Форма = Новый Структура;
	Форма.Вставить("ИмяФормы", "");
	Форма.Вставить("Параметры", Неопределено);
	Форма.Вставить("Объект", Неопределено);
	Форма.Вставить("ИспользоватьИнтеграциюДО2", Ложь);
	Форма.Вставить("ИспользоватьИнтеграциюДО3", Ложь);
	Форма.Вставить("ИспользоватьПрисоединенныеФайлы1СДокументооборота", Ложь);
	Форма.Вставить("ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом", "");
	Форма.Вставить("ИнтеграцияС1СДокументооборотом_ТипОбъектаДО", "");
	Форма.Вставить("ИнтеграцияС1СДокументооборотом_ИдентификаторОбъектаДО", "");
	
	Возврат Форма;
	
КонецФункции

// Проверяет, является ли переданное значение расширением скан-копии.
//
// Параметры:
//   Расширение - Строка - расширение файла.
//   СписокРасширенийСканКопийОригиналов - Строка - список расширений скан-копий.
//
// Возвращаемое значение:
//   Булево - Истина, если переданное значение является расширением скан-копии.
//
Функция ЭтоРасширениеСканКопии(Расширение, Знач СписокРасширенийСканКопийОригиналов) Экспорт
	
	РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Расширение);
	
	СписокРасширенийСканКопийОригиналов = СтрЗаменить(СписокРасширенийСканКопийОригиналов, " ", ",");
	СписокРасширенийСканКопийОригиналов = СтрЗаменить(СписокРасширенийСканКопийОригиналов, ";", ",");
	МассивРасширенийСканКопий = СтрРазделить(СписокРасширенийСканКопийОригиналов, ",", Ложь);
	
	// Если расширения скан-копий не заданы, то не делаем автоматическую пометку скан-копией.
	КоличествоРасширенийСканКопий = МассивРасширенийСканКопий.Количество();
	Если КоличествоРасширенийСканКопий = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат МассивРасширенийСканКопий.Найти(РасширениеБезТочки) <> Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область НДПС

// Добавляет в структуру данных поля настроек доступности по состоянию.
//
// Параметры:
//   СтруктураДанных - Структура, ФормаКлиентскогоПриложения - произвольная структура, которую требуется
//     дополнить значениями НДПС.
//   НачальноеЗначение - Булево - начальное значение, которое требуется установить.
//
Процедура ДополнитьНДПС(СтруктураДанных, НачальноеЗначение = Истина) Экспорт
	
	Для Каждого Поле Из ПоляНДПС() Цикл
		СтруктураДанных.Вставить(Поле.Значение);
	КонецЦикла;
	
	Если НачальноеЗначение <> Неопределено Тогда
		УстановитьЗначенияВсехПолейНДПС(СтруктураДанных, НачальноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет наличие свойства в структуре либо наличие реквизита в форме.
//
// Параметры:
//   СтруктураДанных - Структура, ФормаКлиентскогоПриложения - произвольная структура.
//   ИмяСвойства - Строка - имя свойства, наличие которого требуется проверить.
//
// Возвращаемое значение:
//   Булево
//
Функция ЕстьСвойство(СтруктураДанных, ИмяСвойства) Экспорт
	
	Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
		Возврат СтруктураДанных.Свойство(ИмяСвойства);
	Иначе
		ПоляВСтруктуре = Новый Структура;
		ДополнитьНДПС(ПоляВСтруктуре, Неопределено);
		ЗаполнитьЗначенияСвойств(ПоляВСтруктуре, СтруктураДанных);
		Возврат ПоляВСтруктуре[ИмяСвойства] <> Неопределено;
	КонецЕсли;
	
КонецФункции

// Заполняет в структуре данных значения настроек доступности по состоянию из структуры-источника.
//
// Параметры:
//   СтруктураПриемник - Структура, ФормаКлиентскогоПриложения - произвольная структура, которую требуется
//     дополнить значениями НДПС.
//   СтруктураИсточник - Структура, ФормаКлиентскогоПриложения - произвольная структура, которая содержит
//     значения НДПС.
//
Процедура ЗаполнитьНДПСизСтруктуры(СтруктураПриемник, СтруктураИсточник) Экспорт
	
	Для Каждого Поле Из ПоляНДПС() Цикл
		Если ЕстьСвойство(СтруктураПриемник, Поле.Значение) И ЕстьСвойство(СтруктураИсточник, Поле.Значение) Тогда
			СтруктураПриемник[Поле.Значение] = СтруктураИсточник[Поле.Значение];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает cоответствие полей настроек доступности по состоянию, хранящихся в реквизитах форм БИД,
// именам свойств XDTO.
// Проверку версии сервиса ДО не используем, т.к. проверка на наличие реквизитов форм выполняется в методах заполнения.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - параметры выбора:
//     * Ключ - Строка - имя свойства XDTO.
//     * Значение - Строка - имя реквизита формы БИД.
//
Функция ПоляНДПС() Экспорт
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей["addfile"] = "СостояниеРазрешаетДобавлениеФайла";
	СоответствиеПолей["deletefile"] = "СостояниеРазрешаетУдалениеФайла";
	СоответствиеПолей["editfile"] = "СостояниеРазрешаетРедактированиеФайла";
	СоответствиеПолей["addscannedcopy"] = "СостояниеРазрешаетДобавлениеСканКопии";
	СоответствиеПолей["signatures"] = "СостояниеРазрешаетИзменениеЭП";
	СоответствиеПолей["stateAllowsStartAndTerminateProcessing"] = "СостояниеРазрешаетНачатьОбработку";
	СоответствиеПолей["stateAllowsStopAndContinueProcessing"] = "СостояниеРазрешаетОстановитьОбработку";
	СоответствиеПолей["stateAllowsRestartProcessing"] = "СостояниеРазрешаетПерезапуститьОбработку";
	
	Возврат СоответствиеПолей;
	
КонецФункции

// Устанавливает определенное значение для всех полей НДПС.
//
// Параметры:
//   СтруктураДанных - Структура, ФормаКлиентскогоПриложения - произвольная структура, в которой требуется
//     установить значения НДПС.
//   Значение - Булево - значение, которое требуется установить.
//
Процедура УстановитьЗначенияВсехПолейНДПС(СтруктураДанных, Значение) Экспорт
	
	Для Каждого Поле Из ПоляНДПС() Цикл
		Если ЕстьСвойство(СтруктураДанных, Поле.Значение) Тогда
			СтруктураДанных[Поле.Значение] = Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписи

// Возвращает структуру данных владельца подписи.
//
// Параметры:
//   Наименование - Строка - имя объекта ДО.
//   ID - Строка - идентификатор объекта ДО.
//   Тип - Строка - тип объекта XDTO.
//   Зашифрован - Булево - владелец подписи зашифрован.
//   МассивПодписей - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи
//
// Возвращаемое значение:
//   Структура - данные владельца подписей:
//     * Наименование - Строка - имя объекта ДО.
//     * ID - Строка - идентификатор объекта ДО.
//     * Тип - Строка - тип объекта XDTO.
//     * Зашифрован - Булево - владелец подписи зашифрован.
//     * МассивПодписей - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи
//                      - Неопределено
//
Функция ДанныеВладельцаПодписи(Наименование, ID, Тип, Зашифрован, МассивПодписей = Неопределено) Экспорт
	
	Если МассивПодписей = Неопределено Тогда
		МассивПодписей = Новый Массив;
	КонецЕсли;
	
	ДанныеВладельцаПодписи = Новый Структура;
	ДанныеВладельцаПодписи.Вставить("Наименование", Наименование);
	ДанныеВладельцаПодписи.Вставить("ID", ID);
	ДанныеВладельцаПодписи.Вставить("Тип", Тип);
	ДанныеВладельцаПодписи.Вставить("Зашифрован", Зашифрован);
	ДанныеВладельцаПодписи.Вставить("МассивПодписей", МассивПодписей);
	
	Возврат ДанныеВладельцаПодписи;
	
КонецФункции

// Возвращает данные, из которых будет формироваться XDTO объект DMSignature, для передачи в ДО.
//
// Параметры:
//   Подпись - ДвоичныеДанные - двоичные данные подписи.
//   ДвоичныеДанныеСертификата - ДвоичныеДанные - двоичные данные сертификата.
//   СвойстваПодписи - Структура - тут может быть или структура СвойстваПодписи, которую возвращает БСП при
//     добавлении новой подписи, или строка таблицы подписей, если это уже существующая на стороне ДО подпись.
//
// Возвращаемое значение:
//   см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураПодписи
//
Функция ДанныеПодписи(Подпись, ДвоичныеДанныеСертификата, СвойстваПодписи) Экспорт
	
	ДанныеПодписи = СтруктураПодписи();
	ДанныеПодписи.Подпись = Подпись;
	ДанныеПодписи.ДвоичныеДанныеСертификата = ДвоичныеДанныеСертификата;
	ДанныеПодписи.Отпечаток = СвойстваПодписи.Отпечаток;
	ДанныеПодписи.ДатаПодписи = СвойстваПодписи.ДатаПодписи;
	ДанныеПодписи.Комментарий = СвойстваПодписи.Комментарий;
	ДанныеПодписи.ИмяФайлаПодписи = СвойстваПодписи.ИмяФайлаПодписи;
	ДанныеПодписи.КомуВыданСертификат = СвойстваПодписи.КомуВыданСертификат;
	ДанныеПодписи.УстановившийПодпись = Строка(СвойстваПодписи.УстановившийПодпись);
	
	// Если подпись уже существует на стороне ДО - УстановившийПодписьID будет заполнен.
	// Если это новая подпись, которая была сформирована на клиенте ИС - передадим идентификатор пользователя ИС,
	// который установил подпись.
	// Если на стороне ДО пользователь по переданному идентификатору не найдется - подписавшим будет считаться
	// текущий пользователем ДО, под которым выполнено подключение к ДО через бесшовную интеграцию.
	Если СвойстваПодписи.Свойство("УстановившийПодписьID") Тогда
		ДанныеПодписи.УстановившийПодписьID = СвойстваПодписи.УстановившийПодписьID;
	Иначе
		ДанныеПодписи.УстановившийПодписьID = Строка(СвойстваПодписи.УстановившийПодпись.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат ДанныеПодписи;
	
КонецФункции

// Дополняет соответствие подписей объектов.
//
// Параметры:
//   ПодписиОбъектов - Соответствие из КлючИЗначение:
//     * Ключ - Строка - идентификатор объекта ДО, являющегося владельцем подписи.
//     * Значение - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеВладельцаПодписи
//   Наименование - Строка - имя объекта ДО.
//   ID - Строка - идентификатор объекта ДО.
//   Тип - Строка - тип объекта XDTO.
//   Зашифрован - Булево - владелец подписи зашифрован.
//   МассивПодписей - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи
//
Процедура ДополнитьПодписиОбъектов(ПодписиОбъектов, Наименование, ID, Тип, Зашифрован,
		МассивПодписей = Неопределено) Экспорт
	
	ДанныеВладельцаПодписи = ПодписиОбъектов[ID];
	
	Если ДанныеВладельцаПодписи = Неопределено Тогда
		ПодписиОбъектов.Вставить(
			ID,
			ДанныеВладельцаПодписи(Наименование, ID, Тип, Зашифрован, МассивПодписей));
		
	ИначеЕсли МассивПодписей <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеВладельцаПодписи.МассивПодписей, МассивПодписей);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров для проверки электронно-цифровой подписи.
//
// Параметры:
//   ДанныеСтроки - ДанныеФормыЭлементДерева - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//   СоответствиеИдОбъектаИДвоичныхДанных - Соответствие из КлючИЗначение:
//     * Ключ - Строка - идентификатор объекта.
//     * Значение - ДвоичныеДанные - двоичные данные объекта.
//   АдресСлепкаДокумента - Строка - адрес временного хранилища двоичных данных документа Документооборота.
//
// Возвращаемое значение:
//   Структура:
//     * ФорматДатыПроверки - Строка
//     * ДвоичныеДанныеОбъекта - ДвоичныеДанные
//                             - Неопределено
//     * Подпись - ДвоичныеДанные
//               - Неопределено
//
Функция ПараметрыПроверкиЭП(ДанныеСтроки, СоответствиеИдОбъектаИДвоичныхДанных, АдресСлепкаДокумента) Экспорт
	
	ПараметрыПроверкиЭП = Новый Структура;
	ПараметрыПроверкиЭП.Вставить("ФорматДатыПроверки", "");
	ПараметрыПроверкиЭП.Вставить("ДвоичныеДанныеОбъекта", Неопределено);
	ПараметрыПроверкиЭП.Вставить("Подпись", Неопределено);
	
	Если ДанныеСтроки.Зашифрован Тогда
		ДанныеСтроки.Неверна = Ложь;
		ДанныеСтроки.ПодписьВерна = Ложь;
		ДанныеСтроки.Статус =
			НСтр("ru = 'Проверка подписи зашифрованного файла доступна только на стороне 1С:Документооборот'");
		ДанныеСтроки.КомуВыданСертификатИСтатус =
			ДанныеСтроки.КомуВыданСертификат
			+ Символы.ПС
			+ ДанныеСтроки.Статус;
		Возврат ПараметрыПроверкиЭП;
	КонецЕсли;
	
	ПараметрыПроверкиЭП.Подпись = ПолучитьИзВременногоХранилища(ДанныеСтроки.АдресПодписи); // ДвоичныеДанные
	
	ПараметрыПроверкиЭП.ДвоичныеДанныеОбъекта = СоответствиеИдОбъектаИДвоичныхДанных[ДанныеСтроки.ОбъектID];
	
	Если ПараметрыПроверкиЭП.ДвоичныеДанныеОбъекта = Неопределено Тогда
		
		Если ДанныеСтроки.ОбъектТип = "DMFile" Тогда
			ПараметрыПроверкиЭП.ДвоичныеДанныеОбъекта =
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДвоичныеДанныеФайла(
					ДанныеСтроки.ОбъектID,
					Ложь);
		Иначе
			ПараметрыПроверкиЭП.ДвоичныеДанныеОбъекта = ПолучитьИзВременногоХранилища(АдресСлепкаДокумента); // ДвоичныеДанные
		КонецЕсли;
		
		СоответствиеИдОбъектаИДвоичныхДанных[ДанныеСтроки.ОбъектID] = ПараметрыПроверкиЭП.ДвоичныеДанныеОбъекта;
	КонецЕсли;
	
	//@skip-check module-nstr-camelcase
	ПараметрыПроверкиЭП.ФорматДатыПроверки = НСтр("ru = 'ДФ=""дд.ММ.гггг ЧЧ:мм""'");
	
	Возврат ПараметрыПроверкиЭП;
	
КонецФункции

// Определяет выделена ли подпись в переданных данных строки строки из таблицы подписей.
//
// Параметры:
//   ВыделенныеПодписи - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеПодписи
//   ДанныеСтроки - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//
// Возвращаемое значение:
//   Булево
//
Функция ПодписьВыделена(ВыделенныеПодписи, ДанныеСтроки) Экспорт
	
	ПодписьВыделена = Ложь;
	Если ТипЗнч(ВыделенныеПодписи) = Тип("Массив") Тогда
		Для Каждого СтрокаВыделеннойПодписи Из ВыделенныеПодписи Цикл
			Если СтрокаВыделеннойПодписи.ОбъектID = ДанныеСтроки.ОбъектID
					И СтрокаВыделеннойПодписи.НомерСтроки = ДанныеСтроки.НомерСтроки Тогда
				ПодписьВыделена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Нужно обойти все подписи
		ПодписьВыделена = Истина;
	КонецЕсли;
	
	Возврат ПодписьВыделена;
	
КонецФункции

// Формирует статус электронно-цифровой подписи.
//
// Параметры:
//   Неверна - Булево - признак того, что электронно-цифровая подпись недействительна.
//   ОписаниеОшибки - Строка - содержит описание ошибки проверки электронно-цифровой подписи.
//
// Возвращаемое значение:
//   Строка
//
Функция СтатусЭП(Неверна, ОписаниеОшибки) Экспорт
	
	Возврат ?(Неверна, СтрШаблон(НСтр("ru = 'Недействительна: %1'"), ОписаниеОшибки), НСтр("ru = 'Действительна'"));
	
КонецФункции

// Возвращает Строку сообщения о недопустимости подписания занятого файла.
//
// Параметры:
//   ФайлСсылка - ЛюбаяСсылка - Ссылка на файл.
//
// Возвращаемое значение:
//   Строка
//
Функция СтрокаСообщенияОНедопустимостиПодписанияЗанятогоФайла(ФайлСсылка = Неопределено) Экспорт
	
	Если ФайлСсылка = Неопределено Тогда
		Возврат НСтр("ru = 'Нельзя подписать занятый файл.'");
	Иначе
		Возврат СтрШаблон(НСтр("ru = 'Нельзя подписать занятый файл: %1.'"), ФайлСсылка);
	КонецЕсли;
	
КонецФункции

// Конструктор структуры, описывающей данные электронной подписи.
//
// Возвращаемое значение:
//   Структура:
//     * Подпись - ДвоичныеДанные
//               - Неопределено
//     * ДвоичныеДанныеСертификата - ДвоичныеДанные
//                                 - Неопределено
//     * Сертификат - ХранилищеЗначения
//                  - Неопределено
//     * Отпечаток - Строка
//                 - Неопределено
//     * ДатаПодписи - Дата
//                   - Неопределено
//     * Комментарий - Строка
//                   - Неопределено
//     * ИмяФайлаПодписи - Строка
//                       - Неопределено
//     * КомуВыданСертификат - Строка
//                           - Неопределено
//     * УстановившийПодпись - Строка
//                           - Неопределено
//     * УстановившийПодписьID - Строка
//                             - Неопределено
//
Функция СтруктураПодписи() Экспорт
	
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("Подпись", Неопределено);
	ДанныеПодписи.Вставить("ДвоичныеДанныеСертификата", Неопределено);
	ДанныеПодписи.Вставить("Сертификат", Неопределено);
	ДанныеПодписи.Вставить("Отпечаток", Неопределено);
	ДанныеПодписи.Вставить("ДатаПодписи", Неопределено);
	ДанныеПодписи.Вставить("Комментарий", Неопределено);
	ДанныеПодписи.Вставить("ИмяФайлаПодписи", Неопределено);
	ДанныеПодписи.Вставить("КомуВыданСертификат", Неопределено);
	ДанныеПодписи.Вставить("УстановившийПодпись", Неопределено);
	ДанныеПодписи.Вставить("УстановившийПодписьID", Неопределено);
	
	Возврат ДанныеПодписи;
	
КонецФункции

// Конструктор структуры, описывающей строку дерева подписей.
//
// Параметры:
//   СтрокаДереваПодписей - ДанныеФормыЭлементДерева - строка дерева подписей:
//     * АдресПодписи - Строка
//     * АдресСертификата - Строка
//     * ДатаПодписи - Дата
//     * ДатаПодписиИКомментарий - Строка
//     * ДатаПроверкиПодписи - Дата
//     * Зашифрован - Булево
//     * ИмяФайлаПодписи - Строка
//     * ИндексКартинки - Число
//     * Комментарий - Строка
//     * КомуВыданСертификат - Строка
//     * КомуВыданСертификатИСтатус - Строка
//     * Неверна - Булево
//     * НомерСтроки - Число
//     * Объект - Строка
//     * ОбъектID - Строка
//     * ОбъектИмя - Строка
//     * ОбъектТип - Строка
//     * Отпечаток - Строка
//     * ПодписьВерна - Булево
//     * Статус - Строка
//     * УстановившийПодпись - Строка
//     * УстановившийПодписьID - Строка
//
// Возвращаемое значение:
//   Структура:
//     * АдресПодписи - Строка
//     * АдресСертификата - Строка
//     * ДатаПодписи - Дата
//     * ДатаПодписиИКомментарий - Строка
//     * ДатаПроверкиПодписи - Дата
//     * Зашифрован - Булево
//     * ИмяФайлаПодписи - Строка
//     * ИндексКартинки - Число
//     * Комментарий - Строка
//     * КомуВыданСертификат - Строка
//     * КомуВыданСертификатИСтатус - Строка
//     * Неверна - Булево
//     * НомерСтроки - Число
//     * Объект - Строка
//     * ОбъектID - Строка
//     * ОбъектИмя - Строка
//     * ОбъектТип - Строка
//     * Отпечаток - Строка
//     * ПодписьВерна - Булево
//     * Статус - Строка
//     * УстановившийПодпись - Строка
//     * УстановившийПодписьID - Строка
//     * ТипПодписи - ПеречислениеСсылка.ТипыПодписиКриптографии
//
Функция СтруктураСтрокиДереваПодписей(СтрокаДереваПодписей) Экспорт
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("АдресПодписи", СтрокаДереваПодписей.АдресПодписи);
	СтруктураСтроки.Вставить("АдресСертификата", СтрокаДереваПодписей.АдресСертификата);
	СтруктураСтроки.Вставить("ДатаПодписи", СтрокаДереваПодписей.ДатаПодписи);
	СтруктураСтроки.Вставить("ДатаПодписиИКомментарий", СтрокаДереваПодписей.ДатаПодписиИКомментарий);
	СтруктураСтроки.Вставить("ДатаПроверкиПодписи", СтрокаДереваПодписей.ДатаПроверкиПодписи);
	СтруктураСтроки.Вставить("Зашифрован", СтрокаДереваПодписей.Зашифрован);
	СтруктураСтроки.Вставить("ИмяФайлаПодписи", СтрокаДереваПодписей.ИмяФайлаПодписи);
	СтруктураСтроки.Вставить("ИндексКартинки", СтрокаДереваПодписей.ИндексКартинки);
	СтруктураСтроки.Вставить("Комментарий", СтрокаДереваПодписей.Комментарий);
	СтруктураСтроки.Вставить("КомуВыданСертификат", СтрокаДереваПодписей.КомуВыданСертификат);
	СтруктураСтроки.Вставить("КомуВыданСертификатИСтатус", СтрокаДереваПодписей.КомуВыданСертификатИСтатус);
	СтруктураСтроки.Вставить("Неверна", СтрокаДереваПодписей.Неверна);
	СтруктураСтроки.Вставить("НомерСтроки", СтрокаДереваПодписей.НомерСтроки);
	СтруктураСтроки.Вставить("Объект", СтрокаДереваПодписей.Объект);
	СтруктураСтроки.Вставить("ОбъектID", СтрокаДереваПодписей.ОбъектID);
	СтруктураСтроки.Вставить("ОбъектИмя", СтрокаДереваПодписей.ОбъектИмя);
	СтруктураСтроки.Вставить("ОбъектТип", СтрокаДереваПодписей.ОбъектТип);
	СтруктураСтроки.Вставить("Отпечаток", СтрокаДереваПодписей.Отпечаток);
	СтруктураСтроки.Вставить("ПодписьВерна", СтрокаДереваПодписей.ПодписьВерна);
	СтруктураСтроки.Вставить("Статус", СтрокаДереваПодписей.Статус);
	СтруктураСтроки.Вставить("УстановившийПодпись", СтрокаДереваПодписей.УстановившийПодпись);
	СтруктураСтроки.Вставить("УстановившийПодписьID", СтрокаДереваПодписей.УстановившийПодписьID);
	
	Попытка
		ОбычнаяCMS = "Перечисление.ТипыПодписиКриптографии.ОбычнаяCMS";
		СтруктураСтроки.Вставить("ТипПодписи", ПредопределенноеЗначение(ОбычнаяCMS));
	Исключение
		ВызватьИсключение НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'");
	КонецПопытки;
	
	Возврат СтруктураСтроки;
	
КонецФункции

// Преобразует 2-уровневое дерево в массив.
//
// Параметры:
//   ДеревоПодписей - ДанныеФормыДерево - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//   ВыделенныеСтроки - Массив из Число - выделенные строки в дереве подписей.
//   ОбъектID - Строка - заполняется если нужно получить подписи конкретного объекта.
//
// Возвращаемое значение:
//   Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//
Функция ТаблицаПодписей(ДеревоПодписей, ВыделенныеСтроки = Неопределено, ОбъектID = Неопределено) Экспорт
	
	ТаблицаПодписей = Новый Массив;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		
		ЭлементыПервогоУровня = ДеревоПодписей.ПолучитьЭлементы();
		Для Каждого СтрокаУровняОдин Из ЭлементыПервогоУровня Цикл
			ЭлементыВторогоУровня = СтрокаУровняОдин.ПолучитьЭлементы();
			Для Каждого Строка Из ЭлементыВторогоУровня Цикл
				ПодходитПоID = Истина;
				Если ОбъектID <> Неопределено Тогда
					ПодходитПоID = (Строка.ОбъектID = ОбъектID);
				КонецЕсли;
				Если Не ПустаяСтрока(Строка.Объект) И ПодходитПоID Тогда
					ТаблицаПодписей.Добавить(СтруктураСтрокиДереваПодписей(Строка));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Элемент Из ВыделенныеСтроки Цикл
			Строка = ДеревоПодписей.НайтиПоИдентификатору(Элемент);
			ПодходитПоID = Истина;
			Если ОбъектID <> Неопределено Тогда
				ПодходитПоID = (Строка.ОбъектID = ОбъектID);
			КонецЕсли;
			Если Не ПустаяСтрока(Строка.Объект) И ПодходитПоID Тогда
				ТаблицаПодписей.Добавить(СтруктураСтрокиДереваПодписей(Строка));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаПодписей;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Извлечь текст из объекта ЧтениеXML (прочитанного из файла OpenDocument).
//
Функция ИзвлечьТекстИзContentXML(ЧтениеXML)
	
	ИзвлеченныйТекст = "";
	ПоследнееИмяТега = "";
	
#Если Не ВебКлиент Тогда
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПоследнееИмяТега = ЧтениеXML.Имя;
			
			Если ЧтениеXML.Имя = "text:p" Тогда
				Если НЕ ПустаяСтрока(ИзвлеченныйТекст) Тогда
					ИзвлеченныйТекст = ИзвлеченныйТекст + Символы.ПС;
				КонецЕсли;
			КонецЕсли;
			
			Если ЧтениеXML.Имя = "text:line-break" Тогда
				Если НЕ ПустаяСтрока(ИзвлеченныйТекст) Тогда
					ИзвлеченныйТекст = ИзвлеченныйТекст + Символы.ПС;
				КонецЕсли;
			КонецЕсли;
			
			Если ЧтениеXML.Имя = "text:tab" Тогда
				Если НЕ ПустаяСтрока(ИзвлеченныйТекст) Тогда
					ИзвлеченныйТекст = ИзвлеченныйТекст + Символы.Таб;
				КонецЕсли;
			КонецЕсли;
			
			Если ЧтениеXML.Имя = "text:s" Тогда
				
				СтрокаДобавки = " "; // пробел
				
				Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
					Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
						Если ЧтениеXML.Имя = "text:c" Тогда
							ЧислоПробелов = Число(ЧтениеXML.Значение);
							СтрокаДобавки = "";
							Для Индекс = 0 По ЧислоПробелов - 1 Цикл
								СтрокаДобавки = СтрокаДобавки + " "; // пробел
							КонецЦикла;
						КонецЕсли;
					КонецЦикла
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ИзвлеченныйТекст) Тогда
					ИзвлеченныйТекст = ИзвлеченныйТекст + СтрокаДобавки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			Если СтрНайти(ПоследнееИмяТега, "text:") <> 0 Тогда
				ИзвлеченныйТекст = ИзвлеченныйТекст + ЧтениеXML.Значение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
#КонецЕсли
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

// Возвращает большое простое число, используемое как модуль кольца классов вычетов.
// Должно быть больше любого из кодируемых чисел.
//
// Возвращаемое значение:
//   Число
//
Функция МодульКольцаВычетов()
	
	Возврат 4294967291; // больше любого из вероятных сочетаний двух символов пароля.
	
КонецФункции

// Рассчитывает обратный модуль.
//
// Параметры:
//   ЧислоК - Число.
//
// Возвращаемое значение:
//   Число - такое, что (ЧислоК * ОбратныйМодуль(ЧислоК)) % Модуль = 1 для всех
//     положительных ЧислоК < Модуль.
//
Функция ОбратныйМодуль(Знач ЧислоК)
	
	Модуль = МодульКольцаВычетов();
	ЧислоК = ЧислоК % Модуль;
	
	Если ЧислоК < 0 Тогда
		Разложение = РазложитьНОД(Модуль, -ЧислоК);
		МножительРазложения = -Разложение[2];
	Иначе
		Разложение = РазложитьНОД(Модуль, ЧислоК);
		МножительРазложения = Разложение[2];
	КонецЕсли;
	
	Возврат (Модуль + МножительРазложения) % Модуль;
	
КонецФункции

// Разделяет число-секрет на указанное количество частей по алгоритму Шамира.
//
// Параметры:
//   Число - Число - разделяемое число, от 0 до 2^32 - 1.
//   Генератор - ГенераторСлучайныхЧисел - генератор случайных чисел, желательно сохранять его между вызовами.
//   Частей - Число - количество частей, на которые разделяется число.
//   Обязательных - Число - количество частей, требуемых для восстановления.
//
// Возвращаемое значение:
//   Массив из Число - Массив пар чисел вида (1, 123), (2, 234), (3, 345), необходимых для восстановления.
//
Функция РазделитьЧисло(Число, Генератор = Неопределено, Частей = 2, Обязательных = 2)
	
#Если Не ВебКлиент Тогда
	
	Если Генератор = Неопределено Тогда
		Генератор = Новый ГенераторСлучайныхЧисел(ТекущаяДата() - Дата(1, 1, 1)); // Использование оправдано: ГСЧ.
	КонецЕсли;
	Модуль = МодульКольцаВычетов();
	
	Пока Истина Цикл
		Результат = Новый Массив;
		Коэффициенты = Новый Массив;
		Коэффициенты.Добавить(Число);
		Коэффициенты.Добавить(Цел(Генератор.СлучайноеЧисло(0, Модуль - 1)));
		Коэффициенты.Добавить(Цел(Генератор.СлучайноеЧисло(0, Модуль - 1)));
		Для Часть = 1 По Частей Цикл
			Значение = Число;
			Для Степень = 1 По Обязательных - 1 Цикл
				Значение = (Значение + (Коэффициенты[Степень] * (Pow(Часть, Степень) % Модуль)) % Модуль) % Модуль;
			КонецЦикла;
			Пара = Новый Массив;
			Пара.Добавить(Часть);
			Пара.Добавить(Значение);
			Результат.Добавить(Пара);
		КонецЦикла;
		Если СобратьЧисло(Результат) = Число Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
#Иначе
	
	ВызватьИсключение НСтр("ru = 'Функция не поддерживается в веб-клиенте.'");
	
#КонецЕсли
	
КонецФункции

// Выполняет разложение наибольшего общего делителя пары чисел А и В.
//
// Параметры:
//   ЧислоА - Число.
//   ЧислоВ - Число.
//
// Возвращаемое значение:
//   Массив из Число - массив (X, Y, Z), такой, что:
//     X - наибольший общий делитель ЧислоА и ЧислоВ,
//     X = ЧислоА * Y + ЧислоВ * Z.
//
Функция РазложитьНОД(Знач ЧислоА, Знач ЧислоВ)
	
	Результат = Новый Массив;
	
	Если ЧислоВ = 0 Тогда
		Результат.Добавить(ЧислоА);
		Результат.Добавить(1);
		Результат.Добавить(0);
	Иначе
		Частное = Цел(ЧислоА / ЧислоВ);
		Модуль = ЧислоА % ЧислоВ;
		Разложение = РазложитьНОД(ЧислоВ, Модуль);
		Результат.Добавить(Разложение[0]);
		Результат.Добавить(Разложение[2]);
		Результат.Добавить(Разложение[1] - Разложение[2] * Частное);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет пустая ли строка, следующая за индексом текущей строки.
//
// Параметры:
//   МассивСтрок - Массив из Строка - массив строк.
//   ИндексТекущейСтроки - Число - индекс текущей строки.
//
// Возвращаемое значение:
//   Булево
//
Функция СледующаяСтрокаПустая(МассивСтрок, ИндексТекущейСтроки)
	
	Если ИндексТекущейСтроки >= МассивСтрок.ВГраница() Тогда
		Возврат Истина;
	Иначе
		Возврат ПустаяСтрока(МассивСтрок[ИндексТекущейСтроки + 1])
	КонецЕсли;
	
КонецФункции

// Собирает число, разделенное по алгоритму Шамира на части функцией РазделитьЧисло.
//
// Параметры:
//   РазделенноеЧисло - Массив из Число - массив пар чисел вида (1, 123), (2, 234), ...
//
// Возвращаемое значение:
//   Число - исходное число.
//
Функция СобратьЧисло(РазделенноеЧисло)
	
	Результат = 0;
	Модуль = МодульКольцаВычетов();
	Для Строка = 0 По РазделенноеЧисло.Количество() - 1 Цикл
		Нумератор = 1;
		Делитель = 1;
		Для Колонка = 0 По РазделенноеЧисло.Количество() - 1 Цикл
			Если Строка = Колонка Тогда
				Продолжить;
			КонецЕсли;
			От = РазделенноеЧисло[Строка][0];
			До = РазделенноеЧисло[Колонка][0];
			Нумератор = (Нумератор * -До) % Модуль;
			Делитель = (Делитель * (От - До)) % Модуль;
		КонецЦикла;
		Значение = РазделенноеЧисло[Строка][1];
		Результат = (Модуль + Результат + (Значение * Нумератор * ОбратныйМодуль(Делитель))) % Модуль;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает число из его шестнадцатеричного представления. Может вызывать исключение.
//
// Параметры:
//   Представление - Строка - шестнадцатеричное число.
//
// Возвращаемое значение:
//   Число - преобразованное число.
//
Функция ЧислоИзШестнадцатеричногоПредставления(Знач Представление)
	
	Если Представление = "" Тогда
		Возврат 0;
	КонецЕсли;
	Представление = ВРег(Представление);
	
	Результат = 0;
	Пока Представление <> "" Цикл
		Разряд = Лев(Представление, 1);
		Представление = Сред(Представление, 2);
		Если Разряд >= "0" И Разряд <= "9" Тогда
			Результат = Результат * 16 + КодСимвола(Разряд, 1) - КодСимвола("0");
		ИначеЕсли Разряд >= "A" И Разряд <= "F" Тогда
			Результат = Результат * 16 + 10 + КодСимвола(Разряд, 1) - КодСимвола("A");
		Иначе
			ВызватьИсключение НСтр("ru = 'Ошибочный символ в шестнадцатеричной строке.'");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает шестнадцатиричное представление числа.
//
// Параметры:
//   Число - Число - целое число.
//   Разрядов - Число - минимальная ширина результата.
//            - Неопределено - не дополнять нулями.
//
// Возвращаемое значение:
//   Строка - шестнадцатиричное представление числа, возможно,
//   дополненное нулями до указанного количества разрядов.
//
Функция ШестнадцатиричноеПредставлениеЧисла(Знач Число, Разрядов = Неопределено)
	
	Если Число = 0 И Разрядов = Неопределено Тогда
		Возврат "0";
	КонецЕсли;
	
	Результат = "";
	НРазряда = 0;
	Пока Истина Цикл
		НРазряда = НРазряда + 1;
		Если Число = 0 Тогда // Возможно, следует дополнить до указанного числа разрядов.
			Если Разрядов = Неопределено Тогда
				Прервать;
			ИначеЕсли НРазряда > Разрядов Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		ПравыйРазряд = Число % 16;
		Число = Цел(Число / 16);
		Если ПравыйРазряд > 9 Тогда
			Результат = Символ(КодСимвола("A") + ПравыйРазряд - 10) + Результат;
		Иначе
			Результат = Символ(КодСимвола("0") + ПравыйРазряд) + Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти