#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ИсточникПечати") Тогда
		
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для непосредственного использования.'");
		
	КонецЕсли;
	
	Обработки.РеквизитыПечати.ЗаполнитьНастройкиПечати(Параметры.ИсточникПечати, НастройкиПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрытьФорму(НастройкиПечати.ИмяФормы, НастройкиПечати.ПараметрыПечати);
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
